[{"soal": "Manakah yang bukan termasuk metode pengambil keputusan?", "a": "a. Profile Matching", "b": "b. AHP", "c": "c. Weighted  Product", "d": "d. K-Means", "e": "e. Topsis", "benar": "D"}, {"soal": "Urutan profile matching adalah sebagai berikut", "a": "a. Perhitungan gap, pembobotan, identifikasi dan perhitungan nilai core dan secondary core, perhitungan nilai total, perhitungan nilai total.", "b": "b. Pembobotan, perhitungan gap, identifikasi dan perhitungan nilai core dan secondary core, penentuan ranking alternatif, perhitungan nilai total", "c": "c. Perhitungan nilai total, perhitungan nilai total, identifikasi dan perhitungan nilai core dan secondary core, pembobotan, dan perhitungan gap.", "d": "d. Penentuan ranking alternatif, identifikasi dan perhitungan nilai core dan secondary core, pembobotan, perhitungan gap.", "e": "e. Semua salah", "benar": "A"}, {"soal": "Apakah yang dimaksud dengan metode weighted product?", "a": "a. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter", "b": "b. Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making", "c": "c. Mencari penjumlahan  terbobot dari rating kinerja pada setiap alternatif pada semua atribut", "d": "d. metoda pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait", "e": "e. metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif namun juga memiliki jarak terpanjang dari solusi ideal negatif", "benar": "B"}, {"soal": "Manakah yang termasuk fitur umum dalam Multiple Criteria Desicion Making", "a": "a. Evindence value", "b": "b. Nilai y maksimal", "c": "c. Konflik antar kriteria", "d": "d. Interval", "e": "e. Salah semua", "benar": "C"}, {"soal": "Pada motode Weighted Product, dalam menentukan nilai skala dari setiap kriteria, digunakan data berjenis kualitatif. Pernyataan berikut adalah ", "a": "a. Benar", "b": "b. Salah", "c": "", "d": "", "e": "", "benar": "A"}, {"soal": "Melakukan normalisasi matriks keputusan pada metode SAW adalah dengan cara ...", "a": "a. Mengurutkan data dari terkecil hingga terbesar", "b": "b. Mengkalikan nilai terakhir dengan 1000", "c": "c. Menentukan nilai terbesar setiap kriteria", "d": "d. Menghapus nilai yang tidak digunakan", "e": "e. Menghitung nilai rating kinerja ternormalisasi", "benar": "E"}, {"soal": "Rating kecocokan seharusnya berjumlah ganjil agar memudahkan pengambilan keputusan. Pernyataan tersebut adalah...", "a": "a. Benar", "b": "b. Salah", "c": "", "d": "", "e": "", "benar": "A"}, {"soal": "Pada metode SAW, bobot referensi diambil dari...", "a": "a. Pakar/ahli", "b": "b. Riset", "c": "c. Data sebelumnya", "d": "d. Perkiraan", "e": "e. Rumus", "benar": "A"}, {"soal": "Metode AHP adalah singkatan dari ...", "a": "a. Analysis Hierarchy Process", "b": "b. Analytical Hierarchy Process", "c": "c. Analytical Hierarchical Process", "d": "d. Analysis Hierarchy Preprocessor", "e": "e. Analytical Higher Process", "benar": "B"}, {"soal": "Metode Topsis tidak termasuk dalam salah satu teknik Multi-Criteria Decision Making adalah pernyataan...", "a": "a. Benar", "b": "b. Salah", "c": "", "d": "", "e": "", "benar": "B"}, {"soal": "Menurut Kusrini, Profile Matching adalah…", "a": "a. Profile Matching adalah mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter", "b": "b. Profile matching adalah sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati", "c": "c. Dalam proses profile matching, secara garis besar adalah proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap", "d": "d. Dalam profile matching dilakukan penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut", "e": "", "benar": "B"}, {"soal": "Ada beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making, yaitu", "a": "a. Alternative, Atribut, Konflik antar kriteria, Bobot Keputusan, dan Matriks Keputusan", "b": "b. Alternative, Variabel, Kriteria, Bobot dan Matriks Keputusan", "c": "c. Multi Atribut, Varibael, Konflik antar kriteria, dan Bobot Keputusan", "d": "d. Multi Atribut, Konflik, Bobot, dan Matriks Keputusan ", "e": "", "benar": "A"}, {"soal": "“Metode Weighted Product (WP) Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan,”, Merupakan pernyataan menurut…", "a": "a. Kusrini", "b": "b. Shinta", "c": "c. Kusumadewi", "d": "d. Mufid", "e": "", "benar": "C"}, {"soal": "(1) Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.\n(2) Menentukan rating kecocokan setiap alternatif pada setiap kriteria.\n(3) Membuat matriks keputusan berdasarkan kriteria (Ci).\n(4) Kemudian melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.\n(5) Hasil akhir diperoleh dari proses perangkingan yaitu penjumlahan dari perkalian matriks  ternormalisasi R dengan vector bobot sehingga diperoleh nilai terbesar yang dipilih sebagai  alternatif terbaik (Ai) sebagi solusi.\nBerdasarkan langka-langkah penyelesaian metode SAW tersebut, merupakan pernyataan menurut…", "a": "a. Frieyadie", "b": "b. Kursini", "c": "c. Mufid", "d": "d. Kusumadewi", "e": "", "benar": "A"}, {"soal": "“TOPSIS adalah salah satu teknik MCDM (Multi Criteria Decision Making) yang sangat sederhana dan mudah diimplementasikan, sehingga TOPSIS digunakan ketika pengambil keputusan memilih metode pengambilan keputusan dengan pendekatan pembobotan yang sederhana” pernyataan tersebut merupakan pendapat…", "a": "a. Alptekin", "b": "b. Frieyadie", "c": "c. Mufid", "d": "d. Kusumadewi", "e": "", "benar": "A"}, {"soal": "Yang bukan merupakan Metode untuk penyelesaian masalah MADM adalah?", "a": "a. TOPSIS", "b": "b. AHP", "c": "c. SAW", "d": "d. MCDM", "e": "", "benar": "D"}, {"soal": "Penentuan urutan alternatif pada model Profile Matching berdasarkan tingkat profil ... yang paling mendekati profil ... (Hamka dan Harjono 2019). Isian yang paling tepat untuk titik-titik di atas adalah.. ", "a": "A. target dan alternatif", "b": "B. alternatif dan ideal", "c": "C. target dan ideal", "d": "D. alternatif dan target", "e": "", "benar": "B"}, {"soal": "Rumus perhitungan gap pada profile matching adalah.. ", "a": "A. Gap = Nilai profil target - Nilai profil alternatif", "b": "B. Gap = Nilai profil alternatif - Nilai profil ideal", "c": "C. Gap = Nilai profi target - Nilai profil ideal", "d": "D. Gap = Nilai profil alternatif - Nilai profil target", "e": "", "benar": "D"}, {"soal": "Berapa total langkah perhitungan yang digunakan dalam metode WP (Weighted Product)? ", "a": "A. 3", "b": "B. 4", "c": "C. 5", "d": "D. 6", "e": "", "benar": "D"}, {"soal": "Apa langkah pertama dalam metode WP (Weighted Product)? ", "a": "A. Normalisasi bobot", "b": "B. Membuat peringkat nilai vektor V", "c": "C. Menentukan kriteria", "d": "D. Menentukan peringkat kecocokan kriteria", "e": "", "benar": "C"}, {"soal": "Ada berapa total langkah perhitungan dalam metode SAW (Simple Additive Weighting)? ", "a": "A. 3", "b": "B. 4", "c": "C. 5", "d": "D. 6", "e": "", "benar": "C"}, {"soal": "Hasil akhir metode SAW diperoleh dari proses perangkingan yaitu penjumlahan dari perkalian ... dengan .. sehingga diperoleh nilai terbesar yang dipilih sebagai  alternatif terbaik (Ai) sebagi solusi. Isian yang paling tepat untuk titik-titik di atas adalah... ", "a": "A. matriks  ternormalisasi R - vector bobot", "b": "B. matriks keputusan - vector bobot", "c": "C.  vector bobot - matriks  ternormalisasi R", "d": "D. vector bobot - matriks keputusan", "e": "", "benar": "A"}, {"soal": "Pada metode AHP (Analytical Hierarcy Process), terdapat 3 prinsip. Yang bukan prinsip tersebut adalah.. ", "a": "A. Menyusun Hirarki", "b": "B. Membuat Proses Analisis ", "c": "C. Menentukan Prioritas", "d": "D. Menghitung Consistency Ratio", "e": "", "benar": "B"}, {"soal": "Kriteria memiliki ... yang berbeda-beda; demikian pula halnya alternatif memiliki preferensi yang berbeda menurut masing-masing kriteria yang ada.  Isian yang paling tepat untuk titik-titik diatas adalah ... ", "a": "A. Derajat asosiasi", "b": "B. Derajat kemiringan", "c": "C. Derajat kepentingan", "d": "D. Derajat konsistensi", "e": "", "benar": "C"}, {"soal": "Langkah pertama secara umum dalam prosedur TOPSIS adalah .. ", "a": "A. Menentukan nilai preferensi untuk setiap alternatif", "b": "B. Membuat matrik keputusan ternormalisasi (R)", "c": "C. Membuat matrik keputusan ternormalisasi  terbobot", "d": "D. Membuat matrik keputusan melalui  rating kecocokan alternatif terhadap kriteria (X)", "e": "", "benar": "D"}, {"soal": "akan semakin besar jika j adalah ... ", "a": "A. Atribut yang lebih besar dari nol.", "b": "B. Atribut positif", "c": "C. Atribut keuntungan", "d": "D. Atribut kebaikan ", "e": "", "benar": "C"}, {"soal": "Hasil akhir dari proses profile matching adalah ?", "a": "A. Ranking", "b": "B. Nilai core factor", "c": "C. Pembobotan", "d": "", "e": "", "benar": "A"}, {"soal": "Salah satu proses profile matching adalah?", "a": "A. Penilaian angka", "b": "B. Perhitungan Gap", "c": "C. Pengujian nilai total", "d": "", "e": "", "benar": "B"}, {"soal": "Metode dalam sistem pendukung keputusan yang dapat menyelesaikan masalah Multi Attribute Decision Making adalah?", "a": "A. Weighted Product (WP)", "b": "B. AHP", "c": "C. SAW", "d": "", "e": "", "benar": "A"}, {"soal": "Salah satu fitur umum yang digunakan dalam Multiple Criteria Decision Making adalah?", "a": "A. Konflik antar bobot", "b": "B. Matriks koordinat", "c": "C. Konflik antar kriteria", "d": "", "e": "", "benar": "C"}, {"soal": "Normalisasi bobot pada metode WP dilakukan dengan melakukan pembagian bobot setiap kriteria dengan ?", "a": "A. Atribut", "b": "B. Jumlah keseluruhan bobot kriteria", "c": "C. Bobot keputusan", "d": "", "e": "", "benar": "B"}, {"soal": "Salah satu kelebihan metode SAW adalah ?", "a": "A. Terdapat mekanisme normalisasi atribut", "b": "B. Penilaian akan lebih tepat, karena nilai kriteria dan bobot preferensi tidak ditentukan", "c": "C. Dapat menemukan nilai bobot untuk masing-masing alternatif", "d": "", "e": "", "benar": "C"}, {"soal": "Normalisasi matriks keputusan untuk menghitung?", "a": "A. Nilai rating kinerja ternormalisasi (Rij)", "b": "B. Nilai atribut yang dimiliki dari setiap kriteria (Xij)", "c": "C. benefit", "d": "", "e": "", "benar": "A"}, {"soal": "Alternatif Ai dikatakan alternatif terbaik apabila perhitungan nilai Vi(nilai untuk setiap alternatif)?", "a": "A. Lebih kecil", "b": "B. Lebih besar", "c": "C. Sama besar", "d": "", "e": "", "benar": "B"}, {"soal": "Berdasarkan tujuannya, Multiple Criteria Decision Making (MCDM) dibagi menjadi?", "a": "A. 3", "b": "B. 2", "c": "C. 4", "d": "", "e": "", "benar": "B"}, {"soal": "Salah satu Multiple Criteria Decision Making (MCDM) ialah?", "a": "A. Multiple Kontinyu Decision Making", "b": "B. Multiple Subjective Decision Making", "c": "C. Multiple Objective Decision Making", "d": "", "e": "", "benar": "C"}, {"soal": "Berikut yang bukan komponen dari SPK adalah :", "a": "A. Data Management", "b": "B. Model Management", "c": "C. Communication", "d": "D. Controller Management", "e": "", "benar": "D"}, {"soal": "Metode yang menggunakan prinsip bahwa alternatif yang dipilih harus memiliki jarak terpendek dari solusi ideal positif dan memiliki jarak terjauh dari solusi ideal negatif dari titik geometris menggunakan jarak euclidean untuk menentukan kedekatan relatif antara alternatif ke solusi yang optimal adalah :", "a": "A. TOPSIS", "b": "B. Fuzzy", "c": "C. SAW", "d": "D. Algen", "e": "", "benar": "A"}, {"soal": "Apa kepanjangan dari metode SAW ?", "a": "A. Simple Additive Weighting ", "b": "B. Simple Adaptive Weighting", "c": "C. Source Additive Weighting", "d": "D. Source Adaptive Weighting", "e": "", "benar": "A"}, {"soal": "Apa kepanjangan dari AHP ?", "a": "A. Analytical Hierarchy Proccess", "b": "B. Analytical Hierarchy Procedure", "c": "C. Additive Hierarchy Process", "d": "D. Analytical Heighting Process", "e": "", "benar": "A"}, {"soal": "Hasil pemecahan masalah yang dihadapinya dengan tegas merupakan pengertian dari?", "a": "A. Keputusan", "b": "B. Pengambilan Keputusan", "c": "C. DSS", "d": "D. Sistem Pendukung Keputusan", "e": "", "benar": "A"}, {"soal": "Suatu proses pemilihan alternatif terbaik dari beberapa alternatif secara sistematis untuk ditindaklanjuti (digunakan) sebagai suatu cara pemecahan masalah merupakan pengertian dari?", "a": "A. Pengambilan Keputusan", "b": "B. Keputusan", "c": "C. Sistem Pendukung Keputusan", "d": "D. Metode Waterfall", "e": "", "benar": "A"}, {"soal": "Yang bukan merupakan fase proses pengambilan keputusan meliputi tiga fase utama adalah...", "a": "A. Intelegensi", "b": "B. Planning", "c": "C. Desain", "d": "D. Kriteria", "e": "", "benar": "B"}, {"soal": "Pengambilan keputusan meliputi scanning (Pemindaian) lingkungan, entah secara intermiten ataupun terus menerus berada pada fase...", "a": "A. Intelegensi", "b": "B. Planning", "c": "C. Desain", "d": "D. Kriteria", "e": "", "benar": "A"}, {"soal": "Fase yang meliputi penemuan atau mengembangkan dan menganalisis tindakan yang mungkin untuk dilakukan adalah.....", "a": "A. Intelegensi", "b": "B. Planning", "c": "C. Desain", "d": "D. Kriteria", "e": "", "benar": "C"}, {"soal": "Yang bukan merupakan keuntungan penggunaan SPK adalah...", "a": "A. Mampu mendukung pencarian solusi dari berbagai permasalahan yang kompleks.", "b": "B. Dapat merespon dengan cepat pada situasi yang tidak diharapkan dalam konsisi yang berubah-ubah.", "c": "C. Meningkatkan kontrol manajemen dan kinerja.", "d": "D. Menurunkan kontrol manajemen dan kinerja.", "e": "", "benar": "D"}, {"soal": "Di bawah ini manakah yang bukan merupakan komponen-komponen dalam SPK?", "a": "A. Communication", "b": "B. Data Management", "c": "C. Knowledge Management", "d": "D. Model Management", "e": "E. Communication Management", "benar": "E"}, {"soal": "Subsistem optional yang dapat mendukung subsistem lain atau bertindak sebagai komponen yang berdiri sendiri, merupakan penjabaran dari salah satu komponen dari SPK yaitu?", "a": "A. Communication", "b": "B. Data Management", "c": "C. Knowledge Management", "d": "D. Model Management", "e": "E. Communication Management", "benar": "C"}, {"soal": "Umur, temperatur, tanggungan, pendapatan, pengeluaran, dsb merupakan contoh dari istilah dalam sistem fuzzy yaitu?", "a": "A. Semesta Pembicaraan", "b": "B. Himpunan Fuzzy", "c": "C. Variabel Fuzzy", "d": "D. Domain Fuzzy", "e": "E. Inferensi", "benar": "C"}, {"soal": "Di bawah ini merupakan metode dalam untuk menyelesaikan masalah MADM, kecuali..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "D"}, {"soal": "Dekomposisi (Decomposition), Penilaian Komparasi (Comparative Judgment), dan Penentuan Prioritas (Synthesis of Priority), merupakan prinsip dasar dari..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "B"}, {"soal": "proses pemilihan alternatif terbaik dari beberapa alternatif secara sistematis untuk\nditindaklanjuti (digunakan) sebagai suatu cara pemecahan masalah merupakan pengertian dari :", "a": "A. Sistem Pendukung Keputusan", "b": "B. Sistem Fuzzy", "c": "C. Sistem analisis ", "d": "D. Sistem Desain", "e": "E. Sistem Basisdata", "benar": "A"}, {"soal": "ada berapa karakteristik dari SPK menurut Turban?", "a": "A. 5", "b": "B. 6", "c": "C. 7", "d": "D. 8", "e": "E. 9", "benar": "C"}, {"soal": "Dalam AHP, Terdapat tiga prinsip dasar, salah satunya adalah Komparasi atau Comparative judgement\napa itu comparative judgement?", "a": "A. Prinsip ini membuat penilaian tentang kepentingan relatif dua elemen pada suatu tingkat tertentu yang berkaitan dengan tingkat di atasnya.", "b": "B. Prinsip ini membuat penilaian tentang kepentingan relatif dua elemen pada suatu tingkat tertentu yang berkaitan dengan tingkat di bawahnya.", "c": "C. Prinsip ini membuat penilaian tentang kepentingan relatif satu elemen saja pada suatu tingkat tertentu yang berkaitan dengan tingkat di atasnya.", "d": "D. Prinsip yang melihat prioritas dari daerah", "e": "E. Prinsip yang memecah persoalan menjadi unsur yang utuh", "benar": "A"}, {"soal": "Keputusan adalah suatu pengakhiran daripada proses pemikiran\ntentang suatu masalah atau problema untuk menjawab pertanyaan apa\nyang harus diperbuat guna mengatasi masalah tersebut, dengan\nmenjatuhkan pilihan pada suatu alternatif. arti keputusan diatas merupakan definis keputusan menurut?", "a": "A. George R. Terry", "b": "B. Prof. Dr. Prajudi Atmosudirjo, SH", "c": "C. James A.F. Stoner", "d": "D. Turban", "e": "E. S.P. Siagian", "benar": "B"}, {"soal": "berikut ini merupakan salah satu contoh tahapan dalam Sistem pendukung keputusan, kecuali..", "a": "A. Intelligence", "b": "B. Design", "c": "C. Choice", "d": "D. Implementation", "e": "E. Survey", "benar": "E"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter disebut juga dengan...", "a": "A. TOPSIS.", "b": "B. SAW.", "c": "C. Profile Matching.", "d": "D. AHP.", "e": "E. Weighted Product.", "benar": "C"}, {"soal": "Dibawah ini, manakah yang bukan termasuk dari prosedur TOPSIS...", "a": "A. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X).", "b": "B. Membuat matrik keputusan ternormalisasi (R).", "c": "C. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF).", "d": "D. Membuat matrik keputusan ternormalisasi terbobot.", "e": "E. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif.", "benar": "C"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target disebut juga dengan...", "a": "A. Core Factor (CF)", "b": "B. Perhitungan Gap.", "c": "C. Perbedaan Kompetisi", "d": "D. Normalisasi", "e": "E. AHP", "benar": "B"}, {"soal": "Metode pengambilan keputusan dengan cara perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus dipangkatkan dulu dengan bobot atribut yang bersangkutan disebut juga metode...", "a": "A. Weighted Product", "b": "B. Pengambilan Nilai Akhir", "c": "C. Matriks Pairwise Comparison", "d": "D. Perhitungan Gap", "e": "E. Fuzzy Mamdani", "benar": "A"}, {"soal": "Yang bukan beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making yaitu...", "a": "A. Atribut", "b": "B. Matriks Keputusan", "c": "C. Alternative", "d": "D. Topologi", "e": "E. Bobot Keputusan", "benar": "D"}, {"soal": "Yang bukan merupakan langkah dalam penyelesaian metode Simple Additive Weight (SAW) adalah...", "a": "A. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "b": "B. melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.", "c": "C. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci).", "e": "E. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif.", "benar": "E"}, {"soal": "Metode Simple Additive Weighthing (SAW) sering juga dikenal dengan istilah...", "a": "A. Metode penjumlahan terbobot", "b": "B. Metode pengurangan bervariabel", "c": "C. Metode penjumlahan terstruktur", "d": "D. Metode perkalian berfaktor", "e": "E. Metode pemfaktoran suatu variabel", "benar": "A"}, {"soal": "Yang bukan merupakan prinsip pokok AHP adalah...", "a": "A. Menyusun hirarki", "b": "B. Penjumlahan berbobot", "c": "C. Menghitung Consistency Ratio", "d": "D. Menentukan Prioritas", "e": "E. Pairwise Comparison", "benar": "B"}, {"soal": "MODM atau Multi Objective Decision Making biasa digunakan untuk...", "a": "A. Mencari titik tengah dari sebuah masalah", "b": "B. Menemukan suatu problem yang mendasar", "c": "C. Menyelesaikan permasalahan pada ruang kontinyu", "d": "D. Menggali solusi error dalam pemrograman", "e": "E. Sebagai penilaian/seleksi beberapa alternatif dalam jumlah terbatas", "benar": "C"}, {"soal": "Masalah yang terdiri atas unsur dan hubungan antara berbagai elemen yang semuanya dipahami oleh orang yang memecahkan masalah, disebut...", "a": "A. Deskriptif", "b": "B. Masalah terstruktur", "c": "C. Masalah semi terstruktur", "d": "D. Masalah tidak terstruktur", "e": "E. Semua benar", "benar": "B"}, {"soal": "Menurut Kusrini, pengertian profile matching adalah...", "a": "A. mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter.", "b": "B. mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati.", "c": "C. proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap.", "d": "D. penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut.", "e": "E. Penentuan urutan alternatif pada model Profile Matching berdasarkan tingkat profil alternatif yang paling mendekati profil ideal.", "benar": "B"}, {"soal": "Setiap aspek penilaian dikelompokkan menjadi dua, yaitu core factor dan secondary factor. Yang dimaksud dengan secondary factor adalah...", "a": "A. Hasil perbedaan kompetensi antara profil alternatif dan profil target.", "b": "B. kriteria penilaian yang paling penting di dalam proses pengambilan keputusan.", "c": "C. Penentuan urutan ranking alternatif yang direkomendasikan. ", "d": "D. Item-item selain aspek yang ada pada core factor atau bisa juga disebut sebagai faktor pendukung pada proses pengambilan keputusan.", "e": "E. Perhitungan ranking mempertimbangkan presentase prioritas tiap aspek penilaian", "benar": "D"}, {"soal": "Kriteria dalam penentuan kriteria yang dijadikan dasar dalam penentuan keputusan disimbolkan dengan ...", "a": "A. Ga", "b": "B. Ba", "c": "C. Ca", "d": "D. Ai", "e": "E. Ci", "benar": "E"}, {"soal": "Simple Additive Weighthing (SAW) merupakan metode yang digunakan untuk...", "a": "A. Mencari penjumlahan  terbobot dari rating kinerja pada setiap alternatif pada semua atribut", "b": "B. Membuat matriks keputusan berdasarkan kriteria (Ci).", "c": "C. Melakukan normalisasi matriks keputusan dengan cara menghitung nilai rating kinerja ternormalisasi.", "d": "D. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "e": "E. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "benar": "A"}, {"soal": "Menurut Kusmadewi, Multi Attribute Decision Making adalah...", "a": "A. Metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan.", "b": "B. Metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu.", "c": "C. Metode penentuan kriteria yang dijadikan dasar dalam penentuan keputusan, kriteria disimbolkan dengan Ci,  di mana i merupakan banyaknya kriteria yang ditentukan untuk dijadikan acuan dalam pengambilan  keputusan.", "d": "D. Metode untuk menentukan peringkat kecocokan untuk kriteria. ", "e": "E. Metode untuk melakukan pembagian  bobot setiap kriteria dengan jumlah keseluruhan bobot kriteria.", "benar": "B"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait disebut metode ...", "a": "A. AHP", "b": "B. SAW", "c": "C. NAC", "d": "D. Profile matching", "e": "E. MCDM", "benar": "A"}, {"soal": "Dalam metode AHP, setelah menyusun struktur hierarki langkah selanjutnya adalah ...", "a": "A. Menghitung CR", "b": "B. Melakukan perbandingan berpasangan", "c": "C. Mengidentifikasi masalah", "d": "D. Membuat matriks perbandingan berpasangan", "e": "E. Menghitung nilai vektor eigen untuk setiap matriks", "benar": "D"}, {"soal": "Yang merupakan contoh dari MODM adalah ...", "a": "A. Pemrograman matematis", "b": "B. Pemrograman berbasis objek", "c": "C. Pemrograman web", "d": "D. Pemrograman mobile", "e": "E. Pemrograman native", "benar": "A"}, {"soal": "Profile Matching adalah mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter. Berikut merupakan pengertian profile matchinng menurut...", "a": "A. Siahaan dan Tharo ", "b": "B. kusrini", "c": "C. Budi widodo", "d": "D. Mufid", "e": "", "benar": "A"}, {"soal": "kriteria penilaian yang paling penting di dalam proses pengambilan keputusan dalam profile matching di sebut...", "a": "A. Gap", "b": "B. Core Factor ", "c": "C. Secondary Factor", "d": "D. Bobot", "e": "", "benar": "B"}, {"soal": "Metode Simple Additive Weighthing (SAW) sering juga dikenal dengan istilah metode...", "a": "A. Perkalian terbobot", "b": "B. Pembobotan terstruktur", "c": "C. Penjumlahan terbobot", "d": "D. pembobotan terprioritas", "e": "", "benar": "C"}, {"soal": "Prinsip Pokok AHP ada 3, Berikut yang tidak termasuk Prinsip pokok AHP yaitu...", "a": "A. Menyusun hirarki", "b": "B. Menetukan prioritas", "c": "C. Menghitung consistency ratio", "d": "D. Menentukan core factor", "e": "", "benar": "D"}, {"soal": "Siapakah Seorang Guru Besar Matematika dari University of Pittsburgh yang pada tahun 1970 mengembangkan AHP?", "a": "A. Prof. Thomas L. Saaty", "b": "B. Siahaan dan Tharo ", "c": "C. kusrini", "d": "D. Mufid", "e": "", "benar": "A"}, {"soal": "metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan Merupakan pengertian dari metode...", "a": "A. Analitical heirarchy Process", "b": "B. weighted Product", "c": "C. Profile Matching", "d": "D. Simple Additive Weihting", "e": "", "benar": "B"}, {"soal": "TOPSIS dikembangkan oleh Hwang dan Yoon pada tahun...", "a": "A. 1971", "b": "B. 1976", "c": "C. 1981", "d": "D. 1986", "e": "", "benar": "C"}, {"soal": "Berikut ini yang bukan merupakan Proses Profile Matching yaitu...", "a": "A. mengihitung Gap", "b": "B. pembobotan", "c": "C. Menghitung core dan secondary factor", "d": "D. Membuat matriks keputusan ", "e": "", "benar": "D"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak terpanjang dari solusi ideal negatif, merupakan pengertian dari..", "a": "A. TOPSIS", "b": "B. AHP", "c": "C. WP", "d": "D. SAW", "e": "", "benar": "A"}, {"soal": "Berdasarkan tujuannya Multiple Criteria Decision Making (MCDM) dibagi menjadi..", "a": "A. 2", "b": "B. 3", "c": "C. 4", "d": "D. 5", "e": "", "benar": "A"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait merupakan pengertian dari metode..", "a": "A. AHP", "b": "B. TOPSIS", "c": "C. SAW", "d": "D. APRIORI ", "e": "", "benar": "A"}, {"soal": "Berikut langkah dalam penentuan keputusan menggunakan Profile Matching, kecuali...", "a": "A. Perhitungan Gap", "b": "B. Pembobotan", "c": "C. Identifikasi dan perhitungan CF dan SF", "d": "D. Perhitungan nilai rata-rata", "e": "", "benar": "D"}, {"soal": "Ada beberapa fitur umum yang digunakan dalam Multiple Criteria Decision Making, kecuali...", "a": "A. alternative", "b": "B. atribut", "c": "C. ranking", "d": "D. bobot keputusan", "e": "", "benar": "C"}, {"soal": "Metode pengambilan keputusan dengan cara perkalian untuk menghubungkan rating atribut disebut dengan...", "a": "A. Metode SAW", "b": "B. Metode WP", "c": "C. Multi Attribute Decision Making", "d": "D. Multiple Criteria Decision Making", "e": "", "benar": "B"}, {"soal": "Metode pengambilan keputusan yang sering dikernal dengan istilah penjumlahan terbobot disebut dengan...", "a": "A. Metode SAW", "b": "B. Metode WP", "c": "C. Multi Attribute Decision Making", "d": "D. Multiple Criteria Decision Making", "e": "", "benar": "A"}, {"soal": "Prosedur TOPSIS pada umumnya,  mengikuti langkah-langkah berikut, kecuali ...", "a": "A. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)", "b": "B. Membuat matrik keputusan ternormalisasi terbobot", "c": "C. Membuat matrik keputusan ternormalisasi (R) ", "d": "D. Membuat matriks keputusan berdasarkan kriteria", "e": "", "benar": "D"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target adalah pengertian dari ...", "a": "A. Pembobotan ", "b": "B. Perhitungan Profil Alternatif", "c": "C. Perhitungan Gap", "d": "D. Identifikasi dan Perhitungan nilai Core Factor (CF)", "e": "", "benar": "C"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan terdapat variabel prediktor merupakan pengertian dari...", "a": "A. Profile Matching", "b": "B. Metode WP", "c": "C. Multi Attribute Decision Making", "d": "D. Multiple Criteria Decision Making", "e": "", "benar": "A"}, {"soal": "Fitur umum dalam MADM secara urut yang paling benar yaitu..", "a": "A. alternative, konflik kriteria, metriks keputusan, bobot penilaian, atribut", "b": "B. atribut, decision, konflik kriteria, bobot keputusan, analisis keputusan ", "c": "C. alternative, atribut, konflik antar kriteria, bobot keputusan, matriks  keputusan", "d": "D. atribut, konflik antar kriteria, bobot keputusan, matriks  keputusan", "e": "", "benar": "C"}, {"soal": "Berikut langkah dalam penyelesaian metode SAW, yang tidak tepat yaitu ...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "c": "C. Menghitung nilai prefensi untuk alternatif sebagai vektor R", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci) ", "e": "", "benar": "D"}, {"soal": "Di bawah ini manakah yang bukan merupakan komponen-komponen dalam SPK?", "a": "A. Communication", "b": "B. Data Management", "c": "C. Knowledge Management", "d": "D. Model Management", "e": "E. Communication Management", "benar": "E"}, {"soal": "Subsistem optional yang dapat mendukung subsistem lain atau bertindak sebagai komponen yang berdiri sendiri, merupakan penjabaran dari salah satu komponen dari SPK yaitu?", "a": "A. Communication", "b": "B. Data Management", "c": "C. Knowledge Management", "d": "D. Model Management", "e": "E. Communication Management", "benar": "C"}, {"soal": "Umur, temperatur, tanggungan, pendapatan, pengeluaran, dsb merupakan contoh dari istilah dalam sistem fuzzy yaitu?", "a": "A. Semesta Pembicaraan", "b": "B. Himpunan Fuzzy", "c": "C. Variabel Fuzzy", "d": "D. Domain Fuzzy", "e": "E. Inferensi", "benar": "C"}, {"soal": "Di bawah ini merupakan metode dalam untuk menyelesaikan masalah Multi Atribute Decision Making (MADM), kecuali..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "D"}, {"soal": "Dekomposisi (Decomposition), Penilaian Komparasi (Comparative Judgment), dan Penentuan Prioritas (Synthesis of Priority), merupakan prinsip dasar dari metode..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "B"}, {"soal": "1)Dapat menemukan nilai bobot untuk masing-masing alternatif, \n2)Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan, \n3)Terdapat mekanisme normalisasi matrik keputusan (X). \n3 Hal tersebut merupakan kelebihan dari metode.. ", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "C"}, {"soal": "Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati. Merupakan pengertian dari metode?", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "E"}, {"soal": "1)Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)\n2)Membuat matrik keputusan ternormalisasi (R)\n3)Membuat matrik keputusan ternormalisasi terbobot\n4)Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif\n5)Menentukan jarak antara nilai setiap alternatif dengan matriks solusi ideal positif dan matrik solusi ideal negatif\n6)Menentukan nilai preferensi untuk setiap alternatif\nLangkah-langkah di atas merupakan prosedur untuk pengambilan keputusan dengan menggunakan metode..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "A"}, {"soal": "Proses pemilihan alternatif terbaik dari beberapa alternatif secara sistematis untuk ditindaklanjuti (digunakan) sebagai suatu cara pemecahan masalah merupakan pengertian dari :", "a": "A. Sistem Pendukung Keputusan", "b": "B. Sistem Fuzzy", "c": "C. Sistem analisis ", "d": "D. Sistem Desain", "e": "E. Sistem Basisdata", "benar": "A"}, {"soal": "Ada berapa karakteristik dari SPK menurut Turban(2005)?", "a": "A. 5", "b": "B. 6", "c": "C. 7", "d": "D. 8", "e": "E. 9", "benar": "C"}, {"soal": "Konsep mengenai DSS pertama kali dikemukakan pada tahun..", "a": "A. 1960-an", "b": "B. 1970-an", "c": "C. 1980-an", "d": "D. 1990-an", "e": "E. 1995-an", "benar": "A"}, {"soal": "Siapakah yang mengemukakan Multi Attribute Decision Making bahwa \"metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu\"?", "a": "A. Kusumadewi", "b": "B. Eliyen & Efendi ", "c": "C. Kusrini", "d": "D. Mufid", "e": "E. Siahaan dan Tharo ", "benar": "A"}, {"soal": "Metode apa yang sering dikenal dengan istilah penjumlahan berbobot ?", "a": "A. AHP", "b": "B. GAP", "c": "C. SAW", "d": "D. SPK", "e": "E. SLP", "benar": "C"}, {"soal": "Apa yang dimaksud dengan Weighted Product (WP) ?", "a": "A. Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu", "b": "B. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter", "c": "C. Aspek penilaian dikelompokkan menjadi dua", "d": "D. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif", "e": "E. Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "benar": "C"}, {"soal": "SPK Ditujukan untuk membantu keputusan-keputusan:", "a": "A. Terstruktur", "b": "B. Acak", "c": "C. Kurang Terstruktur", "d": "D. Membingungkan", "e": "E. Sulit", "benar": "C"}, {"soal": "Metode profile matching dapat membandingkan antara kompetensi yang dimiliki calon Pengajar dengan kompetensi standar jabatan sehingga diperoleh perbedaan kompetensinya, merupakan pengertian dari?", "a": "A. GAP", "b": "B. AHP", "c": "C. SAW", "d": "D. SLB", "e": "E. SPK", "benar": "A"}, {"soal": "TOPSIS dikembangkan oleh Hwang dan Yoon pada tahun ?", "a": "A. 1998", "b": "B. 1945", "c": "C. 1981", "d": "D. 1990", "e": "E. 2000", "benar": "C"}, {"soal": "Proses MADM dilakukan dengan tahapan, kecuali berikut ?", "a": "A. Analisis", "b": "B. Sintsis", "c": "C. Simbolis", "d": "D. Penyusunan komponen-komponen situasi ", "e": "E. Prediksi", "benar": "C"}, {"soal": "Apa yang dimaksud dengan ANALYTICAL HIERARCHY PROCESS (AHP) ?", "a": "A. Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "b": "B. Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu", "c": "C. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif", "d": "D. Metoda pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait", "e": "E. Aspek penilain dibagi menjadi dua", "benar": "D"}, {"soal": "Kelebihan dalam metode SAW, kecuali :", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Terdapat mekanisme normalisasi matrik keputusan (X), yaitu proses matrik keputusan(X) ke dalam skala yang dapat diperbandingkan dengan semua rating alternatif yang ada", "c": "C. Meningkatkan kecocokan untuk kriteria", "d": "D. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "e": "", "benar": "C"}, {"soal": "Apa yang dimaksud dengan profile matching menurut Kusrini?", "a": "a. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati", "b": "b. hasil perbedaan kompetensi antara profil alternatif dan profil target", "c": "c. proses pemberian nilai bobot pada nilai gap ", "d": "d. faktor pendukung pada proses pengambilan keputusan", "e": "", "benar": "A"}, {"soal": "Metode Weighted Product (WP) adalah", "a": "a. salah satu metode pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "b. satu metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "c": "c. satu metode pengambilan keputusan untuk menetapkan alternatif terburuk dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "d": "d. salah satu metode pengambilan keputusan untuk menambahkan masalah Multi Attribute Decision Making (MADM).", "e": "", "benar": "A"}, {"soal": "Langkah langkah penyelesaian masalah menggunakan metode Weighted Product, kecuali...", "a": "a. Penentuan kriteria yang dijadikan dasar dalam penentuan keputusan, kriteria disimbolkan dengan Ci,  di mana i merupakan banyaknya kriteria yang ditentukan untuk dijadikan acuan dalam pengambilan  keputusan", "b": "b. Menentukan peringkat kecocokan untuk kriteria. ", "c": "c. Denormalisasi bobot.", "d": "d. Menghitung nilai preferensi untuk alternatif sebagai vektor S", "e": "", "benar": "C"}, {"soal": "Kelebihan metode SAW adalah, kecuali...", "a": "a. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "b. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "c. Penilaian tidak tentu", "d": "d. Terdapat mekanisme normalisasi matrik keputusan (X), yaitu proses matrik keputusan (X) ke dalam skala yang dapat diperbandingkan dengan semua rating alternatif yang ada", "e": "", "benar": "C"}, {"soal": "Langkah langkah penyelesaian metode SAW, kecuali...", "a": "a. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "b": "b. Melakukan Denormalisasi matriks", "c": "c. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "d": "d. Membuat matriks keputusan berdasarkan kriteria (Ci).", "e": "", "benar": "B"}, {"soal": "AHP dikembangkan oleh...", "a": "a. Dr. Fransisca C.", "b": "b. Prof Thomas L.", "c": "c. Prof William A.", "d": "d. Bill Gates", "e": "", "benar": "B"}, {"soal": "Tahap proses MADM, kecuali...", "a": "a. Sintesis", "b": "b. Analisis", "c": "c. Penyusunan komponen-komponen sitasi", "d": "d. Pembuatan Matriks", "e": "", "benar": "D"}, {"soal": "Topsis Dikembangkan oleh...", "a": "a. Hwang dan Yoon", "b": "b. Hwang dan Jeung", "c": "c. Jeung dan Yoon", "d": "d. Han dan Yoon", "e": "", "benar": "A"}, {"soal": "Yang bukan termasuk prosedur TOPSIS ialah...", "a": "a. Membuat matriks yang ternormalisasi.", "b": "b. Membuat matriks keputusan yang ternormalisasi terbobot", "c": "c. Menentukan nilai bobot", "d": "d. Menentukan matriks solusi ideal positif dan negatif.", "e": "", "benar": "C"}, {"soal": "MADM digunakan untuk...", "a": "a. Penilaian/seleksi beberapa alternatif dalam jumlah terbatas", "b": "b. Penilaian/seleksi beberapa alternatif dalam jumlah yang tidak terbatas", "c": "c. Menyelesaikan permasalahan pada ruang kontinyu", "d": "d. Menyelesaikan permasalahan pada ruang diskrit", "e": "", "benar": "A"}, {"soal": "Yang bukan termasuk tahapan SPK dengan menggunakan profile matching adalah....", "a": "A. Pemilihan Nilai Rata-rata alternatif", "b": "B. Perhitungan Gap", "c": "C. Pembobotan", "d": "D. Perhitungan Nilai Core Factor dan Secondary Factor", "e": "", "benar": "A"}, {"soal": "Apa kepanjangan dari WP dalam konteks Sistem Pendukung Keputusan?", "a": "A. Word Press", "b": "B. Weighted Product", "c": "C. Weighting Product", "d": "D. Watt Pad", "e": "", "benar": "B"}, {"soal": "Perhitungan apa yang digunakan pada metode weighted product?", "a": "A. Perkalian untuk menghubungkan rating atribut", "b": "B. Pembagian untuk menghubungkan rating atribut", "c": "C. Pengurangan untuk menghubungkan rating atribut", "d": "D. Penjumlahan untuk menghubungkan rating atribut", "e": "", "benar": "D"}, {"soal": "Apa nama lain dari metode Simpe Additive Weighting", "a": "A. Metode Penarikan Keputusan", "b": "B. Metode Pemilihan alternatif", "c": "C. Metode Pemilihan alternatif terperinci", "d": "D. Metode penjumlahan terbobot", "e": "", "benar": "D"}, {"soal": "Berikut ini mana yang merupakan tahapan kedua dalam SAW", "a": "A. Menentukan kriteria-kriteria yang ada", "b": "B. Membuat matriks keputusan berdasarkan kriteria", "c": "C. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "d": "D. Melakukan normalisasi matriks", "e": "", "benar": "C"}, {"soal": "Siapa yang mengembangkan metode AHP?", "a": "A. Michael. Scott Morton", "b": "B. Prof. Thomas L. Saaty", "c": "C. Lotfi A. Zadeh", "d": "D. Waren McCulloch", "e": "", "benar": "B"}, {"soal": "Hasil penilaian dalam metode AHP dapat diterima jika mempunyai konsistensi lebih atau sama dengan ....", "a": "A. 10%", "b": "B. 20%", "c": "C. 30%", "d": "D. 40%", "e": "", "benar": "A"}, {"soal": "Keputusan yang diambil dalam TOPSIS merupakan yang memiliki....", "a": "A. Jarak terpendek dari solusi ideal positif", "b": "B. Jarak terpanjang dari solusi ideal negatif", "c": "C. Jarak terpanjang dari solusi ideal positif", "d": "D. Jarak terpendek dari solusi ideal positif dan jarak terpanjang dari solusi ideal negatif", "e": "", "benar": "D"}, {"soal": "Yang bukan merupakan metode untuk penyelesaian masalah MADM adalah....", "a": "A. Simple Additive Weighting", "b": "B. Fuzzy Mamdani", "c": "C. Weighted Product", "d": "D. Profile Matching", "e": "", "benar": "B"}, {"soal": "Pada tahun berapa TOPSIS mulai dikembangkan....", "a": "A. 1979", "b": "B. 1980", "c": "C. 1981", "d": "D. 1982", "e": "", "benar": "C"}, {"soal": "Kriteria penilaian yang paling penting dalam proses pengambilan keputusan dengan metode profile matching adalah ...", "a": "A. Tertiary Factor", "b": "B. Secondary Factor", "c": "C. Core Factor", "d": "D. X Factor", "e": "E. Common Factor", "benar": "C"}, {"soal": "Weighted Product merupakan salah satu metode pengambilan keputusan untuk menyelesaikan masalah ...", "a": "A. Multi Attribute Decision Making", "b": "B. Multi Objective Decision Making", "c": "C. Multivariate Data Mining", "d": "D. Univariate Data Mining", "e": "E. Time Series Data Mining", "benar": "A"}, {"soal": "Kriteria ke-i pada metode Weighted Product disimbolkan dengan ...", "a": "A. Ki", "b": "B. Vi", "c": "C. Si", "d": "D. Ci", "e": "E. Xi", "benar": "D"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait adalah ...", "a": "A. KNN", "b": "B. KMeans", "c": "C. WP", "d": "D. SAW", "e": "E. AHP", "benar": "E"}, {"soal": "Menurut Saaty, hasil penilaian yang dapat diterima adalah yang mempunyai rasio konsistensi lebih kecil atau sama dengan ...", "a": "A. 10%", "b": "B. 20%", "c": "C. 25%", "d": "D. 30%", "e": "E. 40%", "benar": "A"}, {"soal": "Metode TOPSIS didasarkan pada prinsip dimana alternatif terpilih memiliki ...", "a": "A. jarak terpanjang dari solusi ideal positif dan negatif", "b": "B. jarak terpendek dari solusi ideal positif dan negatif", "c": "C. jarak terpanjang dari solusi ideal positif dan jarak terpendek dari solusi ideal negatif", "d": "D. jarak terpendek dari solusi ideal positif dan jarak terpanjang dari solusi ideal negatif", "e": "E. semua salah", "benar": "D"}, {"soal": "Langkah terakhir dari prosedur TOPSIS adalah menentukan nilai preferensi Vi untuk tiap alternatif Ai dengan ketentuan ...", "a": "A. nilai preferensi Vi yang paling besar menunjukkan alternatif Ai yang tidak terpilih", "b": "B. nilai preferensi Vi yang lebih kecil menunjukkan alternatif Ai lebih dipilih", "c": "C. nilai preferensi Vi yang lebih besar menunjukkan alternatif Ai lebih dipilih", "d": "D. nilai preferensi Vi yang paling kecil menunjukkan alternatif Ai yang menjadi pilihan mutlak", "e": "E. semua salah", "benar": "C"}, {"soal": "Metode AHP dikembangkan oleh ...", "a": "A. Fishburn", "b": "B. Ching-Lai Hwang", "c": "C. Thomas L. Saaty", "d": "D. Carl Einar Hille", "e": "E. Alan Turing", "benar": "C"}, {"soal": "Langkah pertama yang dilakukan dalam penyelesaian masalah menggunakan metode Weighted Product adalah ..", "a": "A. menentukan peringkat kecocokan untuk kriteria", "b": "B. menentukan kriteria yang dijadikan dasar dalam penentuan keputusan", "c": "C. menghitung nilai preferensi untuk alternatif", "d": "D. normalisasi bobot", "e": "E. menghitung nilai preferensi relatif", "benar": "B"}, {"soal": "Pada metode profile matching, kriteria dibagi berdasarkan tingkat kepentingannya menjadi ... bagian", "a": "A. 1 ", "b": "B. 2", "c": "C. 3", "d": "D. 4", "e": "E. 5", "benar": "B"}, {"soal": "SPK ditujukan untuk membantu keputusan-keputusan yang...", "a": "a. Terstruktur", "b": "b. Acak", "c": "c. Kurang terstruktur", "d": "d. Membingungkan", "e": "e. Sulit", "benar": "C"}, {"soal": "Konsep mengenai DSS pertama kali ditemukan awal tahun 1970-an oleh...", "a": "a. Michael S. Scott", "b": "b. Sommerville", "c": "c. Simon", "d": "d. Roger Pressman", "e": "e. Bodily", "benar": "A"}, {"soal": "Profile Matching adalah mekanisme pengambilan keputusan untuk...", "a": "a. Menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "b. Mengasumsikan bahwa terdapat tingkat variabel prediktor ideal harus dipenuhi oleh parameter.", "c": "c. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut.", "d": "d. pengambilan keputusan dengan pendekatan pembobotan yang sederhana.", "e": "e. Menilai tindakan yang dikaitkan dengan perbandingan bobot kepentingan antara faktor serta perbandingan beberapa alternatif pilihan", "benar": "B"}, {"soal": "Metode Weight Product (WP) adalah mekanisme pengambilan keputusan untuk...", "a": "a. Menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "b. Mengasumsikan bahwa terdapat tingkat variabel prediktor ideal harus dipenuhi oleh parameter.", "c": "c. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut.", "d": "d. pengambilan keputusan dengan pendekatan pembobotan yang sederhana.", "e": "e. Menilai tindakan yang dikaitkan dengan perbandingan bobot kepentingan antara faktor serta perbandingan beberapa alternatif pilihan", "benar": "A"}, {"soal": "Metode Simple Additive Weighthing (SAW) adalah mekanisme pengambilan keputusan untuk...", "a": "a. Menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "b. Mengasumsikan bahwa terdapat tingkat variabel prediktor ideal harus dipenuhi oleh parameter.", "c": "c. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut.", "d": "d. pengambilan keputusan dengan pendekatan pembobotan yang sederhana .", "e": "e. Menilai tindakan yang dikaitkan dengan perbandingan bobot kepentingan antara faktor serta perbandingan beberapa alternatif pilihan", "benar": "C"}, {"soal": "Metode Analytical Hierarchy Process (AHP) adalah mekanisme pengambilan keputusan untuk...", "a": "a. Menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "b. Mengasumsikan bahwa terdapat tingkat variabel prediktor ideal harus dipenuhi oleh parameter.", "c": "c. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut.", "d": "d. pengambilan keputusan dengan pendekatan pembobotan yang sederhana.", "e": "e. Menilai tindakan yang dikaitkan dengan perbandingan bobot kepentingan antara faktor serta perbandingan beberapa alternatif pilihan", "benar": "E"}, {"soal": "Metode TOPSIS adalah mekanisme pengambilan keputusan untuk...", "a": "a. Menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "b. Mengasumsikan bahwa terdapat tingkat variabel prediktor ideal harus dipenuhi oleh parameter.", "c": "c. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut.", "d": "d. pengambilan keputusan dengan pendekatan pembobotan yang sederhana.", "e": "e. Menilai tindakan yang dikaitkan dengan perbandingan bobot kepentingan antara faktor serta perbandingan beberapa alternatif pilihan", "benar": "D"}, {"soal": "Berikut adalah mekanisme pengambilan keputusan kecuali...", "a": "a. Profile Matching", "b": "b. AHP", "c": "c. Profile Making", "d": "d. SAW", "e": "e. WP", "benar": "C"}, {"soal": "Langkah awal pada metode Weighted Product adalah...", "a": "a. Menentukan nilai skala", "b": "b. Mengubah nilai kriteria alternatif", "c": "c. Menentukan kriteria dan nilai bobot kriteria", "d": "d. Membuat matriks keputusan", "e": "e. Menghitung normalisasi bobot", "benar": "C"}, {"soal": "Langkah terakhir pada metode Profile Matching adalah...", "a": "a. Penentuan ranking alternatif", "b": "b. Perhitungan nilai total", "c": "c. Identifikasi dan perhitungan nilau Core Factor (CF) & Secondary Factor (SF)", "d": "d. Pembobotan nilai gap", "e": "e. perhitungan gap", "benar": "A"}, {"soal": "Ada beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making, antara lain dibawah ini, kecuali...", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Konflik antar kriteria", "d": "D. Bobot", "e": "E. Matriks Keputusan", "benar": "D"}, {"soal": "Metode Weighted Prduct (WP) Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  .... dengan bobot atribut yang bersangkutan.", "a": "A. Dipangkatkan", "b": "B. Dikalikan", "c": "C. Ditambahkan", "d": "D. Dikurangkan", "e": "E. Dibagikan", "benar": "A"}, {"soal": "istilah metode  penjumlahan terbobot adalah istilah dari...", "a": "A. WP", "b": "B. SAW", "c": "C. TOPSIS", "d": "D. FUZZY", "e": "E. AHP", "benar": "B"}, {"soal": "Tahapan - tahapan profil matching :\n1. Perhitungan Gap\n2. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF)\n3. Perhitungan nilai total\n4. Pembobotan\n5. Penentuan rangking alternatif\nUrutan yang benar adalah..", "a": "A. 1-2-3-4-5", "b": "B. 1-3-2-4-5", "c": "C. 1-4-2-3-5", "d": "D. 1-4-2-5-3", "e": "E. 1-4-5-3-2", "benar": "C"}, {"soal": "N = (x)%NCF + (x)%NSF\nrumus diatas adalah rumus proses SPK dengan metode profile matching pada tahap...", "a": "A. Perhitungann Gap", "b": "B. Penentuan rangking alternatif", "c": "C. Pembobotan", "d": "D. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF)", "e": "E. Perhitungan nilai total", "benar": "E"}, {"soal": "Pengertian TOPSIS adalah ...", "a": "A. prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak terpanjang dari solusi ideal negatif", "b": "B. mencari penjumlahan  terbobot dari rating kinerja pada setiap alternatif pada semua atribut ", "c": "C. metode dalam pembuatan dan pengambilan keputusan untuk masalah yang kompleks, tidak terstruktur dan multiatribut dengan cara memeringkat alternatif keputusan yang ada kemudian memilih yang terbaik dengan kriteria yang ditentukan melalui suatu nilai numerik.", "d": "D. proses normalisasi matriks keputusan (X) ke suatu skala yang dapat diperbandingkan dengan semua rating alternatif yang ada", "e": "E. proses penggabungan banyak aturan berdasarkan data yang tersedia", "benar": "A"}, {"soal": "pengambilan keputusan yang digunakan untuk penilaian / seleksi beberapa alternatif dalam jumlah terbatas yaitu", "a": "A. MODM", "b": "B. MADM", "c": "C. SAW", "d": "D. TOPSIS", "e": "E. AHP", "benar": "B"}, {"soal": "Kepanjangan dari singkatan MODM adalah...", "a": "A. Multi Objective Decision Making", "b": "B. Multi One Decision Making", "c": "C. Multi Oriented Decision Making", "d": "D. Multi Order Decision Making", "e": "E. Multi Object Decision Making", "benar": "A"}, {"soal": "Tahapan MADM yang benar adalah...", "a": "A. Situasi, Analisis, Implementasi", "b": "B. Penyusunan komponen, Analisis, Implementasi", "c": "C. Penyusunan komponen-komponen situasi,Analisis, Sintesis", "d": "D. Situasi, Analisis, Intregasi", "e": "E. Penyususan Komponen, Situasi, Integrasi", "benar": "C"}, {"soal": "Berikut adalah metode penyelesaian MADM, kecuali", "a": "A. TOPSIS", "b": "B. AHP", "c": "C. SAW", "d": "D. WP", "e": "E. FUZZY", "benar": "E"}, {"soal": "Menurut Khairul dan Suherman 2018 di dalam Hamka dan Harjono 2019, yang merupakan masukan untuk proses pembobotan adalah ...", "a": "A. Nilai gap semua alternatif terhadap masing-masing data", "b": "B. Nilai gap beberapa alternatif beberapa profil ideal", "c": "C. Nilai gap semua alternatif terhadap masing-masing profil ideal", "d": "D. Nilai gap beberapa data terhadap masing-masing profil ideal", "e": "E. Nilai gap semua alternatif terhadap semua profil tidak ideal", "benar": "C"}, {"soal": "Berikut ini beberapa fitur umum yang digunakan dalam Multiple Criteria Desicion Making, kecuali ...", "a": "A. Bobot keputusan", "b": "B. Simbol", "c": "C. Atribut", "d": "D. Alternative", "e": "E. Konflik antar kriteria", "benar": "B"}, {"soal": "Kriteria dalam penentuan kriteria yang dijadikan dasar dalam penentuan keputusan disimbolkan dengan ...", "a": "A. Ai", "b": "B. Ci", "c": "C. Ga", "d": "D. Ba", "e": "E. Ca", "benar": "B"}, {"soal": "W sebagai bobot normalisasi tiap kriteria akan bernilai positif apabila w merupakan atribut ...", "a": "A. Keuntungan", "b": "B. Kerugian", "c": "C. Biaya", "d": "D. Harga", "e": "E. Bobot", "benar": "A"}, {"soal": "Metode Simple Additive Weighthing (SAW) sering juga dikenal dengan istilah ...", "a": "A. Metode pengurangan terbobot", "b": "B. Metode pengkalian terbobot", "c": "C. Metode penjumlahan terbobot", "d": "D. Metode pembagian terbobot", "e": "E. Metode penalaran terbobot", "benar": "C"}, {"soal": "Berikut ini yang merupakan kelebihan dari metode SAW adalah ...", "a": "A. Proses cepat", "b": "B. Penilaian akan lebih tepat, karena berdasarkan pada nilai penalaran", "c": "C. Tidak menghabiskan sumber daya", "d": "D. Tidak terdapat mekanisme normalisasi matrik keputusan (X)", "e": "E. Dapat menemukan nilai bobot untuk masing-masing alternatif", "benar": "E"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait disebut metode ...", "a": "A. AHP", "b": "B. SAW", "c": "C. NAC", "d": "D. Profile matching", "e": "E. MCDM", "benar": "A"}, {"soal": "Dalam metode AHP, setelah menyusun struktur hierarki langkah selanjutnya adalah ...", "a": "A. Menghitung CR", "b": "B. Melakukan perbandingan berpasangan", "c": "C. Mengidentifikasi masalah", "d": "D. Membuat matriks perbandingan berpasangan", "e": "E. Menghitung nilai vektor eigen untuk setiap matriks", "benar": "D"}, {"soal": "Berdasarkan tujuannya, MCDM dibagi menjadi ...", "a": "A. 1", "b": "B. 2", "c": "C. 3", "d": "D. 4", "e": "E. 5", "benar": "B"}, {"soal": "Yang merupakan contoh dari MODM adalah ...", "a": "A. Pemrograman matematis", "b": "B. Pemrograman berbasis objek", "c": "C. Pemrograman web", "d": "D. Pemrograman mobile", "e": "E. Pemrograman native", "benar": "A"}, {"soal": "Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati, merupakan definisi metode ...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. Gap", "d": "d. Profile Matching", "e": "e. AHP", "benar": "D"}, {"soal": "Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM) merupakan metode ...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. Gap", "d": "d. Profile Matching", "e": "e. AHP", "benar": "B"}, {"soal": "Mencari penjumlahan  terbobot dari rating kinerja pada setiap alternatif pada semua atribut, merupakan konsep dasar dari...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. Gap", "d": "d. Profile Matching", "e": "e. AHP", "benar": "A"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak terpanjang dari solusi ideal negatif, merupakan pengertian metode...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. Gap", "d": "d. Profile Matching", "e": "e. TOPSIS", "benar": "E"}, {"soal": "Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu, merupakan pengertian metode...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. MCDM", "d": "d. MADM", "e": "e. TOPSIS", "benar": "C"}, {"soal": "Metode dengan mengambil banyak kriteria sebagai dasar pengambilan keputusan, dengan penilaian yang subjektif menyangkut masalah pemilihan, merupakan metode...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. MCDM", "d": "d. MADM", "e": "e. TOPSIS", "benar": "D"}, {"soal": "Berikut merupakan metode untuk menyelesaikan masalah MADM, kecuali...", "a": "a. SAW ", "b": "b. Weighted Product", "c": "c. FCM", "d": "d. Profile Matching", "e": "e. TOPSIS", "benar": "C"}, {"soal": "Berikut merupakan beberapa fitur dalam MCDM, kecuali...", "a": "a. Alternatif", "b": "b. Bobot Keputusan", "c": "c. Atribut", "d": "d. Konflik antar kriteria", "e": "e. Akurasi", "benar": "E"}, {"soal": "Kriteria penilaian yang paling penting di dalam proses pengambilan keputusan adalah definisi dari...", "a": "a. Gap", "b": "b. CF", "c": "c. SF", "d": "d. IS", "e": "e. IC", "benar": "B"}, {"soal": "Item-item selain aspek yang ada pada core factor atau bisa juga disebut sebagai faktor pendukung pada proses pengambilan keputusan, merupakan pengertian...", "a": "a. Gap", "b": "b. CF", "c": "c. SF", "d": "d. IS", "e": "e. IC", "benar": "C"}, {"soal": "Profile Matching menurut Kusrini adalah", "a": "A. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati ", "b": "B. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter", "c": "C. Proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap", "d": "D. Penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut ", "e": "E. Hasil perbedaan kompetensi antara profil alternatif dan profil target ", "benar": "A"}, {"soal": "Rumus Gap adalah", "a": "A. Nilai Profil Alternatif + Nilai Profil Target", "b": "B. Nilai Profil Alternatif - Nilai Profil Target", "c": "C. Nilai Profil Alternatif x Nilai Profil Target", "d": "D. Nilai Profil Alternatif / Nilai Profil Target", "e": "E. (Nilai Profil Alternatif - Nilai Profil Target)^2", "benar": "B"}, {"soal": "Metode Weighted Product merupakan salah satu metode pengambilan keputusan untuk menyelesaikan", "a": "A. MDAM", "b": "B. ADMM", "c": "C. MADM", "d": "D. DAMM", "e": "E. MCDM", "benar": "C"}, {"soal": "Fitur umum yang digunakan dalam Multiple Criteria Decision Making adalah", "a": "A. Atribut, Konflik, dan Pilihan", "b": "B. Alternatif, Atribut, dan Variasi", "c": "C. Bobot Keputusan, Matriks Keputusan, dan Variasi", "d": "D. Alternatif, Bobot Keputusan, dan Matriks Keputusan", "e": "E. Pilihan, Bobot Keputusan, dan Atribut", "benar": "D"}, {"soal": "Metode Simple Additive Weighthing juga dikenal dengan metode ", "a": "A. Penjumlahan teratur", "b": "B. Penjumlahan terstruktur", "c": "C. Pengali terbobot", "d": "D. Pengali terstruktur", "e": "E. Penjumlahan terbobot", "benar": "E"}, {"soal": "Kelebihan metode SAW adalah", "a": "A. Dapat menemukan nilai bobot masing - masing alternatif", "b": "B. Penilaian sedikit samar", "c": "C. Tidak ada mekanisme normalisasi matriks keputusan", "d": "D. Dapat menjumlah semua nilai bobot", "e": "E. Proses lebih teratur", "benar": "A"}, {"soal": "Yang bukan termasuk langkah dalam penyelesaian metode SAW adalah kecuali", "a": "A. Membuat invers nilai", "b": "B. Membuat matriks keputusan berdasarkan kriteria ", "c": "C. Menemukan atribut setiap nilai", "d": "D. Hasil akhir diperoleh setelah penjumlahan", "e": "E. Menentukan rating matriks", "benar": "B"}, {"soal": "Alternatif terbaik didapat apabila mendapatkan hasil perhitungan nilai Vi yang", "a": "A. Lebih kecil", "b": "B. Sama", "c": "C. Lebih besar", "d": "D. Tidak ada ", "e": "E. Akar dari nilai Vi", "benar": "C"}, {"soal": "Keputusan menurut Ralph C. Davis adalah", "a": "A. Suatu atau sebagai hukum situasi", "b": "B. Pemilihan di antara alternatif-alternatif", "c": "C. Suatu pengakhiran daripada proses pemikiran tentang suatu masalah atau problema untuk menjawab pertanyaan apa yang harus diperbuat guna mengatasi masalah tersebut, dengan menjatuhkan pilihan pada suatu alternatif", "d": "D. Hasil pemecahan masalah yang dihadapinya dengan tegas", "e": "E. Salah semua", "benar": "D"}, {"soal": "Definisi pengambilan keputusan menurut S.P. Siagian adalah", "a": "A. Suatu pengakhiran daripada proses pemikiran tentang suatu masalah atau problema untuk menjawab pertanyaan apa yang harus diperbuat guna mengatasi masalah tersebut, dengan menjatuhkan pilihan pada suatu alternatif", "b": "B. Ada pilihan atas dasar logika atau pertimbangan", "c": "C. Suatu pendekatan yang sistematis terhadap hakikat alternatif yang dihadapi dan mengambil tindakan yang menurut perhitungan merupakan tindakan yang paling tepat", "d": "D. Proses yang digunakan untuk memilih suatu tindakan sebagai cara pemecahan masalah", "e": "E. Pemilihan alternatif perilaku(kelakuan) tertentu dari dua atau lebih alternatif yang ada", "benar": "E"}, {"soal": "Memandang SPK mrpkn kemajuan secara revolusioner dari SIM dan PDE (Pengolahan Data Elektronik):", "a": "a. Sudut Pandang Teoritikal", "b": "b. Sudut Pandang Konotasional", "c": "c. Sudut Pandang Dialog", "d": "d. Sudut Pandang Sistem", "e": "e. Sudut Pandang Input", "benar": "B"}, {"soal": "SPK bukan hanya sekedar pengembangan evolusioner dari SIM & PDE, namun juga merupakan kelas sistem informasi yang berinteraksi dengan bagian-bagian lain yang memiliki karakteristik diantaranya sbb, kecuali:", "a": "a. Memiliki subsistem yg terintegrasi", "b": "b. Membutuhkan struktur data yg komprehensif", "c": "c. Pendekatan easy to use.", "d": "d. Menekankan pada fleksibilitas.", "e": "", "benar": "D"}, {"soal": "Subsistem Manajemen Basis Data memiliki kemampuan sbb, kecuali:", "a": "a. Mengkombinasikan berbagai variasi data", "b": "b. Menambahkan sumber data secara cepat", "c": "c. Menciptakan model-model baru secara cepat dan mudah", "d": "d. Menggambarkan struktur data logikal sesuai pengertian pemakai", "e": "", "benar": "C"}, {"soal": "Bennet mendefinisikan komponen dari subsistem perangkat lunak dialog kecuali ?", "a": "a. User", "b": "b. Terminal", "c": "c. Pemakai", "d": "d. Perangkat Keras", "e": "", "benar": "D"}, {"soal": "Meliputi apa yang dapat digunakan oleh pemakai dalam berkomunikasi dengan sistem adalah:", "a": "a. User Interface", "b": "b. Bahasa Tampilan", "c": "c. Basis Pengetahuan", "d": "d. Bahasa Aksi", "e": "", "benar": "D"}, {"soal": "Profile matching adalah sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati, merupakan pengertian profile matching dari...", "a": "A. Siahaan", "b": "B. Tharo", "c": "C. Kusrini", "d": "D. Mufid", "e": "", "benar": "C"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target disebut juga dengan...", "a": "A. Gap", "b": "B. Pembobotan", "c": "C. Core Factor", "d": "D. Secondary Factor", "e": "", "benar": "A"}, {"soal": "Berikut adalah beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making,  yaitu ...", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Bobot keputusan", "d": "D. Semua jawaban benar", "e": "", "benar": "D"}, {"soal": "Metode Weighted Product (WP) Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan, merupakan pengertian weighted product dari...", "a": "A. Siahaan dan Tharo", "b": "B. Kusrini", "c": "C. Mufid", "d": "D. Kusumadewi", "e": "", "benar": "D"}, {"soal": "Berikut merupakan kelebihan dari metode SAW, kecuali...", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "C. Terdapat mekanisme normalisasi matrik keputusan (X), yaitu proses matrik keputusan (X) ke dalam skala yang dapat diperbandingkan dengan semua rating alternatif yang ada", "d": "D. Penilaian kurang akurat", "e": "", "benar": "D"}, {"soal": "Langkah pertama dalam penyelesaian metode Simple Additive Weight (SAW) adalah...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "c": "C. Membuat matriks keputusan berdasarkan kriteria (Ci).", "d": "D. Kemudian melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.", "e": "", "benar": "A"}, {"soal": "AHP dikembangkan oleh...", "a": "A. Kusrini", "b": "B. Prof. Thomas L. Saaty", "c": "C. Kusumadewi", "d": "D. Mufid", "e": "", "benar": "B"}, {"soal": "Metoda pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait, disebut juga dengan metode", "a": "A. WP", "b": "B. SAW", "c": "C. AHP", "d": "D. Profile Matching ", "e": "", "benar": "C"}, {"soal": "Secara umum, langkah pertama dalam prosedur TOPSIS yaitu...", "a": "A. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)", "b": "B. Membuat matrik keputusan ternormalisasi (R)", "c": "C. Membuat matrik keputusan ternormalisasi terbobot", "d": "D. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "e": "", "benar": "A"}, {"soal": "Metode untuk penyelesaian masalah MADM, antara lain", "a": "A. TOPSIS", "b": "B. WP", "c": "C. SAW", "d": "D. Semua jawaban benar", "e": "", "benar": "D"}, {"soal": "\"Profile mathcing adalah sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati\", adalah pengertian profile matching oleh ...", "a": "A. Tharo 2016", "b": "B. Kusrini 2007", "c": "C. Mufid 2014", "d": "D. Siahaan 2016", "e": "E. KBBI", "benar": "B"}, {"soal": "Urutan tahapan dalam penentuan keputusan menggunakan profile matching adalah ...", "a": "A. Pembobotan - Perhitungan Gap - Identifikasi dan Perhitungan Nilai CF dan SF - Perhitungan Nilai Total - Penentuan Ranking Alternatif", "b": "B. Perhitungan Gap - Pembobotan - Perhitungan Nilai Total - Identifikasi dan Perhitungan Nilai CF dan SF - Penentuan Ranking Alternatif", "c": "C. Pembobotan - Penentuan Ranking Alternatif - Perhitungan Gap - Perhitungan Nilai Total - Identifikasi dan Perhitungan Nilai CF dan SF", "d": "D. Perhitungan Gap - Pembobotan - Identifikasi dan Perhitungan Nilai CF dan SF - Perhitungan Nilai Total - Penentuan Ranking Alternatif", "e": "E. Penentuan Ranking Alternatif - Perhitungan Nilai Total - Identifikasi dan Perhitungan Nilai CF dan SF - Pembobotan - Perhitungan Gap", "benar": "D"}, {"soal": "Yang BUKAN merupakan fitur umum yang akan digunakan dalam Multiple Criteria Decision Making adalah ...", "a": "A. Kriteria Keputusan", "b": "B. Atribut", "c": "C. Alternative", "d": "D. Matriks Keputusan", "e": "E. Bobot Keputusan", "benar": "A"}, {"soal": "Langkah-langkah penyelesaian masalah menggunakan Weighted Product adalah sebagai berikut, kecuali ...", "a": "A. Menentukan peringkat kecocokan untuk kriteria", "b": "B. Membuat peringkat nilai vektor", "c": "C. Normalisasi bobot", "d": "D. Menghitung nilai preferensi untuk alternatif sebagai vektor S", "e": "E. Menghitung nilai preferensi untuk alternatif sebagai vektor F", "benar": "E"}, {"soal": "\"Metode Simple Additive Weighting (SAW) sering juga dikenal dengan istilah metode penjumlahan terbobot\" adalah ucapan salah satu ahli, yaitu ...", "a": "A. MacCrimmon 1968", "b": "B. Kusumadewi 2006", "c": "C. Limbing 2020", "d": "D. Frieyadie 2016", "e": "E. Mufid 2016", "benar": "B"}, {"soal": "Urutan langkah-langkah penyelesaian metode SAW adalah sebagai berikut ...", "a": "A. Membuat matriks keputusan - Melakukan normalisasi matriks - Menentukan kriteria yang dijadikan acuan - Menentukan rating kecocokan setiap alternatif - Melakukan perangkingan", "b": "B. Menentukan kriteria yang dijadikan acuan - Membuat matriks keputusan - Menentukan rating kecocokan setiap alternatif - Melakukan normalisasi matriks - Melakukan perangkingan", "c": "C. Menentukan kriteria yang dijadikan acuan - Menentukan rating kecocokan setiap alternatif - Membuat matriks keputusan - Melakukan normalisasi matriks - Melakukan perangkingan", "d": "D. Menentukan rating kecocokan setiap alternatif - Membuat matriks keputusan - Melakukan normalisasi matriks - Menentukan kriteria yang dijadikan acuan - Melakukan perangkingan", "e": "E. Menentukan rating kecocokan setiap alternatif - Melakukan normalisasi matriks - Membuat matriks keputusan - Melakukan perangkingan - Menentukan kriteria yang dijadikan acuan", "benar": "C"}, {"soal": "Berdasarkan tujuannya, Multiple Criteria Decision Making dibagi menjadi ...", "a": "A. 2", "b": "B. 3", "c": "C. 4", "d": "D. 5", "e": "E. 6", "benar": "A"}, {"soal": "Proses MADM dilakukan dalam ... tahap", "a": "A. 6", "b": "B. 4", "c": "C. 5", "d": "D. 2", "e": "E. 3", "benar": "E"}, {"soal": "TOPSIS dikembangkan pasa tahun ...", "a": "A. 1980", "b": "B. 1981", "c": "C. 1982", "d": "D. 1983", "e": "E. 1984", "benar": "B"}, {"soal": "\"TOPSIS didasarkan pada konsep dimana alternatif terpilih yang terbaik tidak hanya memiliki jarak terpendek dari solusi ideal positif (A+), namun juga memiliki jarak terpanjang dari solusi ideal negatif (A-)\", adalah ujar salah satu ahli, yaitu ...", "a": "A. Kahraman 2008", "b": "B. Mufid 2016", "c": "C. Limbing 2020", "d": "D. Kusumadewi 2006", "e": "E. MacCrimmon 1968", "benar": "D"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhin oleh parameter adalah pengertian profile matching menurut...", "a": "A. Siahaan", "b": "B. Taro", "c": "C. Kusrini", "d": "D. Mufid dan Siahaan", "e": "E. Siahaan dan Taro", "benar": "E"}, {"soal": "Berikut merupakan tahapan dalam penentuan keputusan menggunakan profile matching yang benar, yaitu...", "a": "A.Perhitungan gap, pembobotan, identifikasi dan penilaian Core Factor dan Secondary Factor, perhitungan nilai total, penentuan ranking alternatif", "b": "B. Perhitungan gap, pembobotan, perhitungan nilai total, identifikasi dan penilaian Core Factor dan Secondary Factor, penentuan ranking alternatif", "c": "C. Perhitungan gap,  perhitungan nilai total, identifikasi dan penilaian Core Factor dan Secondary Factor, pembobotan, penentuan ranking alternatif", "d": "D. Pembobotan, perhitungan nilai total, identifikasi dan penilaian Core Factor dan Secondary Factor, perhitungan gap, penentuan ranking alternatif", "e": "E. Pembobotan, perhitungan gap, identifikasi dan penilaian Core Factor dan Secondary Factor, perhitungan nilai total, penentuan ranking alternatif", "benar": "A"}, {"soal": "Fitur umum yang digunakan pada Multiple Criteria Decission Making, kecuali...", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Konflik antar keputusan", "d": "D. Bobot keputusan", "e": "E. Matriks keputusan", "benar": "C"}, {"soal": "Yang tidak termasuk langkah penyelesaian masalah menggunakan metode Weighted Product adalah...", "a": "A. Penentuan kriteria yang dijadikan dasar dalam penentuan keputusan", "b": "B. Pembobotan", "c": "C. Menentukan peringkat kecocokan untuk kriteria", "d": "D. Normalisasi bobot", "e": "E. Menghitung nilai preferensio untuk alternatif sebagai vektor 5", "benar": "B"}, {"soal": "Salah satu kelebihan metode SAW adalah...", "a": "A. Mudah", "b": "B. Sangat mendetail sehingga sulit menentukan nilai bobot", "c": "C. Penilaian kurang akurat", "d": "D. Terdapat mekanisme normalisasi matrik", "e": "E. Tidak berdasarkan pada nilai kriteria dan bobot preferensi", "benar": "D"}, {"soal": "Berikut ini metode atau mekanisme pengambilan keputusan, kecuali...", "a": "A. Profile Matching", "b": "B. Simple Additive Weighting (SAW)", "c": "C. Analytical Hierarchy Process (AHP)", "d": "D. Technique for Order Preference by Similarity (TOPSIS)", "e": "E. Weighted Process (WP)", "benar": "E"}, {"soal": "Yang bukan keunggulan dari metode TOPSIS adalah...", "a": "A. Komputasinya efisien", "b": "B. Sederhana dan mudah dipahami", "c": "C. Memiliki kemampuan untuk mengukur kinerja relatif dari alternatif-alternatif keputusan", "d": "D. Sulit diterapkan dalam berbagai bidang", "e": "E. Semua salah", "benar": "D"}, {"soal": "Berdasarkan tujuannya, MCDM terbagi menjadi 2, salah satunya..", "a": "A. Multi Atribute Decision Making (MADM)", "b": "B. Multi Alternative Decision Making (MADM)", "c": "C. Multi Attractive Decision Making (MADM)", "d": "D. Multi Obstacle Decision Making (MODM)", "e": "E. Multi Obvious Decision Making (MODM)", "benar": "A"}, {"soal": "Berikut ini merupakan tahapan dalam prosedur TOPSIS, kecuali...", "a": "A. Membuat matriks keputusan", "b": "B. Membuat matriks keputusan ternormalisasi", "c": "C. Normalisasi bobot", "d": "D. Menentukan jarak antara nilai setiap alternatif dengan matriks solusi ideal positif dan matriks solusi ideal negatif", "e": "E. Menentukan nilai preferensi untuk setiap alternatif", "benar": "C"}, {"soal": "Brkut ini yang merupakan implementasi TOPSIS adalah", "a": "A. Pemilihan pegawai terbaik", "b": "B. Pemlihan kontraktor banguunan yang tept", "c": "C. Penentuan penerima bbeasiswa", "d": "D. Penentuan kota sebagai smart city", "e": "E. Semuua benar", "benar": "E"}, {"soal": "Berikut adalah proses Sistem Pendukung Keputusan dengan Metode Profile Matching, kecuali...", "a": "A. Perhitungan nilai total", "b": "B. Penentuan rangking alternatif", "c": "C. Menentukan peringkat kecocokan untuk kriteria", "d": "D. Perhitungan Gap", "e": "E. Pembobotan ", "benar": "C"}, {"soal": "Dari pengertian dari beberapa ahli berikut, yang termasuk pengertian dari metode Weighted Product adalah...", "a": "A. Model pendukung keputusan yang menguraikan masalah multi kriteria kompleks menjadi suatu hierarki.", "b": "B. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter ", "c": "C. Satu metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "d": "D. Metode penjumlahan terbobot", "e": "E. salah satu metode pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "benar": "E"}, {"soal": "Yang BUKAN merupakan kelebihan-kelebihan analsis AHP adalah...", "a": "A. Model yang fleksibel dan mudah dipahami", "b": "B. Ketergantungan model pada input utamanya", "c": "C. Mempertimbangkan konsistensi logis dalam penilaian", "d": "D. menyediakan skala pengukuran dan metode untuk mendapatkan prioritas.", "e": "E. Membuat orang menyaring definisi dari suatu permasalahan", "benar": "B"}, {"soal": "Berikut yang merupakan prinsip dasar AHP adalah...", "a": "A. Dekomposisi, kesatuan, kompleksitas", "b": "B. Pengukuran, penilaian komparasi, kesatuan", "c": "C. Dekomposisi, penilaian komparasi, penentuan prioritas", "d": "D. Kompleksitas, pengukuran, kesatuan", "e": "E. Dekomposisi, pengukuran, penilaian komparasi", "benar": "C"}, {"soal": "Konsep dasar dari metode Simple Additive Weighthing adalah...", "a": "A. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut ", "b": "B. Menguraikan masalah multi kriteria kompleks menjadi suatu hierarki", "c": "C. Memecahkan masalah yang kompleks melalui pengintegrasian secara deduktif", "d": "D. Mempertimbangkan prioritas relatif faktor-faktor pada sistem", "e": "E. Menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "benar": "A"}, {"soal": "Berikut adalah prosedur dari beberapa metode dalam Sistem Pendukung Keputusan, yang termasuk ke dalam prosedur metode TOPSIS, yaitu...", "a": "A. Identifikasi dan perhitungan nilai Core Factor dan Secondary Factor.", "b": "B. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria", "c": "C. Membuat “pohon hierarki” untuk berbagai kriteria dan alternatif keputusan", "d": "D. Menentukan peringkat kecocokan untuk kriteria", "e": "E. Membuat peringkat prioritas dari matriks pairwise dengan menentukan eigenvector", "benar": "B"}, {"soal": "Langkah awal pada penyelesaian metode Simple Additive Weight (SAW) adalah...", "a": "A. Menentukan kriteria dan nilai bobot kriteria yang dijadikan acuan dalam pengambilan keputusan", "b": "B. Menentukan tujuan, kriteria, dan alternatif keputusan", "c": "C. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "d": "D. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "e": "E. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan ", "benar": "E"}, {"soal": "Berikut yang BUKAN merupakan alasan mengapa orang-orang menggunakan logika fuzzy, yaitu...", "a": "A. Konsep logika fuzzy mudah dimengerti", "b": "B. Logika fuzzy sangat fleksibel", "c": "C. Logika fuzzy mampu memodelkan fungsi-fungsi nonlinear yang sangat kompleks", "d": "D. Implementasi logika fuzzy rumit untuk diterapkan", "e": "E. Logika fuzzy memiliki toleransi terhadap data yang tidak tepat.", "benar": "D"}, {"soal": "Pengertian dari Multi Atribute Decision Making (MADM) adalah...", "a": "A. Mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif", "b": "B. Metode dengan mengambil banyak kriteria sebagai dasar pengambilan keputusan dengan penilaian yang subjektif menyangkut masalah pemilihan", "c": "C. Model pendukung keputusan yang menguraikan masalah multi kriteria kompleks menjadi suatu hierarki", "d": "D. Salah satu metode pengambilan keputusan untuk menyelesaikan masalah", "e": "E. Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "benar": "B"}, {"soal": "Berikut adalah beberapa istilah yang perlu diketahui dalam memahami sistem fuzzy, kecuali...", "a": "A. Variabel fuzzy", "b": "B. Himpunan fuzzy", "c": "C. Semesta pembicaraan", "d": "D. Komposisi aturan", "e": "E. Aturan penelitian", "benar": "E"}, {"soal": "Nilai profil alternatif dikurangi nilai profil target merupakan perhitungan dari", "a": "A. NSF", "b": "B. Gap", "c": "C. IS", "d": "D. NS", "e": "E. Pembobotan", "benar": "B"}, {"soal": "Kriteria penilaian yang paling penting di dalam proses pengambilan keputusan adalah", "a": "A. Nilai total", "b": "B. Secondary factor", "c": "C. Core factor", "d": "D. Rangking", "e": "E. Gap", "benar": "C"}, {"soal": "Item-item selain aspek yang ada pada core factor atau bisa juga disebut sebagai faktor pendukung pada proses pengambilan keputusan adalah", "a": "A. Nilai total", "b": "B. Secondary factor", "c": "C. Core factor", "d": "D. Rangking", "e": "E. Gap", "benar": "B"}, {"soal": "Yang bukan fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making, yaitu", "a": "A. Kriteria", "b": "B. Alternatif", "c": "C. Atribut", "d": "D. Bobot", "e": "E. Matrik keputusan", "benar": "A"}, {"soal": "Kriteria pada metofe weighted product disimbolkan dengan", "a": "A. w", "b": "B. X", "c": "C. i", "d": "D. V", "e": "E. Ci", "benar": "E"}, {"soal": "Vektor S pada metode weighted product akan bernilai positif apabila", "a": "A. Jumlah total normalisasi bobot  untuk seluruh kriteria harus memenuhi persamaan 1", "b": "B. w merupakan atribut biaya", "c": "C. Memangkatkan w  sebagai bobot normalisasi tiap kriteria", "d": "D. w merupakan atribut keuntungan", "e": "E. Melakukan seluruh perkalian nilai kriteria 1 hingga n", "benar": "D"}, {"soal": "Proses perangkingan pada SAW merupakan Hasil akhir dari", "a": "A. Vector bobot", "b": "B. Alternatif terbaik (Ai)", "c": "C. Nilai preferensi (Vi)", "d": "D. Elemen baris matriks ternormalisasi (R)", "e": "E. Bobot preferensi (W)", "benar": "C"}, {"soal": "Pada metode AHP, menurut Saaty, hasil penilaian yang dapat diterima adalah yang mempunyai ratio konsistensi lebih kecil atau sama dengan", "a": "A. 10%", "b": "B. 5%", "c": "C. 25%", "d": "D. 15%", "e": "E. 20%", "benar": "A"}, {"soal": "Prosedur TOPSIS yang pertama adalah", "a": "A. Membuat matrik keputusan ternormalisasi (R)", "b": "B. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)", "c": "C. Menentukan nilai preferensi untuk setiap alternatif", "d": "D. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "e": "E. Membuat matrik keputusan ternormalisasi terbobot", "benar": "B"}, {"soal": "Yang bukan metode untuk penyelesaian masalah MADM adalah", "a": "A. Analytical Hierarchy Process (AHP)", "b": "B. Simple Additive Weighting (SAW)", "c": "C. Weighted Product (WP)", "d": "D. Sintesis", "e": "E. Profile Matching", "benar": "D"}, {"soal": "\"Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter\" adalah pengertian profile matching yang dikemukakan oleh...", "a": "A. Siahaan dan Tharo 2016", "b": "B. Kusrini 2007", "c": "C. Mufid 2014", "d": "D. Sasarabaya 2017", "e": "", "benar": "A"}, {"soal": "Gap adalah hasil perbedaan kompetensi antara profil alternatif dan profil target (Siahaan dan Taro 2016). Manakan persamaan perhitungan Gap yang tepat :", "a": "A. Nilai gap alternatif x nilai gap target", "b": "B. Nilai gap alternatif - nilai profil target", "c": "C. Nilai profil alternatif - Nilai profil target", "d": "D. Nilai gap target : bilai gap alternatif + nilai profil alternatif", "e": "", "benar": "C"}, {"soal": "Tiga tahapan utama profile matching menurut kusrini 2007 berturut-turut adalah :", "a": "A. Perhitungan gap, perhitungan core factor, perhitungan secondary factor", "b": "B. Pembobotan, penentuan masalah, perhitungan core factor.", "c": "C. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF), perhitungan nilai total, penentuan rangking alternatif.", "d": "D. Perhitungan gap, pembobotan, Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF). ", "e": "", "benar": "D"}, {"soal": "MADM adalah singkatan dari", "a": "A. Multiverse Atribute Decision System", "b": "B. Multilevel Atribute Descision Making", "c": "C. Multi Attribute Decision Making ", "d": "D. Multi Automatical Decision Making", "e": "", "benar": "C"}, {"soal": "Fitur umum dalam MADM berturut-turut adalah :", "a": "A. alternative, konflik kriteria, metriks keputusan, bobot penilaian, atribut", "b": "B. alternative, atribut, konflik antar kriteria, bobot keputusan, matriks  keputusan", "c": "C. atribut, decision, konflik kriteria, bobot keputusan, analisis keputusan", "d": "D. atribut, konflik antar kriteria, bobot keputusan, matriks  keputusan, alternative", "e": "", "benar": "B"}, {"soal": "Menurut (Kusumadewi 2006) Metode Weighted Product Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan ..", "a": "A. Rating pembobotan keputusan", "b": "B. Rating bobot produk", "c": "C. Rting target", "d": "D. Rating atribut", "e": "", "benar": "D"}, {"soal": "Langkah pertama dalam penyelesaian metode Simple Additive Weight (SAW) menurut (Frieyadie 2016) adalah:", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "b": "B. Membuat matriks keputusan berdasarkan kriteria (Ci).", "c": "C. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "d": "D. melakukan normalisasi matriks berdasarkan persamaan.", "e": "", "benar": "A"}, {"soal": "Metode AHP dalam sistem pendukung keputusan dikembangkan oleh ..", "a": "A. Prof. DR. Mathius", "b": "B. Prof.Thomas A.Edison", "c": "C. Prof.Thomas L.Saaty", "d": "D. Prof.DR. Eng. Sulaiman", "e": "", "benar": "C"}, {"soal": "Metoda pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait adalah pengertian metode..", "a": "A. APRIORI", "b": "B. TOPSIS", "c": "C. SAW", "d": "D. AHP", "e": "", "benar": "D"}, {"soal": "MCDM yang digunakan untuk menyelesaiakan permasalahn pada ruang kontinyu adalah :", "a": "A. MADM", "b": "B. MODM", "c": "C. MKDM", "d": "D. MMDM", "e": "", "benar": "B"}, {"soal": "Manakah pengertian profile matching dari Kusrini 2007 adalah?", "a": "a. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter", "b": "b. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati", "c": "c. Proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap", "d": "d. Dalam profile matching dilakukan penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut", "e": "", "benar": "B"}, {"soal": "Proses SPK dengan metode profile matching yang benar adalah ", "a": "a. Perhitungan GAP, pembobotan, identifikasi dan perhitungan nilai CF dan SF, penentuan ranking alternatif, perhitungan nilai total", "b": "b. Perhitungan nilai total, penentuan ranking alternatif, perhitungan GAP, pembobotan, identifikasi dan perhitungan nilai CF dan SF", "c": "c. Perhitungan GAP, pembobotan, identifikasi dan perhitungan nilai CF dan SF, perhitungan nilai total, penentuan ranking alternatif", "d": "d. Pembobotan, perhitungan GAP, identifikasi dan perhitungan nilai CF dan SF, perhitungan nilai total, penentuan ranking alternatif", "e": "", "benar": "C"}, {"soal": "Dalam menentukan nilai secondary factor, simbol \"IS\" merupakan simbol?", "a": "a. Jumlah variabel secondary factor", "b": "b. Nilai primer factor", "c": "c. Nilai secondary factor", "d": "d. Jumlah total nilai secondary factor", "e": "", "benar": "A"}, {"soal": "Metode Weighted product adalah ... ", "a": "a. metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa pengaturan yang ada", "b": "b. Salah satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu ", "c": "c. Metode pengambilan keputusan untuk menyelesaikan masalah Solo Attribute Decision Making (SADM)", "d": "d. Salah satu metode pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "e": "", "benar": "D"}, {"soal": "3 langkah awal dari penyelesaian metode Weighted Product yang benar adalah?", "a": "a. Normalisasi bobot, Menentukan peringkat kecocokan kriteria, Penentuan kriteria", "b": "b. Penentuan kriteria, Menentukan peringkat kecocokan kriteria, Normalisasi bobot", "c": "c. Penentuan kriteria, Normalisasi bobot, Menentukan peringkat kecocokan kriteria", "d": "d. Normalisasi bobot, Penentuan kriteria, Menentukan peringkat kecocokan kriteria", "e": "", "benar": "B"}, {"soal": "Metode SAW dikenal sebagai metode?", "a": "a. Metode pembagian bobot", "b": "b. Metode pengurangan bobot", "c": "c. Metode perkalian bobot", "d": "d. Metode penjumlahan bobot", "e": "", "benar": "D"}, {"soal": "Yang bukan merupakan kelebihan SAW adalah", "a": "a. Terdapat mekanisme normalisasi matrik keputusan (Y)", "b": "b. Dapat menemukan nilai bobot untuk masing-masing alternatif", "c": "c. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "d": "d. Terdapat mekanisme normalisasi matrik keputusan (X)", "e": "", "benar": "A"}, {"soal": "AHP dikembangkan oleh?", "a": "a. Prof. Thomas L. Saaty", "b": "b. Doc. Thomas L. Saaty", "c": "c. Mr. Thomas Shelby", "d": "d. Thomas I. Saaty", "e": "", "benar": "A"}, {"soal": "Berdasarkan tujuannya, MCDM dibagi menjadi dua, yaitu", "a": "a. MODM dan MDOM", "b": "b. MADM dan MODM", "c": "c. MODM dan MUDM", "d": "d. MUDM dan MADM", "e": "", "benar": "B"}, {"soal": "MADM digunakan untuk?", "a": "a. untuk penilaian / seleksi beberapa alternatif dalam jumlah banyak", "b": "b. untuk menyelesaiakan permasalahan pada ruang selanjutnya", "c": "c. untuk menyelesaiakan permasalahan pada ruang kontinyu ", "d": "d. Untuk penilaian / seleksi beberapa alternatif dalam jumlah terbatas", "e": "", "benar": "D"}, {"soal": "Yang tidak termasuk dalam penentuan keputusan menggunakan profile matching adalah...", "a": "A. Perhitungan gap", "b": "B. Perhitungan nilai total", "c": "C. Perhitungan nilai CF dan SF", "d": "D. Perhitungan variabel", "e": "", "benar": "D"}, {"soal": "Dalam profile matching dilakukan penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai ... yang dimiliki oleh masing-masing alternatif tersebut.", "a": "A. Nilai", "b": "B. Karakteristik", "c": "C. Gap", "d": "D. Parameter", "e": "", "benar": "B"}, {"soal": "Ada berapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making?", "a": "A. 4", "b": "B. 3", "c": "C. 5", "d": "D. 2", "e": "", "benar": "C"}, {"soal": "Apa langkah awal yang harus dilakukan dalam pengambilan keputusan?", "a": "A. Menentukan kriteria dan nilai bobot kriteria", "b": "B. Menentukan nilai skala", "c": "C. Menentukan atribut dan alternatif", "d": "D. Menentukan preferensi", "e": "", "benar": "A"}, {"soal": "Metode Simple Additive Weighthing (SAW) sering juga dikenal dengan istilah metode...", "a": "A. Penambahan terstruktur", "b": "B. Pembagian terpilih", "c": "C. Penjumlahan terbobot", "d": "D. Perkalian terdistribusi", "e": "", "benar": "C"}, {"soal": "Yang termasuk langkah dalam penyelesaian metode SAW adalah...", "a": "A. Menentukan jumlah tingkatan pada setiap kriteria", "b": "B. Menentukan rating kecocokan setaip alternatif pada setiap kriteria", "c": "C. Menentukan kriteria dalam hierarki sebagai acuan dalam pendukung keputusan", "d": "D. Menentukan batasan dalam menata elemen pada kriteria", "e": "", "benar": "B"}, {"soal": "Yang merupakan prinsip pokok AHP adalah...", "a": "A. Menentukan kriteria, menyusun hierarki, menghitung CR", "b": "B. Menentukan kriteria, menyusun elemen, menghitung CF", "c": "C. Menentukan priotitas, menyusun elemen, menghitung CF", "d": "D. Menentukan prioritas, menyusun hierarki, menhitung CR", "e": "", "benar": "D"}, {"soal": "Tahap awal pada model TOPSIS adalah...", "a": "A. Melakukan normalisasi rating kecocokan", "b": "B. Melakukan normalisasi matriks keputusan", "c": "C. Melakukan normalisasi elemen hierarki", "d": "D. Melakukan normalisasi nilai alternatif", "e": "", "benar": "B"}, {"soal": "Proses MADM dilakukan dalam 3 tahap, diantaranya:", "a": "A. Penyusunan komponen-komponen situasi, analisis, sintesis", "b": "B. Penyusunan komponen-komponen kecocokan, analisis, perhitungan", "c": "C. Penyusunan komponen-komponen nilai alternatif, analisis, sintesis", "d": "D. Penyusunan komponen-komponen matriks, analisis, perhitungan", "e": "", "benar": "A"}, {"soal": "Ada berapa metode untuk penyelesaian masalah MADM?", "a": "A. 3", "b": "B. 6", "c": "C. 5", "d": "D. 4", "e": "", "benar": "C"}, {"soal": "Metode profile matching dapat membandingkan antara kompetensi yang dimiliki calon Pengajar dengan kompetensi standar jabatan sehingga diperoleh perbedaan kompetensinya, merupakan pengertian dari?", "a": "a. GAP", "b": "b. AHP", "c": "c. SAW", "d": "d. SLB", "e": "e. SPK", "benar": "A"}, {"soal": "SPK merupakan pengembangan lebih lanjut dari :", "a": "a. Sistem Informasi Manajemen Terkomputerisasi (Computerized   Management Information System)", "b": "b. Sistem Informasi Manajemen Keputusan", "c": "c. Sistem Informasi Manajemen Berjalan", "d": "d. Sistem Informasi Manajemen dan PDE", "e": "e. Sistem Informasi Manajemen dan SPK", "benar": "A"}, {"soal": "Apa yang dimaksud dengan Weighted Product (WP) ?", "a": "a. Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu", "b": "b. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter", "c": "c. Aspek penilaian dikelompokkan menjadi dua", "d": "d. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif", "e": "e. Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "benar": "C"}, {"soal": "SPK Ditujukan untuk membantu keputusan-keputusan:", "a": "a. Terstruktur", "b": "b. Acak", "c": "c. Kurang Terstruktur", "d": "d. Membingungkan", "e": "e. Sulit", "benar": "C"}, {"soal": "Metode apa yang sering dikenal dengan istilah penjumlahan berbobot ?", "a": "a. AHP", "b": "b. GAP", "c": "c. SAW", "d": "d. SPK", "e": "e. SLP", "benar": "C"}, {"soal": "Kelebihan dalam metode SAW, kecuali :", "a": "a. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "b. Terdapat mekanisme normalisasi matrik keputusan (X), yaitu proses matrik keputusan(X) ke dalam skala yang dapat diperbandingkan dengan semua rating alternatif yang ada", "c": "c. Meningkatkan kecocokan untuk kriteria", "d": "d. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "e": "", "benar": "C"}, {"soal": "Apa yang dimaksud dengan ANALYTICAL HIERARCHY PROCESS (AHP) ?", "a": "a. Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "b": "b. Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu", "c": "c. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif", "d": "d. Metoda pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait", "e": "e. Aspek penilain dibagi menjadi dua", "benar": "D"}, {"soal": "?????? = ?????? ?????? ?? 2 ??=0 ; ???????????? ?? = 1,2, � ??; ?????? ?? = 1,2, . . ? merupakan rumus?", "a": "a. Matriks keputusan ternormalisasi terbobot", "b": "b. Matriks keputusan ternormalisasi", "c": "c. Jarak antara alternatif", "d": "d. Nilai preferensi untuk setiap Alternatif", "e": "e. Jarak dengan pasar terdekat", "benar": "B"}, {"soal": "Proses MADM dilakukan dengan tahapan, kecuali berikut ?", "a": "a. Analisi", "b": "b. Sintsis", "c": "c. Simbolis", "d": "d. Penyusunan komponen-komponen situasi ", "e": "", "benar": "C"}, {"soal": "TOPSIS dikembangkan oleh Hwang dan Yoon pada tahun ?", "a": "a. 1998", "b": "b. 1945", "c": "c. 1981", "d": "d. 1990", "e": "e. 2000", "benar": "C"}, {"soal": "Berikut ini yang bukan merupakan metode yang digunakan untuk SPK", "a": "a. Metode Sistem Pakar", "b": "b. Metode Regresi linier", "c": "c. Metode logika fuzzy", "d": "d. Metode AHP", "e": "e. Metode MVC", "benar": "E"}, {"soal": "Dibawah ini yang bukan karakteristik SPK", "a": "a. Imajinatif", "b": "b. Interaktif", "c": "c. Fleksibel", "d": "d. Data kualitas", "e": "e. Prosedur pakai", "benar": "A"}, {"soal": "merupakan  teknik/ metode yang dipakai untuk mengatasi hal yang tidak pasti pada masalah – masalah yang mempunyai banyak jawaban. Merupakan pengertian dari metode?", "a": "a. Metode Sistem Pakar", "b": "b. Metode Regresi linier", "c": "c. Metode logika fuzzy", "d": "d. Metode AHP", "e": "e. Metode NPV", "benar": "C"}, {"soal": "Metode untuk penyelesaian masalah MADM, kecuali", "a": "a. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "b. Fuzzy Interface System (FIS)", "c": "c. Simple Additive Weighting (SAW)", "d": "d. Weighted Product (WP)", "e": "e. Profile Matching", "benar": "B"}, {"soal": "DSS memiliki arti banyak dengan maksud yang kurang lebih hampir sama, yaitu suatu sistem komputer yang berguna bagi para pengambil keputusan untuk memecahkan masalah yang kurang lebih berhadapan dengan masalah?", "a": "a. Struktur", "b": "b. Non-Struktur atau Semi-Struktur", "c": "c. Terstruktur", "d": "d. Biasa", "e": "e. Tidak ada masalah", "benar": "B"}, {"soal": "Sudirman dan Widjjani (1996), mengemukakan ciri-ciri SPK yang dikemukakan oleh Alters Keen, salah satunya adalah merupakan gabungan model dari :", "a": "a. Kualitatif dan kumpulan data", "b": "b. Kuantitatif dan kumpulan data", "c": "c. Kualitatif dan kuantitatif", "d": "d. Terstruktur dan Semiterstruktur", "e": "e. Semiterstruktur dan tidak terstruktur", "benar": "A"}, {"soal": "SPK merupakan pengembangan lebih lanjut dari :", "a": "a. Sistem Informasi Manajemen Terkomputerisasi (Computerized   Management Information System)\na. Sistem Informasi Manajemen Keputusan", "b": "b. Sistem Informasi Manajemen Berjalan", "c": "c. Sistem Informasi Manajemen dan PDE", "d": "d. Sistem Informasi Manajemen dan SPK", "e": "", "benar": "A"}, {"soal": "Konsep mengenai DSS pertama kali dikemukakan awal tahun:", "a": "a. 1960-an", "b": "b. 1970-an", "c": "c. 1980-an", "d": "d. 1990-an", "e": "e. 1995-an", "benar": "A"}, {"soal": "SPK Ditujukan untuk membantu keputusan-keputusan:", "a": "a. Terstruktur", "b": "b. Acak", "c": "c. Kurang Terstruktur", "d": "d. Membingungkan", "e": "e. Sulit", "benar": "C"}, {"soal": "Menurut Gordon sistem sebagai suatu :", "a": "a. Agregasi atau kumpulan objek-objek yang terangkai dan tidak saling bergantung dengan teratur", "b": "b. Agregasi atau kumpulan kejadian yang terangkai dan saling bergantung dengan teratur", "c": "c. Agregasi atau kumpulan kejadian-kejadian yang terangkai dan tidak saling bergantung dengan teratur", "d": "d. Agregasi atau kumpulan objek-objek yang terangkai dan saling bergantung dengan teratur", "e": "e. Agregasi atau kumpulan objek-objek yang tidak terangkai dan tidak saling bergantung dengan teratur", "benar": "D"}, {"soal": "Memandang SPK mrpkn kemajuan secara revolusioner dari SIM dan PDE (Pengolahan Data Elektronik):", "a": "a. Sudut Pandang Teoritikal              ", "b": "b. Sudut Pandang Konotasional    ", "c": "c. Sudut Pandang Dialog", "d": "d. Sudut Pandang Sistem", "e": "e. Sudut Pandang Input", "benar": "B"}, {"soal": "SPK bukan hanya sekedar pengembangan evolusioner dari SIM & PDE, namun juga merupakan kelas sistem informasi yang berinteraksi dengan bagian-bagian lain yang memiliki karakteristik diantaranya sbb, kecuali:", "a": "a. Memiliki subsistem yg terintegrasi", "b": "b. Membutuhkan struktur data yg komprehensif", "c": "c. Pendekatan easy to use.", "d": "d. Kemampuan sistem beradaptasi dgn cepat.", "e": "e. Menekankan pada fleksibilitas.", "benar": "E"}, {"soal": "Subsistem Manajemen Basis Data memiliki kemampuan sbb, kecuali:", "a": "a. Mengkombinasikan berbagai variasi data", "b": "b. Menambahkan sumber data secara cepat", "c": "c. Menciptakan model-model baru secara cepat dan mudah", "d": "d. Menggambarkan struktur data logikal sesuai pengertian pemakai", "e": "e. Menangani data secara personil", "benar": "C"}, {"soal": "Bennet mendefinisikan komponen dari subsistem perangkat lunak dialog kecuali ?", "a": "a. User", "b": "b. Terminal", "c": "c. Pemakai", "d": "d. Perangkat Lunak", "e": "e. Perangkat Keras", "benar": "E"}, {"soal": "Meliputi apa yang dapat digunakan oleh pemakai dalam berkomunikasi dengan sistem adalah:", "a": "a. User Interface", "b": "b. Bahasa Tampilan", "c": "c. Basis Pengetahuan", "d": "d. Bahasa Aksi", "e": "e. Bahasa Terminal", "benar": "D"}, {"soal": "Yang bukan komponen DSS :", "a": "A. User Interface", "b": "B. Problem", "c": "C. Data", "d": "D. Knowledge", "e": "", "benar": "B"}, {"soal": "Berikut adalah karakteristik DSS, kecuali", "a": "A. Efisien", "b": "B. Mempunyai model", "c": "C. Mudah digunakan", "d": "D. Untuk eksekutif", "e": "", "benar": "A"}, {"soal": "Yang BUKAN jenis model DSS adalah", "a": "A. Model Statistika", "b": "B. Model berbasis algoritma", "c": "C. Model Random", "d": "D. Model Simulasi", "e": "", "benar": "C"}, {"soal": "Berikut adalah contoh problem yang dipecahkan oleh DSS adalah", "a": "A. Gaji pegawai", "b": "B. Kenaikan pangkat pegawai", "c": "C. Rekruitmen pegawai", "d": "D. Transaksi penjualan", "e": "", "benar": "C"}, {"soal": "Hierarki organisasi data terdiri dari berapa tingkatan?", "a": "A. 8", "b": "B. 5", "c": "C. 7", "d": "D. 6", "e": "", "benar": "D"}, {"soal": "Relasi yang terjadi jika sebuah entry dalam sebuah objek data store dihubungkan dengan satu atau lebih entry dalam objek data store lain disebut relasi?", "a": "A. One to One", "b": "B. One to Many", "c": "C. Many to One", "d": "D. many to Many", "e": "", "benar": "B"}, {"soal": "Sumber data yang dapat mencirikan entity, adalah ...", "a": "A. Atribut", "b": "B. Model", "c": "C. Design", "d": "D. Field", "e": "", "benar": "A"}, {"soal": "Memberikan kemampuan pengambilan keputusan utk menganalisa masalah secara penuh melalui pengembangan dan perbandingan alternatif keputusan, merupakan pengembangan pendekatan SPK ...", "a": "A. Manajemen design", "b": "B. Intelligence", "c": "C. Manajemen model", "d": "D. Metode Critical Success Factor", "e": "", "benar": "C"}, {"soal": "Beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making yaitu, kecuali", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Matriks", "d": "D. Model", "e": "", "benar": "D"}, {"soal": "Tiga prinsip dasar AHP yaitu, kecuali", "a": "A. Complexity", "b": "B. Decomposition", "c": "C. Comparative Judgement", "d": "D. Synthesis of Priority", "e": "", "benar": "A"}, {"soal": "Rumus dari gap kompetensi antara profil alternatif dan profil target adalah :", "a": "A. Nilai Pro Alternatif - Nilai Profil Target", "b": "B. Nilai Profil Target - Nilai Profil Alternatif", "c": "C. (x)% NCF + (x)% NSF", "d": "D. (X)%N1 + (x)%N2 + .. + (x)%Nn", "e": "E. Nilai Pro Alternatif + Nilai Profil Target", "benar": "A"}, {"soal": "Berikut ini yang termasuk beberapa fitur umum yang dapat digunakan dalam Multiple Criteria Desicion Making, kecuali", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Konflik antar kriteria", "d": "D. Bobot keputusan", "e": "E. matriks  linear", "benar": "E"}, {"soal": "Berikut ini yang merupakan Arsitektur-Arsitektur dari Business Intelligence", "a": "A. Data Warehouse", "b": "B. Business Performance Management (BPM)", "c": "C. Business Summary", "d": "D. Data Warehouse", "e": "E. User Interface", "benar": "D"}, {"soal": "Dibawah ini yang merupakan Peran Manager Menurut Mintzberg, kecuali", "a": "A. Monitor", "b": "B. Leader", "c": "C. Figurehead", "d": "D. Entrepreneur", "e": "E. Teamworking", "benar": "E"}, {"soal": "Dibawah ini yang merupakan style dari Business intelligence, kecuali", "a": "A. Pengiriman dan peringatan laporan", "b": "B. Pelaporan perusahaan", "c": "C. Kueri ad-hoc", "d": "D. Statistik dan penambangan data", "e": "E. Analisis Segitiga", "benar": "E"}, {"soal": "Dibawah ini yang merupakan major tools kategori untuk MSS, kecuali", "a": "A. Data Management", "b": "B. Intelligent System Expert Systems", "c": "C. Web Analytics", "d": "D. OLAP", "e": "E. RapidMiner", "benar": "E"}, {"soal": "Kelebihan metode SAW sebagai berikut, kecuali", "a": "a. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "b. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "c. data yang dimasukkan harus benar dan tepat", "d": "d. Terdapat mekanisme normalisasi matrik keputusan (X)", "e": "e. Hasil akurasi jadi lebih efisien dan tepat", "benar": "C"}, {"soal": "Berikut yang bukan termasuk prosedur metode TOPSIS adalah", "a": "A. Membuat matriks keputusan ternormalisasi", "b": "B. Membuat matrik keputusan ternormalisasi terbobot", "c": "C. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci)", "e": "E. Menentukan jarak antara setiap alternatif 𝐴𝑖 dengan matrikssolusi ideal positif dan solusi ideal negatif", "benar": "D"}, {"soal": "Sebutkan fase fase dari decision proccess, kecuali", "a": "A. Analyst Phase", "b": "B. Dukungan intelligence Phase", "c": "C. Design Phase", "d": "D. Choice Phase", "e": "E. Implementation Phase", "benar": "A"}, {"soal": "Berikut ini merupakan gaya gaya pengambilan keputusan, kecuali", "a": "A. Konsultatif", "b": "B. Heuristik vs Analitik", "c": "C. Otokratis vs Demokrat", "d": "D. Sistem Komputerasi", "e": "E. Konservatif", "benar": "E"}, {"soal": "Berikut ini merupakan cara yang valid untuk menentukan pembobotan suatu atribut, kecuali...", "a": "A. Pendapat pakar", "b": "B. Pendapat tak berdasar", "c": "C. Sumber Buku", "d": "D. Penelitian", "e": "E. Hasil Survey", "benar": "B"}, {"soal": "Pada umumnya, ada dua jenis atribut penentu dalam sebuah sistem pendukung keputusan, yaitu...", "a": "A. Cost dan Benefit", "b": "B. Cost dan Value", "c": "C. Benefit dan Value", "d": "D. Value dan Trade", "e": "E. Trade dan Cost", "benar": "A"}, {"soal": "SAW, AHP, dan Weighted Product termasuk ke dalam...", "a": "A. Multiple Objective Decision Making", "b": "B. Multiple Risk Decision Making", "c": "C. Multiple Alternative Decision Making", "d": "D. Multiple Attribute Decision Making", "e": "E. Multiple Task Decision Making", "benar": "D"}, {"soal": "Pada weighted product, langkah yang harus dilakukan setelah mengubah nilai kriteria alternatif adalah...", "a": "A. Memasukkan data alternatif", "b": "B. Menentukan nilai skala setiap kriteria", "c": "C. Membuat matriks keputusan", "d": "D. Menghitung normalisasi bobot", "e": "E. Menghitung vektor S", "benar": "C"}, {"soal": "Hasil akhir diperoleh dari proses perangkingan yaitu penjumlahan dari perkalian matriks ternormalisasi R dengan vektor bobot adalah tahap akhir dari metode...", "a": "A. Profile Matching", "b": "B. Weighted Product", "c": "C. AHP", "d": "D. TOPSIS", "e": "E. SAW", "benar": "E"}, {"soal": "r(ij) = min(x(ij))/x(ij) merupakan rumus normalisasi matriks keputusan apabila atribut berupa...", "a": "A. Cost", "b": "B. Value", "c": "C. Benefit", "d": "D. Trade", "e": "E. Risk", "benar": "A"}, {"soal": "Menghitung Consistency Ratio merupakan salah satu prinsip pokok dari metode...", "a": "A. Profile Matching", "b": "B. Weighted Product", "c": "C. AHP", "d": "D. TOPSIS", "e": "E. SAW", "benar": "C"}, {"soal": "8. Menurut Saaty(2004), nilai Consitency Ratio yang dapat diterima adalah...", "a": "A. > 10%", "b": "B. <= 10%", "c": "C. > 50%", "d": "D. <= 50%", "e": "E. 90%", "benar": "B"}, {"soal": "Diharuskan untuk menentukan matriks solusi ideal positif dan matriks solusi ideal negatif merupakan bagian dari prosedur metode...", "a": "A. Profile Matching", "b": "B. Weighted Product", "c": "C. AHP", "d": "D. TOPSIS", "e": "E. SAW", "benar": "D"}, {"soal": "Rumus untuk menentukan nilai preferensi untuk setiap alternatif (V(i)) adalah...", "a": "A. Jarak alternatif ke solusi ideal positif / (jarak alternatif ke solusi ideal negatif + jarak alternatif ke solusi ideal positif)", "b": "B. Jarak alternatif ke solusi ideal negatif / (jarak alternatif ke solusi ideal negatif ^ jarak alternatif ke solusi ideal positif)", "c": "C. Jarak alternatif ke solusi ideal positif / (jarak alternatif ke solusi ideal negatif ^ jarak alternatif ke solusi ideal positif)", "d": "D. Jarak alternatif ke solusi ideal positif / jarak alternatif ke solusi ideal negatif", "e": "E. Jarak alternatif ke solusi ideal negatif / (jarak alternatif ke solusi ideal negatif + jarak alternatif ke solusi ideal positif)", "benar": "E"}, {"soal": "Langkah pertama yang dilakukan dalam membuat keputusan adalah....", "a": "A. Mendefinisikan masalah atau peluang", "b": "B. Membangun model masalah", "c": "C. Identifikasi solusi", "d": "D. Membandingkan solusi yang ada", "e": "E. Memilih potensi solusi terbaik", "benar": "A"}, {"soal": "Apa itu decision making?", "a": "A. Analisis permasalahan yang ditemukan", "b": "B. Transformasi elemen input menjadi output", "c": "C. Proses pembuatan aplikasi untuk menyelesaikan masalah", "d": "D. Penggunaan algoritma untuk menemukan hasil terbaik", "e": "E. Proses memilih di antara dua atau lebih solusi atau tindakan alternatif untuk mencapai suatu tujuan", "benar": "E"}, {"soal": "Apa kepanjangan dari DSS?", "a": "A. Decision Support System", "b": "B. Data System Structural", "c": "C. Diagnosis Support System", "d": "D. Decision Secure System", "e": "E. Data Saver System", "benar": "A"}, {"soal": "Yang bukan merupakan komponen SPK adalah?", "a": "A. Data Management", "b": "B. Model Management", "c": "C. Problem Analysis", "d": "D. Communication (Interface)", "e": "E. Knowledge Management", "benar": "C"}, {"soal": "Pengertian metode SAW menurut Kusumadewi adalah", "a": "A. Menggunakan prinsip bahwa alternatif yang dipilih harus memiliki jarak terpendek dari solusi ideal positif dan memiliki jarak terjauh dari solusi ideal negatif dari titik geometris menggunakan jarak euclidean untuk menentukan kedekatan relatif antara alternatif ke solusi yang optimal", "b": "B. Mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua kriteria", "c": "C. Model pendukung keputusan yang menguraikan masalah multi kriteria kompleks menjadi suatu hierarki", "d": "D. Pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan ", "e": "E. Mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati ", "benar": "B"}, {"soal": "Metode SPK yang membutuhkan proses normalisasi matriks adalah....", "a": "A. AHP", "b": "B. Matching Profile", "c": "C. SAW", "d": "D. AHP", "e": "E. NPV", "benar": "C"}, {"soal": "Kelemahan metode AHP salah satunya adalah....", "a": "A. Ketergantungan pada persepsi seorang ahli sehingga dalam hal ini melibatkan subyektivitas sang ahli", "b": "B. Algoritma yang mudah dan simpel digunakan", "c": "C. Model yang fleksibel dan mudah dipahami", "d": "D. Mempertimbangkan konsistensi logis dalam penilaian yang digunakan untuk menentukan prioritas", "e": "E. Perbandingan secara berpasangan krietria elemen yang diberikan", "benar": "A"}, {"soal": "Apa kepanjangan dari MADM?", "a": "A. Multiple Area Decision Making", "b": "B. Minimal Additive Decision Making", "c": "C. Multiple Answer Decision Making", "d": "D. Multiple Attribute Decision Making", "e": "E. Minimal Attribute Decision Making", "benar": "D"}, {"soal": "Sistem yang mencakup keuangan, statistik, ilmu manajemen, atau model kuantitatif lainnya yang menyediakan kemampuan analitis sistem dan manajemen perangkat lunak yang sesuai disebut dengan....", "a": "A. Decision Support System", "b": "B. Model Base Management System", "c": "C. Multiple Area Decision Making", "d": "D. Data Management System", "e": "E. Data Base Management System", "benar": "B"}, {"soal": "Model merupakan representasi sederhana dari kenyataan. Di bawah ini merupakan jenis model berdasarkan tingkat abstraksinya, kecuali...", "a": "A. Iconic Model", "b": "B. Analog Model", "c": "C. Mental Model", "d": "D. Mathematical Model", "e": "E. Database Model", "benar": "E"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter merupakan salah satu pengertian dari... ", "a": "A. Profile Matching ", "b": "B. Simple Additive Weighting", "c": "C. Analitycal Hierarchy Process", "d": "D. Multiple Criteria Decision Making", "e": "", "benar": "A"}, {"soal": "Berikut merupakan proses dan tahapan SPK dengan Metode Profile Matching yang benar yaitu...", "a": "A. Perhitungan Gap, Identifikasi dan perhitungan nilai CF dan SF, Pembobotan, Perhitungan nilai total, Penentuan Sistem", "b": "B. Perhitungan Gap, Pembobotan, Identifikasi dan perhitungan nilai CF dan SF, Perhitungan nilai total, Penentuan Ranking", "c": "C. Perhitungan Gap, Identifikasi dan perhitungan nilai CF dan SF, Perhitungan nilai total, Pembobotan, Penentuan Sistem", "d": "D. Perhitungan Gap, Identifikasi dan perhitungan nilai CF dan SF, Pembobotan, Perhitungan nilai total, Penentuan Ranking", "e": "", "benar": "B"}, {"soal": "Hasil Akhir dari proses profile matching adalah... ", "a": "A. System", "b": "B. User Interface", "c": "C. Ranking", "d": "D. History", "e": "", "benar": "C"}, {"soal": "Berikut merupakan kelebihan Metode Simple Additive Weighting (SAW), kecuali...", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Penilaian akan lebih tepat berdasarkan pada nilai kriteria dan bobot preferensi yang telah ditentukan", "c": "C. Terdapat mekanisme normalisasi matrik keputusan ", "d": "D. Kesalahan pada saat pembobotan karena ketidaktepatan data", "e": "", "benar": "D"}, {"soal": "Berikut merupakan contoh kasus yang dapat diselesaikan dengan Metode Simple Additive Weighting (SAW), kecuali...", "a": "A. Penilaian karyawan di perusahaan ", "b": "B. Pemilihan mahasiswa berprestasi", "c": "C. Rekomendasi pencari kerja terbaik", "d": "D. Penyusunan laporan observasi", "e": "", "benar": "D"}, {"soal": "Berikut merupakan contoh kasus yang dapat diselesaikan dengan metode AHP, kecuali...", "a": "A. Menentukan supplier untuk suatu warehouse", "b": "B. Mencari mobil bekas terbaik", "c": "C. Membuat website berbasis java", "d": "D. Memilih kandidat pengurus kelas", "e": "", "benar": "C"}, {"soal": "Dalam konteks sistem pengambilan keputusan (SPK), dikenal suatu metode bernama AHP. AHP merupakan singkatan dari...", "a": "A. Artificial Habit Protocol", "b": "B. Analitycal Hierarchy Process", "c": "C. Authentical Human Prowess", "d": "D. Analitycal Hierarchy Policy", "e": "", "benar": "B"}, {"soal": "Metode multi kriteria untuk mengidentifikasi solusi dari himpunan alternatif dengan minimalisasi simultan dari jarak titik ideal dan memaksimalkan jarak dari titik terendah merupakan pengertian dari...", "a": "A. TOPSIS", "b": "B. MAMDANI", "c": "C. SUGENO", "d": "D. FUZZY LOGIC", "e": "", "benar": "A"}, {"soal": "Multiple Criteria Decision Making (MCDM) berdasarkan tujuannya terbagi menjadi 2, yaitu...", "a": "A. MADM dan MODM", "b": "B. MADM dan MDDM", "c": "C. MDDM dan MODM", "d": "D. MDMM dan MIDM", "e": "", "benar": "A"}, {"soal": "Multiple Criteria Decision Making (MCDM) dilakukan dalam 3 tahap, yaitu...", "a": "A. Melakukan Perumusan Masalah, Menentukan Objek, Observasi", "b": "B. Penyusunan komponen-komponen situasi, Analisis, Sintesis", "c": "C. Pembentukan himpunan fuzzy, Aplikasi fungsi implikasi, Komposisi aturan ", "d": "D. Menentukan kriteria dan sifat, Menentukan rating kecocokan, Membuat matriks keputusan yang ternormalisasi", "e": "", "benar": "B"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter merupakan pengertian profile matching dari", "a": "a. Siahaan dan Tharo ", "b": "b. Kusrini", "c": "c. Mufid ", "d": "d. kasrono", "e": "", "benar": "A"}, {"soal": "Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati merupakan pengertian profile matching dari ", "a": "a. Siahaan dan Tharo ", "b": "b. Kusrini", "c": "c. Mufid ", "d": "d. kasrono", "e": "", "benar": "B"}, {"soal": "Dalam profile matching dilakukan penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut, pendapat tersebut berasal dari", "a": "a. Siahaan dan Tharo ", "b": "b. Kusrini", "c": "c. Mufid ", "d": "d. kasrono", "e": "", "benar": "C"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target merupakan pengertian dari", "a": "a. jarak", "b": "b. bobot", "c": "c. perbandingan", "d": "d. gap", "e": "", "benar": "D"}, {"soal": "Tahapan-tahapan di dalam penentuan keputusan menggunakan Profile Matching adalah sebagai berikut, kecuali...", "a": "a. perhitungan gap", "b": "b. pembobotan", "c": "c. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF)", "d": "d. perhitungan bobot", "e": "", "benar": "D"}, {"soal": "Tahapan-tahapan di dalam penentuan keputusan menggunakan Profile Matching adalah sebagai berikut, kecuali...", "a": "a. perhitungan nilai total", "b": "b. penentuan ranking alternatif", "c": "c. pembobotan", "d": "d. perhitungan nilai sementara", "e": "", "benar": "D"}, {"soal": "Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu merupakan pengertian Weighted Product (WP) dari ", "a": "a. kusumadewi", "b": "b. kasrono", "c": "c. mufid", "d": "d. kusrini", "e": "", "benar": "A"}, {"soal": "Metode Simple Additive Weighthing disebut juga dengan...", "a": "A. WP", "b": "B. Multi Attribute Decision Making ", "c": "C. Simple Additive Weighthing  ", "d": "D. metode  penjumlahan terbobot ", "e": "", "benar": "D"}, {"soal": "Berikut adalah kelebihan dari metode SAW, kecuali...", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "C. Terdapat mekanisme normalisasi matrik keputusan  ", "d": "D. metode  penjumlahan terbobot ", "e": "", "benar": "D"}, {"soal": "Berikut adalah langkah dalam penyesuaian metode simple additive Weight, kecuali...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "c": "C. Terdapat mekanisme normalisasi matrik keputusan  ", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci).", "e": "", "benar": "C"}, {"soal": "Rumus perhitungan gap yang benar adalah ...", "a": "A. Gap = Nilai profil alternatif - Nilai Profil Target", "b": "B. Gap = Nilai Profil Target - Nilai profil alternatif", "c": "C. Gap = Nilai Profil Target + Nilai profil alternatif", "d": "D. Gap = Nilai Profil Target * Nilai profil alternatif", "e": "E. Gap = Nilai Profil Target / Nilai profil alternatif", "benar": "A"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter adalah pengertian dari ...", "a": "A. AHP", "b": "B. SAW", "c": "C. Fuzzy", "d": "D. Profile Matching", "e": "E. WP", "benar": "D"}, {"soal": "Yang tidak termasuk fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making adalah ...", "a": "A. Bobot keputusan", "b": "B. Matriks keputusan", "c": "C. Entitas", "d": "D. Atribut", "e": "E. Konflik antar kriteria", "benar": "C"}, {"soal": "Langkah awal yang dilakukan pada perhitungan weighted product adalah ...", "a": "A. Menentukan kriteria dan nilai bobot kriteria yang dijadikan acuan dalam pengambilan keputusan", "b": "B. Menentukan nilai skala dari setiap kriteria", "c": "C. Memasukkan data alternatif", "d": "D. Merubah nilai kriteria alternatif", "e": "E. Membuat matriks keputusan dengan  membuat peringkat kecocokan pada  setiap kriteria", "benar": "A"}, {"soal": "Yang bukan etode untuk penyelesaian masalah MADM ...", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Waterfall", "c": "C. Analytical Hierarchy Process (AHP)", "d": "D. Simple Additive Weighting (SAW)", "e": "E. Weighted Product (WP)", "benar": "B"}, {"soal": "Bagaimana langkah awal menghitung konsistensi ...", "a": "A. Melakukan pengurangan matriks antara  matriks perbandingan ", "b": "B. Melakukan permbagian matriks antara  matriks perbandingan", "c": "C. Melakukan perkalian matriks antara  matriks perbandingan", "d": "D. Melakukan pernjumlahan matriks antara  matriks perbandingan", "e": "E. Melakukan translasi matriks antara  matriks perbandingan", "benar": "C"}, {"soal": "Saaty menerapkan bahwa suatu matriks perbandingan adalah konsisten bila nilai CR tidak lebih dari ...", "a": "A. 0,1", "b": "B. 0,01", "c": "C. 0,11", "d": "D. 1,0", "e": "E. 1,1", "benar": "A"}, {"soal": "Metode yang terkenal dengan istilah metode penjumlahan terbobot adalah ...", "a": "A. SAW", "b": "B. AHP", "c": "C. WP", "d": "D. Profile Matching", "e": "E. TOPSIS", "benar": "A"}, {"soal": "Langkah terakhir dalam prosedur TOPSIS adalah ...", "a": "A. Menentukan jarak antara nilai setiap alternatif dengan matriks solusi ideal positif dan matrik solusi ideal negatif", "b": "B. Menentukan nilai preferensi untuk setiap alternatif", "c": "C. Membuat matrik keputusan ternormalisasi (R)", "d": "D. Membuat matrik keputusan ternormalisasi terbobot", "e": "E. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "benar": "B"}, {"soal": "Pemilihan pegawai terbaik, pemilihan kontraktor bangunan yang tepat, bidang pertambangan, pemilihan suplier, software systems merupakan contoh implementasi ...", "a": "A. SAW", "b": "B. AHP", "c": "C. WP", "d": "D. Profile Matching", "e": "E. TOPSIS", "benar": "E"}, {"soal": "Menurut Hamka dan Harjono pada tahun 2013, penetuan urutan alternatif pada model Profile Matching didasarkan pada …", "a": "A. Tingkat profil alternatif yang paling mendekati profil ideal", "b": "B. Tingkat profil target yang paling mendekati profil ideal", "c": "C. Tingkat profil alternatif yang paling profil ideal", "d": "D. Tingkat profil target yang paling profil ideal", "e": "", "benar": "A"}, {"soal": "Di bawah ini, pernyataan yang benar mengenai aspek penilaian dalam metode Profile Matching adalah, kecuali…", "a": "A. Core factor merupakan kriteria penilaian yang paling penting di dalam proses pengambilan keputusan.", "b": "B. Core factor disebut juga sebagai primary factor.", "c": "C. Secondary factor adalah item-item selain aspek yang ada pada core factor atau bisa juga disebut sebagai faktor pendukung pada proses pengambilan keputusan.", "d": "D. Nilai masing-masing variabel core factor dan secondary factor dihitung berdasarkan nilai bobot gap.", "e": "", "benar": "B"}, {"soal": "Perhatikan fitur-fitru berikut!\n1) alternative    5) matriks keputusan\n2) gap     6) atribut\n3) konflik antar kriteria 7) entitas\n4) bobot preferensi  8) derajat kepentingan\nBerikut ini merupakan fitur umum yang yang akan digunakan dalam Multiple Criteria Desicion Making yaitu…", "a": "A. 1), 2), 4), dan 7)", "b": "B. 2), 3), 6), dan 8)", "c": "C. 1), 3), 5), dan 6)", "d": "D. 4), 5), 7), dan 8)", "e": "", "benar": "C"}, {"soal": "Metode ini adalah metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan. Pernyataan diatas merupakan pengertian dari metode…", "a": "A. Metode Simple Additive Weighthing (SAW)", "b": "B. Metode Weighted Prduct (WP)", "c": "C. Metode Analytical Hierarchy Process (AHP)", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution (TOPSIS)", "e": "", "benar": "B"}, {"soal": "Dalam langkah berurutan pada metode SAW, langkah membuat matriks keputusan berdasarkan kriteria (Ci) dilakukan tepat setelah langkah apa…", "a": "A. Kemudian melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.", "b": "B. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "c": "C. Hasil akhir diperoleh dari proses perangkingan yaitu penjumlahan dari perkalian matriks  ternormalisasi R dengan vector bobot sehingga diperoleh nilai terbesar yang dipilih sebagai  alternatif terbaik (Ai) sebagi solusi.", "d": "D. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "e": "", "benar": "D"}, {"soal": "Metode Analytical Hierarchy Process (AHP) dikembangkan oleh…", "a": "A. Thomas L. Saaty", "b": "B. Yoon dan Hwang", "c": "C. Siahaan dan Tharo", "d": "D. Frieyadie", "e": "", "benar": "A"}, {"soal": "Berikut ini yang bukan merupakan kelebihan-kelebihan analisis AHP yang benar, kecuali…", "a": "A. Complexity", "b": "B. Measurement", "c": "C. Decomposition", "d": "D. Systhecy", "e": "", "benar": "C"}, {"soal": "Perhatikan pernyataan berikut ini!\\n1) Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)\\n2) Membuat matrik keputusan ternormalisasi terbobot\\n3) Membuat matrik keputusan ternormalisasi (R)\\n4) Menentukan jarak antara nilai setiap alternatif dengan matriks solusi ideal positif dan matrik solusi ideal negatif\\n5) Menentukan nilai preferensi untuk setiap alternatif\\n6) Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif\\nBerikut ini, urutan prosedur TOPSIS yang benar menurut Kusumadewi et.al tahun 2006 adalah…", "a": "A. 1), 2), 3), 4), 5), dan 6)", "b": "B. 1), 3), 2), 6), 4), dan 5)", "c": "C. 1), 3), 2), 5), 4), dan 6)", "d": "D. 1), 2), 3), 4), 6), dan 5)", "e": "", "benar": "B"}, {"soal": "Pendekatan dengan metode TOPSIS digunakan apabila karakteristik data berbentuk…", "a": "A. Nominal", "b": "B. Ordinal", "c": "C. Interval", "d": "D. Kardinal", "e": "", "benar": "D"}, {"soal": "Berdasarkan tujuannya, MCDM dibagi menjadi 2 yaitu…", "a": "A. MADM dan MODM", "b": "B. MADM dan MEDM", "c": "C. MODM dan MEDM", "d": "D. MEDM dan MSDM", "e": "", "benar": "A"}, {"soal": "\"Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter\" merupakan pengertian profile matching yang dikemukakan oleh...", "a": "A. Siahaan dan Tharo", "b": "B. Kusrini", "c": "C. Mufid", "d": "D. Hamka dan Harjono", "e": "", "benar": "A"}, {"soal": "\"Metode Weighted Prduct (WP) Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan\" merupakan pengertian metode Weighted Product yang dikemukakan oleh...", "a": "A. Siahaan dan Tharo", "b": "B. Kusrini", "c": "C. Kusumadewi", "d": "D. Mufid", "e": "", "benar": "C"}, {"soal": "Kelebiha metode SAW menurut Limbing adalah sebagai berikut, kecuali...", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "C. Terdapat mekanisme normalisasi matrik keputusan (X)", "d": "D. Tidak terdapat mekanisme normalisasi matrik keputusan (X)", "e": "", "benar": "D"}, {"soal": "Menurut (Kusumadewi 2006) Metode Weighted Product Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan ..", "a": "A. Rating pembobotan keputusan", "b": "B. Rating bobot produk", "c": "C. Rting target", "d": "D. Rating atribut", "e": "", "benar": "D"}, {"soal": "Metode AHP dalam sistem pendukung keputusan dikembangkan oleh seorang Guru Besar Matematika dari University of Pittsburgh pada tahun 1970 yang bernama...", "a": "A. Prof. DR. Mathius", "b": "B. Prof.Thomas A.Edison", "c": "C. Prof.Thomas L.Saaty", "d": "D. Prof.DR. Eng. Sulaiman", "e": "", "benar": "C"}, {"soal": "MCDM merupakan singkatan dari...", "a": "A. Multi-Criteria Decision Making", "b": "B. Multi-Criteria Description Making", "c": "C. Multi-Criteria Decision Method", "d": "D. Multilevel-Criteria Decision Making", "e": "", "benar": "A"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak terpanjang dari solusi ideal negatif", "a": "A. SAW", "b": "B. TOPSIS", "c": "C. AHP", "d": "D. APRIORI", "e": "", "benar": "B"}, {"soal": "Berikut ini merupakan langkah-langkah prosedur TOPSIS (Kusumadewi et.al 2006) :\\n1. Membuat matrik keputusan ternormalisasi terbobot\\n2. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)\\n3. Menentukan jarak antara nilai setiap alternatif dengan matriks solusi ideal positif dan matrik solusi ideal negatif\\n4. Membuat matrik keputusan ternormalisasi (R)\\n5. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif\\n6. Menentukan nilai preferensi untuk setiap alternatif\\nUrutan yang benar adalah...", "a": "A. 2 - 4 - 1 - 3 - 5 - 6", "b": "B. 4 - 2 - 1 - 6 - 5 - 3", "c": "C. 2 - 4 - 1 - 6 - 5 - 3", "d": "D. 2 - 4 - 1 - 5 - 3 - 6", "e": "", "benar": "D"}, {"soal": "Berdasarkan tujuannya, MCDM dibagi menjadi 2, yaitu...", "a": "A. MADM dan MUDM", "b": "B. MADM dan MODM", "c": "C. MADM dan MEDM", "d": "D. MADM dan MIDM", "e": "", "benar": "B"}, {"soal": "Proses MADM dilakukan pada 3 tahap, kecuali...", "a": "A. Diagnosis", "b": "B. Penyusunan komponen-komponen situasi", "c": "C. Analisis", "d": "D. Sintesis", "e": "", "benar": "A"}, {"soal": "Metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu adalah pengertian dari", "a": "A. Multi Attribute Decision Making", "b": "B. Multi Additional Decision Making", "c": "C. Multi Analytical Decision Making", "d": "D. Multi Actors Decision Making", "e": "E. Multi Universe Decision Making", "benar": "A"}, {"soal": "MADM adalah singkatan dari", "a": "A. Multi Action Decision Making", "b": "B. Multi Algorithm Decision Making", "c": "C. Multi Attribute Decision Making", "d": "D. Multi Additional Decision Making", "e": "E. Multi Analytical Decision Making", "benar": "C"}, {"soal": "Metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan merupakan pengertian dari", "a": "A. Simple Additive Weighthing", "b": "B. Profile Matching", "c": "C. Analytical Hierarchy Process", "d": "D. Weighted Product", "e": "E. Multi Universe Decision Making", "benar": "D"}, {"soal": "Metode Analytical Hierarchy Process (AHP) dikembangkan oleh", "a": "A. Prof. Thomas L. Saaty", "b": "B. Thomas Alva Edison", "c": "C. Guido van Rossum", "d": "D. Michael Faraday", "e": "E. James Naistmith", "benar": "A"}, {"soal": "AHP mulai dikembangkan pada tahun", "a": "A. 1945", "b": "B. 1960", "c": "C. 1980", "d": "D. 1990", "e": "E. 1970", "benar": "E"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait merupakan pengertian dari", "a": "A. Simple Additive Weighthing", "b": "B. Profile Matching", "c": "C. Analytical Hierarchy Process", "d": "D. Weighted Product", "e": "E. Multi Universe Decision Making", "benar": "C"}, {"soal": "Yang tidak termasuk fitur umum yang digunakan dalam Multiple Criteria Decision Making adalah", "a": "A. Alternative", "b": "B. Features", "c": "C. Atribut", "d": "D. Konflik antar kriteria", "e": "E. Bobot keputusan", "benar": "B"}, {"soal": "Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu merupakan pengertian dari", "a": "A. Simple Additive Weighthing", "b": "B. Profile Matching", "c": "C. Analytical Hierarchy Process", "d": "D. Weighted Product", "e": "E. Multi Criteria Decision Making", "benar": "E"}, {"soal": "TOPSIS dikembangkan pada tahun", "a": "A. 1981", "b": "B. 1982", "c": "C. 1983", "d": "D. 1984", "e": "E. 1985", "benar": "A"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target pada metode Profile Matching disebut dengan", "a": "A. WP", "b": "B. Gap", "c": "C. AHP", "d": "D. CF", "e": "E. SF", "benar": "B"}, {"soal": "Yang tidak termasuk tahapan dalam penentuan keputusan menggunakan profile matching adalah", "a": "A. Perhitungan Gap", "b": "B. Pengurangan/reduksi", "c": "C. Pembobotan", "d": "D. Perhitungan Core Factor", "e": "E. Perhitungan Secondary Factor", "benar": "B"}, {"soal": "Proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensi atau gap merupakan proses dari...", "a": "A. Profile Matching", "b": "B. TOPSIS", "c": "C. WP", "d": "D. SAW", "e": "E. AHP", "benar": "A"}, {"soal": "Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu merupakan metode", "a": "A. Multiple Objective Decision Making", "b": "B. Multi Criteria Decision Making", "c": "C. Multi Attribute Decision Making", "d": "D. Model Management Decision Making", "e": "E. Multi Character Decision Making", "benar": "C"}, {"soal": "Yang bukan merupakan fitur umum yang digunakan dalam Multiple Criteria Decision Making, adalah", "a": "A. Alternatif", "b": "B. Atribut", "c": "C. Bobot Keputusan", "d": "D. Matriks", "e": "E. Karakteristik", "benar": "E"}, {"soal": "Metode yang membutuhkan proses normalisasi matriks keputusan(X) ke suatu skala yang dapat diperbandingkan dengan semua rating alternatif yang ada adalah metode", "a": "A. AHP", "b": "B. WP", "c": "C. SAW", "d": "D. TOPSIS", "e": "E. IRR", "benar": "C"}, {"soal": "Metode yang dikenal dengan istilah metode penjumlahan berbobot adalah", "a": "A. AHP", "b": "B. SAW", "c": "C. Regresi Linier", "d": "D. TOPSIS", "e": "E. IRR", "benar": "B"}, {"soal": "Metode yang memiliki prinsip prinsip bahwa alternatif yang terpilih harus mempunyai jarak terdekat dari solusi ideal positif dan terjauh dari solusi ideal negatif dari sudut pandang geometris dengan menggunakan jarak Euclidean untuk menentukan kedekatan relatif dari suatu alternatif adalah", "a": "A. AHP", "b": "B. WP", "c": "C. SAW", "d": "D. TOPSIS", "e": "E. IRR", "benar": "D"}, {"soal": "Yang termasuk dalam metode MCDM adalah", "a": "A. SAW", "b": "B. WP", "c": "C. TOPSIS", "d": "D. Naive Bayes", "e": "E. KNN", "benar": "C"}, {"soal": "Siapa yang mengembangkan AHP?", "a": "A. MacCrimmon", "b": "B. Thomas L Saaty", "c": "C. Yoon & Hwang", "d": "D. Bernard Roy", "e": "E. Winston Royce", "benar": "B"}, {"soal": "Metode yang menggunakan susunan hierarki untuk memecahkan situasi kompleks tidak terstruktur adalah", "a": "A. AHP", "b": "B. WP", "c": "C. SAW", "d": "D. TOPSIS", "e": "E. IRR", "benar": "A"}, {"soal": "Proses MADM dilakukan dalam 3 tahap sebagai berikut, kecuali?", "a": "A. Penyusunan komponen-komponen situasi", "b": "B. Analisis", "c": "C. Sintesis", "d": "D. Evaluasi", "e": "", "benar": "D"}, {"soal": "Langkah terakhir dari model profile matching adalah?", "a": "A. Perhitungan Gap", "b": "B. Pembobotan", "c": "C. Perhitungan nilai total", "d": "D. Penentuan rangking alternatif", "e": "", "benar": "D"}, {"soal": "\"Multi Attribute Decision Making adalah satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu\". Pernyataan tersebut merupakan perngertian Profile Matching dari?", "a": "A. Kusumadewi (2006)", "b": "B. Siahaan dan Tharo (2016)", "c": "C. Kusrini (2007)", "d": "D. Mufid (2014)", "e": "", "benar": "A"}, {"soal": "Kelebihan metode SAW adalah sebagai berikut, kecuali?", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "C. Terdapat mekanisme normalisasi matrik keputusan (X), yaitu proses matrik keputusan (X) ke dalam skala yang dapat diperbandingkan dengan semua rating alternatif yang ada  ", "d": "D. Sulit dalam perhitungannya", "e": "", "benar": "D"}, {"soal": "AHP dikembangkan oleh seorang Guru Besar Matematika dari University of Pittsburgh pada tahun 1970 yang bernama?", "a": "A. Prof. Charless Thomas", "b": "B. Dr. William Smith", "c": "C. Prof. Thomas L. Saaty", "d": "D. Prof. Jackob", "e": "", "benar": "C"}, {"soal": "Menurut Saaty, hasil penilaian yang dapat diterima adalah yang mempunyai ratio konsistensi lebih kecil atau sama dengan?", "a": "A. 5%", "b": "B. 10%", "c": "C. 15%", "d": "D. 20%", "e": "", "benar": "B"}, {"soal": "Secara umum, prosedur TOPSIS mengikuti langkah-langkah berikut, kecuali?", "a": "A. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)", "b": "B. Membuat matrik keputusan ternormalisasi (R)", "c": "C. Membuat matrik keputusan ternormalisasi terbobot", "d": "D. Membuat matrik yang tidak ternormalisasi", "e": "", "benar": "D"}, {"soal": "Apa yang dimaksud Gap pada metode Profile Matching?", "a": "A. Hasil perbedaan kompetensi antara profil alternatif dan profil target ", "b": "B. Proses pemberian nilai bobot", "c": "C. Kriteria penilaian yang paling penting di dalam proses pengambilan keputusan", "d": "D. Penentuan urutan ranking alternatif ", "e": "", "benar": "A"}, {"soal": "Apa yang dimaksud Core Factor pada metode Profile Matching?", "a": "A. Penentuan urutan ranking alternatif yang direkomendasikan", "b": "B. Kriteria penilaian yang paling penting di dalam proses pengambilan keputusan", "c": "C. Faktor pendukung pada proses pengambilan keputusan", "d": "D. Hasil perbedaan kompetensi antara profil alternatif dan profil target", "e": "", "benar": "B"}, {"soal": "Apa yang dimaksud Secondary Factor pada metode Profile Matching?", "a": "A. Penentuan urutan ranking alternatif yang direkomendasikan", "b": "B. Kriteria penilaian yang paling penting di dalam proses pengambilan keputusan", "c": "C. Faktor pendukung pada proses pengambilan keputusan", "d": "D. Hasil perbedaan kompetensi antara profil alternatif dan profil target", "e": "", "benar": "C"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel predikator ideal yang harus dipenuhi oleh parameter adalah definisi dari ....", "a": "A. Profile matching", "b": "B. Weighted product", "c": "C. Simple Additive Weighted", "d": "D. Analytical hierarchy process", "e": "", "benar": "A"}, {"soal": "Masalah Multi Attribute Decision Making (MADM) dapat diselesaikan dengan menggunakan metode ....", "a": "A. Profile matching", "b": "B. Weighted product", "c": "C. Simple Additive Weighted", "d": "D. Analytical hierarchy process", "e": "", "benar": "B"}, {"soal": "Konsep yang dilakukan mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut merupakan konsep dasar dari ....", "a": "A. Profile matching", "b": "B. Weighted product", "c": "C. Simple Additive Weighted", "d": "D. Analytical hierarchy process", "e": "", "benar": "C"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria adalah pengertian dari metode ....", "a": "A. Profile matching", "b": "B. Weighted product", "c": "C. Simple Additive Weighted", "d": "D. Analytical hierarchy process", "e": "", "benar": "D"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip di mana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positid, namun juga memliki jarak terpanjang dari solusi ideal negatif adalah metode ....", "a": "A. Technique for order preference by similarity to ideal solution", "b": "B. Weighted product", "c": "C. Profile matching", "d": "D. Simple Additive Weighted", "e": "", "benar": "A"}, {"soal": "Himpunan fuzzy pada representasi linear naik memiliki domain yang terbagi menjadi tiga selang yaitu ....", "a": "A. selang [-∞, 0]", "b": "B. selang [0, a]", "c": "C. selang [a, b]", "d": "D. selang [b, ∞]", "e": "", "benar": "A"}, {"soal": "Berikut merupakan kelebihan metode SAW, kecuali ....", "a": "A. Dapat menentukan nilai bobot untuk masing-masing alternatif", "b": "B. Digunakan pada pembobotan lokal", "c": "C. Penilaian akan lebih tepat", "d": "D. Terdapat mekanisme normalisasi matrik keputusn", "e": "", "benar": "B"}, {"soal": "GAP adalah ...", "a": "A. Kriteria penilaian yang paling penting di dalam proses pengambilan keputusan", "b": "B. Kriteria penilaian yang disebut sebagai faktor pendukung", "c": "C. Hasil perbedaan kompetensi antara profil alternatif dab profil target", "d": "D. Hasil perbedaan dari core factor dengan secondary factor", "e": "", "benar": "C"}, {"soal": "Suatu grup yang mewakili suatu kondisi atau keadaan tertentu dalam suatu variabel fuzzy disebut ....", "a": "A. Nilai keanggotaan", "b": "B. Variabel fuzzy", "c": "C. Semesta pembicaraan", "d": "D. Himpunan fuzzy", "e": "", "benar": "D"}, {"soal": "Metode yang digunakan untuk mendukung keputusan yang dikembangkan okeg Prof. Thomas L. Satay adalah ....", "a": "A. SAW", "b": "B. TOPSIS", "c": "C. Profile Matching", "d": "D. AHP", "e": "", "benar": "D"}, {"soal": "Yang BUKAN merupakan pengertian dari Profile Matching adalah...", "a": "A. Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter ", "b": "B. Mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati", "c": "C. Proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap ", "d": "D. Penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut ", "e": "E. Mekanisme pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "benar": "E"}, {"soal": "Yang BUKAN merupakan tahapan-tahapan di dalam penentuan keputusan menggunakan Profile Matching adalah...", "a": "A. Perhitungan Gap", "b": "B. Pembobotan", "c": "C. Perhitungan nilai total", "d": "D. Menentukan kriteria", "e": "E. Penentuan rangking alternatif", "benar": "D"}, {"soal": "Apa yang dimaksud dengan Weighted Product?", "a": "A. Suatu metode dengan mengambil banyak kriteria sebagai dasar dari pengambilan keputusan yang didalamnya mencakup masalah perancangan (design), dimana teknik teknik matematik untuk optimasi digunakan dan untuk jumlah alternatif yang sangat besar (sampai dengan tak terhingga)", "b": "B. Suatu metode dengan mengambil banyak kriteria sebagai dasar pengambilan keputusan, dengan penilaian yang subjektif menyangkut masalah pemilihan, dimana analisis matematis tidak terlalu banyak dan digunakan untuk pemilihan alternatif dalam jumlah sedikit", "c": "C. Salah satu metode pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "d": "D. Proses membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap ", "e": "E. Proses mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut", "benar": "C"}, {"soal": "Istilah lain untuk metode SAW adalah...", "a": "A. Multi Attribute Decision Making", "b": "B. Metode penjumlahan terbobot ", "c": "C. Metode normalisasi keputusan", "d": "D. Multiple Objective Decision Making", "e": "E. Metode Weighted Product ", "benar": "B"}, {"soal": "Kelebihan dari metode SAW adalah...", "a": "A. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi yang telah ditentukan", "b": "B. Terdapat mediator seperti hirarki sehingga jika diproses secara mandiri maka dalam ketepatan pengambilan keputusan cenderung menghasilkan keputusan yang sempurna", "c": "C. Terdapat variabel Cost dan Benefit, yang berguna untuk menentukan kriteria yang berpengaruh terhadap keputusan", "d": "D. Metode ini dapat digunakan pada proses nilai yang memiliki nilai rentang", "e": "E. Konsep yang sederhana untuk menentukan pembobotan terhadap kriteria yang memiliki nilai hampir sama", "benar": "A"}, {"soal": "Dalam penyelesaian metode Simple Additive Weight (SAW), apa yang harus dilakukan setelah menentukan rating kecocokan setiap alternatif pada setiap kriteria?", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Membuat matriks keputusan berdasarkan kriteria (Ci)", "c": "C. Melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R", "d": "D. Memperoleh hasil akhir", "e": "E. Melakukan perangkingan dan menentukan alternatif", "benar": "B"}, {"soal": "AHP dikembangkan oleh seorang Guru Besar Matematika dari University of Pittsburgh pada tahun 1970, Siapakah nama guru besar itu?", "a": "A. MacCrimmon", "b": "B. Siahaan", "c": "C. Thomas L. Saaty", "d": "D. Tharo", "e": "E. Kusumadewi", "benar": "C"}, {"soal": "Yang BUKAN merupakan prinsip pokok AHP adalah...", "a": "A. Menyusun hirarki", "b": "B. Menentukan prioritas", "c": "C. Menghitung consistency ratio", "d": "D. Menghitung bobot ", "e": "E. Pairwise comparison", "benar": "D"}, {"soal": "Berikut keterangan yang TIDAK TEPAT mengenai topsis adalah...", "a": "A. Merupakan metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak terpanjang dari solusi ideal negatif", "b": "B. Adalah salah satu teknik MCDM (Multi-Criteria Decision Making) yang sangat sederhana dan mudah diimplementasikan", "c": "C. Konsepnya sederhana dan mudah dipahami; komputasinya efisien, dan memiliki kemampuan untuk mengukur kinerja relatif dari alternatif-alternatif keputusan dalam bentuk matematis yang sederhana", "d": "D. Topsis dapat diimplementasikan dalam pengambilan keputusan di beberapa bidang", "e": "E. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi yang telah ditentukan", "benar": "E"}, {"soal": "Secara umum, prosedur topsis yang dilakukan setelah membuat matrik keputusan ternormalisasi adalah...", "a": "A. Menentukan nilai preferensi untuk setiap alternatif", "b": "B. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria", "c": "C. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "d": "D. Membuat matrik keputusan ternormalisasi terbobot", "e": "E. Menentukan jarak antara nilai setiap alternatif dengan matriks solusi ideal positif dan matrik solusi ideal negatif", "benar": "D"}, {"soal": "Multiple Criteria Decision Making (MCDM) dibagi menjadi dua, yaitu ...", "a": "A. Multi Atribute Decision Making dan Multi Objective Decision Making", "b": "B. Multi Objective Decision Making dan Multi Variable Decision Making", "c": "C. Multi Atribute Decision Making dan Multi Support Decision Making", "d": "D. Multi Objective Decision Making dan Multi Markup Decision Making", "e": "E. Multi Atribute Decision Making dan Multi Data Decision Making", "benar": "A"}, {"soal": "Multi Atribute Decision Making (MADM) digunakan untuk ...", "a": "A. Menyelesaiakan permasalahan pada ruang kontinyu ", "b": "B. Penilaian atau seleksi beberapa alternatif dalam jumlah terbatas", "c": "C. Menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "d": "D. Mencari ruang permasalahan dengan jumlah alternatif yang sesuai dengan kriteria", "e": "E. Membantu pemecahan masalah pada suatu ruang lingkup tertentu", "benar": "B"}, {"soal": "Multi Objective Decision Making (MODM) digunakan untuk ...", "a": "A. Menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu", "b": "B. Penilaian atau seleksi beberapa alternatif dalam jumlah terbatas", "c": "C. Menyelesaiakan permasalahan pada ruang kontinyu", "d": "D. Mencari ruang permasalahan dengan jumlah alternatif yang sesuai dengan kriteria", "e": "E. Membantu pemecahan masalah pada suatu ruang lingkup tertentu", "benar": "C"}, {"soal": "TOPSIS dikembangkan oleh ...", "a": "A. Hwang dan Yoon", "b": "B. Yung dan Aus", "c": "C. Hwang dan Yung", "d": "D. Yoon dan Aus", "e": "E. Yung dan Yoon", "benar": "A"}, {"soal": "TOPSIS dikembangkan pada tahun ...", "a": "A. 1982", "b": "B. 1972", "c": "C. 1971", "d": "D. 1981", "e": "E. 1985", "benar": "D"}, {"soal": "Langkah pertama dari metode TOPSIS adalah ...", "a": "A. Membuat matrik keputusan ternormalisasi (R)", "b": "B. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "c": "C. Membuat matrik keputusan ternormalisasi terbobot", "d": "D. Menentukan nilai preferensi untuk setiap alternatif", "e": "E. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria(X)", "benar": "E"}, {"soal": "Langkah terakhir dari metode TOPSIS adalah ...", "a": "A. Menentukan nilai preferensi untuk setiap alternatif", "b": "B. Membuat matrik keputusan ternormalisasi (R)", "c": "C. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "d": "D. Membuat matrik keputusan ternormalisasi terbobot", "e": "E. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap ", "benar": "A"}, {"soal": "Metode profile matching dapat membandingkan antara kompetensi yang dimiliki calon Pengajar dengan kompetensi standar jabatan sehingga diperoleh perbedaan kompetensinya, merupakan pengertian dari ...", "a": "A. GAP", "b": "B. AHP", "c": "C. SAW", "d": "D. SLB", "e": "E. TOPSIS", "benar": "A"}, {"soal": "Metode apa yang sering dikenal dengan istilah penjumlahan berbobot?", "a": "A. SAW", "b": "B. GAP", "c": "C. SPK", "d": "D. SLP", "e": "E. TOPSIS", "benar": "A"}, {"soal": "Metode Weight-Product (WP) adalah ...", "a": "A. salah satu metode pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making (MADM).", "b": "B. Metode pengambilan keputusan yang melibatkan sejumlah ruang lingkup masalah tertentu.", "c": "C. Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait.", "d": "D. Sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif.", "e": "E. Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu.", "benar": "A"}, {"soal": "Proses profile matching bertujuan untuk mengetahui?", "a": "a. perbedaan variabel ideal", "b": "b. gap", "c": "c. value", "d": "d. eksistensi", "e": "e. pasar", "benar": "B"}, {"soal": "Fitur umum yang digunakan dalam Multiple Criteria Decision Making yaitu, kecuali?", "a": "a. alternative", "b": "b. atribut", "c": "c. bobot keputusan", "d": "d. variabel", "e": "e. konflik antar kriteria", "benar": "D"}, {"soal": "Berikut langkah-langkah metode SAW adalah, kecuali?", "a": "a. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "b": "b. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "c": "c. Membuat matriks keputusan berdasarkan kriteria (Ci).", "d": "d. Kemudian melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.", "e": "e. Hasil akhir diperoleh dari proses penjumlahan variabel-variabel kriteria dan  ternormalisasi", "benar": "E"}, {"soal": "Berikut merupakan prosedur TOPSIS, kecuali?", "a": "a. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)", "b": "b. Membuat matrik keputusan ternormalisasi terhitung", "c": "c. Membuat matrik keputusan ternormalisasi terbobot", "d": "d. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "e": "e. Menentukan nilai preferensi untuk setiap alternatif", "benar": "B"}, {"soal": "Berdasarkan tujuannya MCDM dibagi menjadi yaitu:", "a": "a. MADM dan MODM", "b": "b. MADM dan MEDM", "c": "c. MEDM dan MODM", "d": "d. MEDM dan MIDM", "e": "e. MIDM dan MADM", "benar": "A"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target adalah...", "a": "A. Gap", "b": "B. Pembobotan", "c": "C. Alternatif", "d": "D. Core Factor", "e": "", "benar": "A"}, {"soal": "Satu metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu adalah...", "a": "A. WP", "b": "B. Multi Attribute Decision Making ", "c": "C. Metode Weighted Product ", "d": "D. Metode Weighted Prduct ", "e": "", "benar": "B"}, {"soal": "Metode Simple Additive Weighthing disebut juga dengan...", "a": "A. WP", "b": "B. Multi Attribute Decision Making ", "c": "C. Simple Additive Weighthing  ", "d": "D. metode  penjumlahan terbobot ", "e": "", "benar": "D"}, {"soal": "Berikut adalah kelebihan dari metode SAW, kecuali...", "a": "A. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "B. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "C. Terdapat mekanisme normalisasi matrik keputusan  ", "d": "D. metode  penjumlahan terbobot ", "e": "", "benar": "D"}, {"soal": "Berikut adalah langkah dalam penyesuaian metode simple additive Weight, kecuali...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "c": "C. Terdapat mekanisme normalisasi matrik keputusan  ", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci).", "e": "", "benar": "C"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak\nterpanjang dari solusi ideal negatif adalah...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "c": "C. Metode Technique for Order Preference by Similarity to Ideal Solution  ", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci).", "e": "", "benar": "C"}, {"soal": "Salah satu teknik MCDM (Multi-Criteria Decision Making) adalah...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "c": "C. Metode Technique for Order Preference by Similarity to Ideal Solution  ", "d": "D. Membuat matriks keputusan berdasarkan kriteria (Ci).", "e": "", "benar": "C"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter merupakan pengertian profile matching dari", "a": "A. kasrono ", "b": "B. Kusrini", "c": "C. Mufid ", "d": "D. Siahaan dan Tharo", "e": "", "benar": "D"}, {"soal": "Dalam profile matching dilakukan penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut, pendapat tersebut berasal dari", "a": "a. Siahaan dan Tharo ", "b": "b. Kusrini", "c": "c. Mufid ", "d": "d. kasrono", "e": "", "benar": "C"}, {"soal": "Tahapan-tahapan di dalam penentuan keputusan menggunakan Profile Matching adalah sebagai berikut, kecuali...", "a": "a. perhitungan gap", "b": "b. pembobotan", "c": "c. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF)", "d": "d. perhitungan bobot", "e": "", "benar": "D"}, {"soal": "Ada berapa fase pengambilan keputusan dalam system pendukung keputusan?", "a": "A. 4.", "b": "B. 3.", "c": "C. 2.", "d": "D. 1.", "e": "", "benar": "A"}, {"soal": "Yang termasuk dalam fase pengambilan keputusan dalam system pendukung keputusan?", "a": "A. Fase Intelegensi, Fase pemilihan, Fase Analisis", "b": "B. Fase Desain, Fase Analisis, Fase Intelegensi", "c": "C. Fase Implementasi, Fase Desian, Fase Pemilihan", "d": "D. Fase Analisis, Fase Intelegensi, Fase Pemilihan", "e": "", "benar": "C"}, {"soal": "Yang bukan termasuk fase pengambilan keputusan dalam system pendukung keputusan?", "a": "A. Fase Intelegensi", "b": "B. Fase Desain", "c": "C. Fase Pemilihan", "d": "D. Fase Analisis", "e": "", "benar": "D"}, {"soal": "Metode pengambilan keputusan dengan cara perkalian untuk menghubungkan rating atribut adalah?", "a": "A. Metode Weighted Product", "b": "B. Profile Mathching", "c": "C. Metode Simple Additive Weighting", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution", "e": "", "benar": "A"}, {"soal": "Metode pengambilan keputusan dengan konsep dasar mencari penjumlahan terbobot dari rating kinerja pada setiap alternatif pada semua atribut adalah?", "a": "A. Metode Weighted Product", "b": "B. Profile Mathching", "c": "C. Metode Simple Additive Weighting", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution", "e": "", "benar": "C"}, {"soal": "Metode pengambilan keputusan yang memiliki kemampuan untuk mengukur kinerja relative dari alternatif-alternatif keputusan dalam bentuk matematis yang sederhana adalah?", "a": "A. Metode Weighted Product", "b": "B. MCDM", "c": "C. Metode Simple Additive Weighting", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution", "e": "", "benar": "D"}, {"soal": "Metode pengambilan keputusan dengan cara perkalian untuk menghubungkan rating atribut adalah?", "a": "A. Metode Weighted Product", "b": "B. MCDM", "c": "C. Metode Simple Additive Weighting", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution", "e": "", "benar": "A"}, {"soal": "Yang merupakan mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter adalah?", "a": "A. Metode Weighted Product", "b": "B. Profile Mathching", "c": "C. Metode Simple Additive Weighting", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution", "e": "", "benar": "B"}, {"soal": "Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu merupakan metode dari adalah?", "a": "A. Metode Weighted Product", "b": "B. MCDM", "c": "C. Metode Simple Additive Weighting", "d": "D. Metode Technique for Order Preference by Similarity to Ideal Solution", "e": "", "benar": "B"}, {"soal": "Berikut Langkah Langkah dalam penyelesaian metode SAW yang benar, kecuali?", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci.", "b": "B. Kemudian melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.", "c": "C. Hasil akhir diperoleh dari proses penjumlahan dari perkalian matriks  ternormalisasi R dengan vector bobot sehingga diperoleh nilai terbesar yang dipilih sebagai  alternatif terbaik (Ai) sebagi solusi.", "d": "D. Menentukan rating kecocokan setiap alternatif pada setiap kriteria.", "e": "", "benar": "C"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter adalah pengertian dari ...", "a": "A. Profile Matching", "b": "B. Weighted Product", "c": "C. Simple Additive Weighting", "d": "D. Analytical Hierarchy Process", "e": "E. Technique for Order Preference by Similarity to Ideal Solution", "benar": "A"}, {"soal": "Penilaian variabel atau karakteristik terhadap alternatif-alternatif pilihan dengan memberikan skor yang berbeda-beda sesuai karakteristik yang dimiliki oleh masing-masing alternatif tersebut, dilakukan menggunakan metode ...", "a": "A. Profile Matching", "b": "B. Weighted Product", "c": "C. Simple Additive Weighting", "d": "D. Analytical Hierarchy Process", "e": "E. Technique for Order Preference by Similarity to Ideal Solution", "benar": "A"}, {"soal": "Penentuan urutan alternatif pada model Profile Matching berdasarkan tingkat profil alternatif yang paling mendekati profil ideal, Tahapan-tahapan di dalam penentuan keputusan menggunakan Profile Matching adalah sebagai berikut kecuali ...", "a": "A. Perhitungan Gap", "b": "B. Perhitungan Profil Alternatif", "c": "C. Pembobotan", "d": "D. Identifikasi dan Perhitungan nilai Core Factor (CF)", "e": "E. Identifikasi dan Perhitungan nilai Secondary Factor (SF)", "benar": "B"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target disebut ...", "a": "A. Perhitungan Gap", "b": "B. Perhitungan Profil Alternatif", "c": "C. Pembobotan", "d": "D. Identifikasi dan Perhitungan nilai Core Factor (CF)", "e": "E. Identifikasi dan Perhitungan nilai Secondary Factor (SF)", "benar": "A"}, {"soal": "Setiap aspek penilaian dikelompokkan menjadi dua, ... merupakan kriteria penilaian yang paling penting di dalam proses pengambilan keputusan. Sedangkan ... adalah item-item faktor pendukung pada proses pengambilan keputusan. ", "a": "A. NIlai Gap dan Nilai Profil Alternatif", "b": "B. Nilai Profil Alternatif dan Nilai Profil Traget", "c": "C. Core Factor dan Secondary Factor", "d": "D. Nilai Gap dan Core Factor", "e": "E. Nilai Gap dan Secondary Factor", "benar": "C"}, {"soal": "Metode pengambilan keputusan untuk  menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria  tertentu adalah pengertian dari ...", "a": "A. Profile Matching", "b": "B. Weighted Product", "c": "C. Simple Additive Weighting", "d": "D. Analytical Hierarchy Process", "e": "E. Technique for Order Preference by Similarity to Ideal Solution", "benar": "B"}, {"soal": "Ada beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making,  yaitu, Kecuali ...", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Konflik Antar Kriteria", "d": "D. Variabel", "e": "E. Bobot Keputusan", "benar": "D"}, {"soal": "Langkah-langkah penyelesaian masalah menggunakan metode Weighted Product adalah sebagai berikut , Kecuali ...", "a": "A. Penentuan kriteria yang dijadikan dasar dalam penentuan keputusan", "b": "B. Menentukan peringkat kecocokan untuk kriteria", "c": "C. Normalisasi bobot", "d": "D. Menghitung nilai prefensi untuk alternatif sebagai vektor S", "e": "E. Menghitung nilai prefensi relatif sebagai bilangan real", "benar": "E"}, {"soal": "Beberapa langkah dalam penyelesaian metode Simple Additive Weight (SAW) adalah sebagai berikut, Kecuali ...", "a": "A. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "b": "B. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "c": "C. Membuat matriks keputusan berdasarkan kriteria (Ci)", "d": "D. Menghitung nilai prefensi untuk alternatif sebagai vektor R", "e": "E. Melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis atribut  sehingga diperoleh matriks ternormalisasi R", "benar": "D"}, {"soal": "Secara umum, prosedur TOPSIS mengikuti langkah-langkah berikut, Kecuali ...", "a": "A. Membuat matriks keputusan melalui proses penentuan rating kecocokan alternatif terhadap kriteria (X)", "b": "B. Membuat matrik keputusan ternormalisasi (R)", "c": "C. Membuat matriks keputusan berdasarkan kriteria", "d": "D. Membuat matrik keputusan ternormalisasi terbobot", "e": "E. Menentukan matrik solusi ideal positif dan matrik solusi ideal negatif", "benar": "C"}, {"soal": "Metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus dipangkatkan dulu dengan bobot atribut yang bersangkutan. Pengertian tersebut merupakan pengertiandari metode...", "a": "A. Metode Analytical Hierarchy Process", "b": "B. Metode TOPSIS", "c": "C. Metode Profile Matching ", "d": "D. Metode Simple Additive Weighting ", "e": "E. Metode Weighted Product", "benar": "E"}, {"soal": "Dalam kasus pemilihan rumah dengan metode WP, manakah yang termasuk kriteria cost dalam pemilihan rumah?", "a": "A. Ukuran rumah", "b": "B. Luas lahan rumah", "c": "C. Akses air bersih", "d": "D. Lokasi dari pusat kota", "e": "E. Design rumah", "benar": "D"}, {"soal": "Yang menjadi pembeda kriteria benefit dan cost dalam perhitungan menggunakan metode WP adalah?", "a": "A. Pada proses pentotalan", "b": "B. Pada hasil pemangkatan", "c": "C. Pada nilai pangkat", "d": "D. Pada pencarian nilai vektor S", "e": "E. Pada perengkingan akhir", "benar": "C"}, {"soal": "Apa yang dimaksud dengan solusi ideal positif pada metode TOPSIS?", "a": "A. Sebagai besar nilai terbaik untuk setiap atribut.", "b": "B. Sebagai besar nilai terburuk untuk setiap atribut.", "c": "C. Sebagai besar jumlah nilai terburuk dari seluruh atribut.", "d": "D. Sebagai besar jumlah nilai terbaik dari seluruh atribut.", "e": "E. Besar jumlah nilai - nilai dari atribut yang memiliki nilai terbesar.", "benar": "A"}, {"soal": "Apa kepanjangan dari MCDM?", "a": "A. Multiple Criteria Decision Making", "b": "B. Multiple Criteria Discution Making", "c": "C. Multiple Character Discution Making", "d": "D. Multiple Character Decision Making", "e": "E. Multi Criteria Decision Making", "benar": "A"}, {"soal": "Langkah awal dalam metode Weighted Product adalah?", "a": "A. Menentukan nilai skala dari setiap kriteria", "b": "B. Memasukkan data alternatif  ", "c": "C. Menentukan kriteria dan nilai bobot ", "d": "D. Merubah nilai kriteria alternatif", "e": "E. Membuat matriks keputusan dengan  membuat peringkat kecocokan pada  setiap kriteria", "benar": "C"}, {"soal": "Pada metode Weight Product yang menjadi nilai rangking adalah?", "a": "A. Nilai kriteria", "b": "B. Nilai vektor V", "c": "C. Nilai vektor Si", "d": "D. Nilai bobot", "e": "E. Hasil pemangkatan matriks", "benar": "B"}, {"soal": "Apa yang menjadi konsep dasar metode Simple Additive Weighthing", "a": "A. Menemukan nilai bobot untuk masing-masing alternatif ", "b": "B. Mencari bobot preferensi  yang telah ditentukan", "c": "C. Membandingkan semua rating alternatif", "d": "D. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "e": "E. Mencari penjumlahan  terbobot dari rating kinerja pada setiap alternatif pada semua atribut ", "benar": "E"}, {"soal": "Langkah awal dalam metode Simple Additive Weighthing adalah?", "a": "A. Melakukan normalisasi matriks", "b": "B. Membuat matriks keputusan berdasarkan kriteria ", "c": "C. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "d": "D. Menentukan kriteria-kriteria yang dijadikan acuan dalam pendukung keputusan yaitu Ci", "e": "E. Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary Factor (SF)", "benar": "D"}, {"soal": "Apa yang menjadi tahapan awal pada perhitungan menggunakan metode Profile Matching", "a": "A. Perhitungan Gap", "b": "B. Penentuan bobot", "c": "C. Identifikasi dan perhitungan Secondary Factor (SF)", "d": "D. Identifikasi dan perhitungan nilai Core Factor (CF)", "e": "E. Melakukan normalisasi matriks", "benar": "A"}, {"soal": "kriteria penilaian paling penting dalam proses pengambilan keputusan dalam Profile matching adalah", "a": "a. Core Factor", "b": "b. OctaCore Factor", "c": "c. Secondary Factor", "d": "d. First Factor", "e": "", "benar": "A"}, {"soal": "aspek lain yang ada pada kriteria penilaian paling penting dalam proses pengambilan keputusan dalam Profile matching adalah pengertian dari", "a": "a. Support Factor", "b": "b. Aspek Kepentingan", "c": "c. Secondary Factor", "d": "d. Core Factor", "e": "", "benar": "C"}, {"soal": "Yang bukan merupakan fitur umum yang digunakan dalam Multiple Criteria Decision Making.", "a": "a. bobot keputusan", "b": "b. matriks", "c": "c. atribut", "d": "d. pengguna", "e": "", "benar": "D"}, {"soal": "metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan merupakan pengertian dari ", "a": "a. Profile Matching", "b": "b. Weighted Product", "c": "c. Support Vector Machines", "d": "d. RestNet", "e": "", "benar": "B"}, {"soal": "Metode yang sering dikenal sebagai metode penjumlahan terbobot menurut kusumadewi adalah metode...", "a": "a. Regresi Logistik", "b": "b. Random Forest", "c": "c. Simple Additive Weighting", "d": "d. Decision Tree", "e": "", "benar": "C"}, {"soal": "Yang bukan merupakan salah satu langkah penyelesaian metode Simple Additive Weighting adalah ...", "a": "a. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "b": "b. Membuat matriks keputusan berdasarkan kriteria (Ci).", "c": "c. Menentukan besaran learning rate algoritma", "d": "d. Kemudian melakukan normalisasi matriks berdasarkan persamaan yang disesuaikan dengan jenis\natribut (atribut keuntungan maupun atribut biaya) sehingga diperoleh matriks ternormalisasi R.", "e": "", "benar": "C"}, {"soal": "Kepanjangan dari metode TOPSIS adalah ...", "a": "a. Technique for Order Preference by Similarity to Ideal Solution", "b": "b. Technique for Order Preference by Similarity to Ideal Simulation", "c": "c. Technique for Order Preference by Similarity to Inverted Solution", "d": "d. Technique for Order Preference by Success to Ideal Solution", "e": "", "benar": "A"}, {"soal": "Yang bukan merupakan kelebihan dari TOPSIS adalah ...", "a": "a. Konsep Sederhana", "b": "b. Komputasi Efisien", "c": "c. Pembuatan pohon keputusan yang cepat dan efisien", "d": "d. kemampuan untuk mengukur kinerja relatif dari alternatif-alternatif keputusan dalam\nbentuk matematis yang sederhana", "e": "", "benar": "C"}, {"soal": "Berdasarkan tujuannya, MCDM dibagi menjadi MADM dan MODM, MADM merupakan singkatan dari ...", "a": "a. Multi Analysis Decision Making ", "b": "b. Multiple Analysis Decision Maker ", "c": "c. Multiple Alternative Decision Making ", "d": "d. Multi Atribute Decision Making ", "e": "", "benar": "D"}, {"soal": "Yang bukan metode penyelesaian masalah MAD adalah ...", "a": "a. TOPSIS", "b": "b. CNN", "c": "c. SAW", "d": "d. AHP", "e": "", "benar": "B"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter adalah", "a": "A. Profile Matching", "b": "B. Multiple Criteria Desicion Making", "c": "C. Weighted Product", "d": "D. MADM", "e": "E. Perhitungan Gap", "benar": "A"}, {"soal": "Dalam Profile Matching, perhitungan nilai total menetapkan presentase yang dimasukkan untuk core factor ... dan secondary factor...", "a": "A. 80%, 20%", "b": "B. 70%, 30%", "c": "C. 60%, 40%", "d": "D. 50%, 50%", "e": "E. 40%, 60%", "benar": "C"}, {"soal": "Dalam metode Weighted, nilai preferensi relatif yang akan digunakan untuk mencari peringkat dari hasil perhitungan setiap alternative dilambankan dengan", "a": "A. Xij", "b": "B. Vi", "c": "C. Wj", "d": "D. Ci", "e": "E. Ai", "benar": "B"}, {"soal": "Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu adalah", "a": "A. Weighted Product", "b": "B. Multi Atribute Decision Making", "c": "C. Multi Criteria Decision Making", "d": "D. TOPSIS", "e": "E. Simple Additive Weighthing", "benar": "B"}, {"soal": "Metode simple additive weigthing sering juga dikenal dengan istilah ...", "a": "A. Pembagian bobot rata rata", "b": "B. Penjumlahan terbobot", "c": "C. MADM", "d": "D. Normalisasi matriks", "e": "E. Vektor V", "benar": "B"}, {"soal": "Dalam perhitungan SAW, perhitungan nilai preferensi dari setiap alternatif merupakan ... hasil perkalian bobot preferensi dengan setiap atribut matriks ternormalisasi", "a": "A. Rata Rata", "b": "B. Pembagian", "c": "C. Modulo", "d": "D. Perkalian", "e": "E. Penjumlahan", "benar": "E"}, {"soal": "Analytical Hierarchy Process dikembangkan oleh", "a": "A. MacCrimmon", "b": "B. Frieyadie", "c": "C. Sri Kusumadewi", "d": "D. Thomas L. Saaty", "e": "E. Limbing", "benar": "D"}, {"soal": "Dalam AHP, suatu matriks perbandingan dianggap konsisten jika nilai CR", "a": "A. tidak lebih dari 10%", "b": "B. tidak lebih dari 5%", "c": "C. lebih dari sama dengan 70%", "d": "D. lebih dari 80%", "e": "E. kurang dari 15%", "benar": "A"}, {"soal": "Pemilihan alternatif yang terbaik tidak hanya memiliki jarak terpendek dari solusi ideal positif (A+), namun juga memiliki jarak terpanjang dari solusi ideal negative (A-) adalah konsep dari", "a": "A. AHP", "b": "B. SAW", "c": "C. WP", "d": "D. TOPSIS", "e": "E. MCDM", "benar": "D"}, {"soal": "Suatu grup yang mewakili suatu kondisi atau keadaan tertentu dalam suatu variabel fuzzy disebut juga", "a": "A. Variabel Fuzzy", "b": "B. Aturan Fuzzy", "c": "C. Himpunan Fuzzy", "d": "D. Defuzzyfikasi", "e": "E. Semesta Fuzzy", "benar": "C"}, {"soal": "Berikut yang bukan merupakan salah satu algoritma sistem pendukung keputusan adalah …", "a": "a. WP", "b": "b. SAW", "c": "c. Profile Clustering", "d": "d. AHP", "e": "", "benar": "C"}, {"soal": "Mekanisme pengambilan keputusan dengan asumsi terdapat variable predictor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati merupakan gambaran dari algoritma …", "a": "a. Profile Matching", "b": "b. Profile Clustering", "c": "c. TOPSIS", "d": "d. WP", "e": "", "benar": "A"}, {"soal": "Perhatikan langkah-langkah berikut :\\n1) Perhitungan gap\\n2) Pembobotan\\n3) Identifikasi dan perhitungan nilai core factor (CF) dan secondary factor (SF)\\n4) Perhitungan nilai total\\n5) Penentuan ranking alternatif\\nPenjelasan di atas merupakan Langkah-langkah dalam algoritma …", "a": "a. TOPSIS", "b": "b. SAW", "c": "c. Profile Matching", "d": "d. AHP", "e": "", "benar": "C"}, {"soal": "Dalam algoritma Profile Matching, item-item selain aspek yang ada pada core factor atau bisa juga disebut sebagai faktor pendukung pada proses pengambilan keputusan disebut …", "a": "a. Core factor", "b": "b. Secondary factor", "c": "c. Additional factor", "d": "d. Support factor", "e": "", "benar": "B"}, {"soal": "WP merupakan singkatan dari …", "a": "a. Weighted Product", "b": "b. Weight Product", "c": "c. Weighted Production", "d": "d. Weight Production", "e": "", "benar": "A"}, {"soal": "Fitur umum yang akan digunakan dalam Multiple Criteria Decision Making adalah sebagai berikut, kecuali …", "a": "a. Alternative", "b": "b. Atribut", "c": "c. Bobot keputusan", "d": "d. Core factor", "e": "", "benar": "D"}, {"soal": "Salah satu kelebihan algoritma SAW adalah …", "a": "a. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi yang telah ditentukan", "b": "b. Tidak dapat menentukan bobot untuk masing-masing alternatif", "c": "c. Tidak terdapat mekanisme normalisasi matriks keputusan", "d": "d. Penilaian yang diberikan memiliki akurasi yang sempurna", "e": "", "benar": "A"}, {"soal": "Metode penjumlahan terbobot disebut juga dengan metode …", "a": "a. SAW", "b": "b. TOPSIS", "c": "c. AHP", "d": "d. Matching Profile", "e": "", "benar": "A"}, {"soal": "Metode AHP dikembangkan oleh …", "a": "a. Naïve Bayes", "b": "b. Prof. Freddy Krueger", "c": "c. Prof. Thomas L. Saaty", "d": "d. Prof. Thomas Shelby", "e": "", "benar": "C"}, {"soal": "Yang bukan merupakan tahapan dalam proses MADM adalah …", "a": "a. Analisis", "b": "b. Sintesis", "c": "c. Ekstraksi", "d": "d. Penyusunan komponen-komponen situasi", "e": "", "benar": "C"}, {"soal": "Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM)", "a": "a. WP", "b": "b. WD", "c": "c. WS", "d": "d. WR", "e": "e. WK", "benar": "A"}, {"soal": "Beberapa fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making, kecuali", "a": "a. alternative", "b": "b. atribut", "c": "c. konflik antar kriteria", "d": "d. bobot hidup", "e": "e. matriks  keputusan", "benar": "D"}, {"soal": "Metode Simple Additive Weighthing (SAW) sering juga dikenal dengan istilah metode  ", "a": "a. penjumlahan terbobot", "b": "b. pembagian terbobot", "c": "c. pengurangan terbobot", "d": "d. perkalian terbobot", "e": "e. persilangan terbobot", "benar": "A"}, {"soal": "AHP dikembangkan oleh", "a": "a. Prof. Bariq", "b": "b. Prof. Thomas L", "c": "c. Prof. Shodiq", "d": "d. Prof. Ade", "e": "e. Prof. Suwarto", "benar": "B"}, {"soal": "Kepanjangan dari AHP adalah", "a": "a. Analitycal Hierarchy Process", "b": "b. Analytical Hirarki Process", "c": "c. Analytical Hierarchy Process", "d": "d. Analitical Hierarki Proses", "e": "e. Analytical HirarkiProcess", "benar": "C"}, {"soal": "AHP dikembangkan pada tahun berapa", "a": "a. 1967", "b": "b. 1968", "c": "c. 1969", "d": "d. 1970", "e": "e. 1971", "benar": "D"}, {"soal": "salah satu teknik MCDM (Multi-Criteria Decision Making) yang sangat sederhana dan mudah diimplementasikan adalah", "a": "a. TOPSIS", "b": "b. TOPLES", "c": "c. TOPKIS", "d": "d. TOPPIES", "e": "e. TOPYES", "benar": "A"}, {"soal": "Metode untuk penyelesaian masalah MADM, Kecuali", "a": "a. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS)", "b": "b. Analytical Hierarchy Process (AHP)", "c": "c. Simple Additive Weighting (SAW)", "d": "d. Weighted Product (WP)", "e": "e. Simple", "benar": "E"}, {"soal": "Technique for Order Preference by Similarity to Ideal Solution dapat di singkat", "a": "a. TOPIS", "b": "b. TOSPS", "c": "c. TOPSIS", "d": "d. TOPES", "e": "e. TOPPS", "benar": "C"}, {"soal": "Hasil akhir nilai preferensi (Vi) yang diperoleh dari penjumlahan  dari perkalian elemen baris matriks ternormalisasi (R) dengan bobot preferensi (W) yang bersesuaian dengan  elemen kolom matriks (W) adalah", "a": "a. Proses Perangkingan", "b": "b. Proses Akhir", "c": "c. Proses", "d": "d. Proses Hitung", "e": "e. Proses Awal", "benar": "A"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter merupakan pengertian Profil Matching menurut...", "a": "A. Siahaan dan Tharo", "b": "B. Kusrini ", "c": "C. Mufid", "d": "D. Susi Setia", "e": "", "benar": "A"}, {"soal": "Yang bukan merupakan proses SPK pada metode Profile Matching adalah...", "a": "A. Perhitungan GAP", "b": "B. Pembobotan", "c": "C. Perhitungan nilai total", "d": "D. Fuzzyfikasi", "e": "", "benar": "D"}, {"soal": "Yang bukan termasuk fitur yang digunakan dalam Multiple Criteria Desicion Making yaitu...", "a": "A. Atribut", "b": "B. Bobot Keputusan", "c": "C. Alternatif", "d": "D. Akuisisi Data", "e": "", "benar": "D"}, {"soal": "MADM merupakan singkatan dari...", "a": "A. Multiverse Attribute Decision Making", "b": "B. Multi Attribute Decision Making", "c": "C. Multi Attribute Decision Maker", "d": "D. Multinational Attribute Decision Making", "e": "", "benar": "B"}, {"soal": "MCDM merupakan singkatan dari...", "a": "A. Multi Criteria Decision Making", "b": "B. Multinational Criteria Decision Making", "c": "C. Multiverse Criteria Decision Making", "d": "D. Multi Criteria Decision Maker", "e": "", "benar": "A"}, {"soal": "TOPSIS merupakan singkatan dari...", "a": "A. Technique for Order Pre-order by Similarity to Ideal Solution", "b": "B. Technique for Order Preference by Similarity to Inovation Solution", "c": "C. Technique for Order Preference by Similarity to Ideal Solution", "d": "D. Technique for Order Preference by Simply to Ideal Solution", "e": "", "benar": "C"}, {"soal": "Tahap awal pada model TOPSIS adalah...", "a": "A. Normalisasi matriks keputusan", "b": "B. Denormalisasi matriks keputusan", "c": "C. Normalisasi profile matching", "d": "D. Denormalisasi profile matching", "e": "", "benar": "C"}, {"soal": "Berdasarkan tujuannya, MCDM terbagi menjadi 2 yaitu...", "a": "A. MADM dan MODM", "b": "B. MADM dan MCDM", "c": "C. MCDM dan MODM", "d": "D. MADM dan MCDM", "e": "", "benar": "A"}, {"soal": "Untuk menyelesaikan permaslahan pada ruang kontinyu dapat menggunakan...", "a": "A. MADM", "b": "B. MODM", "c": "C. MCDM", "d": "D. TOPSIS", "e": "", "benar": "B"}, {"soal": "Berikut merupakan tahapan dalam MADM, kecuali...", "a": "A. Sintesis", "b": "B. Analisis", "c": "C. Penyusunan komponen-komponen situasi", "d": "D. Praproses", "e": "", "benar": "D"}, {"soal": "(i)   Penentuan ranking alternatif\\n(ii)  Perhitungan gap\\n(iii) Identifikasi dan perhitungan nilai Core Factor (CF) dan Secondary\\n(iv)  Perhitungan nilai total\\n(v)   Pembobotan\\nUrutan tahapan dalam penentuan keputusan dengan metode profile matching yang benar adalah ...", "a": "A. (i) (ii) (iii) (iv) (v)", "b": "B. (ii) (v) (iii) (iv) (i)", "c": "C. (ii) (i) (iv) (iii) (v)", "d": "D. (ii) (v) (iii) (iv) (i)", "e": "E. (ii) (v) (iii) (iv) (i)", "benar": "B"}, {"soal": "Sebuah mekanisme pengambilan keputusan dengan mengasumsikan bahwa terdapat tingkat variabel prediktor yang ideal yang harus dipenuhi oleh subyek yang diteliti, bukannya tingkat minimal yang harus dipenuhi atau dilewati adalah profile matching menurut ...", "a": "A. Siahaan dan Tharo", "b": "B. Kusrini", "c": "C. Mufid", "d": "D. Sunarti", "e": "E. Sundari", "benar": "B"}, {"soal": "Tahap pertama dari penyelesaian masalah menggunakan metode Weighted Product adalah ..", "a": "A. menentukan kriteria yang dijadikan dasar dalam penentuan keputusan", "b": "B. menentukan peringkat kecocokan untuk kriteria", "c": "C. normalisasi bobot", "d": "D. menghitung nilai preferensi untuk alternatif", "e": "E. menghitung nilai preferensi relatif", "benar": "A"}, {"soal": "Nama lain dari metode Simple Additive Weighting adalah ...", "a": "A. pencocokan profil", "b": "B. pendukung keputusan", "c": "C. penilaian bobot", "d": "D. pembobotan terjumlah", "e": "E. penjumlahan terbobot", "benar": "E"}, {"soal": "Metode Analytical Hierarchy Process dikembangkan oleh ...", "a": "A. Harold William Kuhn", "b": "B. George Bernard Dantzig", "c": "C. Carl Einar Hille", "d": "D. Thomas L. Saaty", "e": "E. John von Neumann", "benar": "D"}, {"soal": "Di bawah ini yang bukan merupakan kelebihan metode TOPSIS adalah ...", "a": "A. konsepnya sederhana", "b": "B. dapat menemukan nilai bobot untuk masing-masing alternatif", "c": "C. komputasinya efisien", "d": "D. memiliki kemampuan untuk mengukur kinerja relatif dalam bentuk matematis yang sederhana", "e": "E. mudah dipahami", "benar": "B"}, {"soal": "TOPSIS dapat diimplementasikan dalam pengambilan keputusan di berbagai bidang, antara lain ...", "a": "A. pemilihan pegawai terbaik", "b": "B. pemilihan kontraktor bangunan yang tepat", "c": "C. pemilihan supplier", "d": "D. penentuan fasilitas kesehatan", "e": "E. semua benar", "benar": "E"}, {"soal": "Dalam metode TOPSIS, proses untuk menghitung nilai semua rating alternatif ke suatu skala yang dapat diperbandingkan yaitu ...", "a": "A. pembobotan matriks keputusan ternormalisasi", "b": "B. normalisasi matriks keputusan", "c": "C. pembuatan matriks keputusan", "d": "D. penentuan rating kecocokan alternatif terhadap kriteria", "e": "E. penentuan nilai preferensi tiap alternatif", "benar": "B"}, {"soal": "Metode pengambilan keputusan yang melibatkan sejumlah kriteria dan alternatif yang dipilih berdasarkan pertimbangan semua kriteria terkait adalah ...", "a": "A. Classification", "b": "B. Clustering", "c": "C. Analytical Hierarchy Process", "d": "D. Weighted Product", "e": "E. Simple Additive Weighting", "benar": "C"}, {"soal": "Hasil penilaian yang dapat diterima menurut Saaty yaitu hasil yang memiliki ratio konsistensi lebih kecil atau sama dengan ...", "a": "A. 70%", "b": "B. 55%", "c": "C. 40%", "d": "D. 25%", "e": "E. 10%", "benar": "E"}, {"soal": "Proses yang membandingkan kompetensi individu dengan variabel ideal untuk mengetahui perbedaan kompetensinya atau gap termasuk ke dalam proses?", "a": "A. Pembobotan", "b": "B. Pengidentifikasian", "c": "C. Weighted Product", "d": "D. Perhitungan WP", "e": "E. Profile matching", "benar": "E"}, {"soal": "Berikut yang bukan termasuk dalam tahapan penentuan keputusan menggunakan profile matching adalah?", "a": "A. Perhitungan WP", "b": "B. Pembobotan Gap", "c": "C. Identifikasi dan perhitungan nilai Core Factor dan Secondary Factor", "d": "D. Perhitungan nilai total", "e": "E. Penentuan ranking alternatif", "benar": "A"}, {"soal": "Berikut yang tidak termasuk fitur umum yang akan digunakan dalam Multi Attribute Decision Making (MADM)?", "a": "A. Alternative", "b": "B. Perhitungan Gap", "c": "C. Atribut", "d": "D. Konflik antar kriteria", "e": "E. Bobot & matrix keputusan ", "benar": "B"}, {"soal": "Suatu metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu merupakan definisi dari?", "a": "A. Multi Attribute Decision Making (MADM) ", "b": "B. Metode SAW", "c": "C. Perankingan", "d": "D. TOPSIS", "e": "E. Multi Criteria Decision Making (MCDM)", "benar": "A"}, {"soal": "Suatu metode yang sering dikenal dengan istilah metode penjumlahan terbobot adalah metode?", "a": "A. RAD", "b": "B. Weighted Product", "c": "C. SAW", "d": "D. MADM", "e": "E. MCDM", "benar": "C"}, {"soal": "Berikut yang bukan prinsip pokok dari AHP?", "a": "A. Menentukan model keputusan", "b": "B. Menyusun hirarki", "c": "C. Menentukan metode", "d": "D. Menentukan prioritas", "e": "E. Menghitung rasio konsistensi ", "benar": "C"}, {"soal": "Profile matching adalah sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif, bukan tingkat minimal yang harus dipenuhi atau dilewati . Berikut merupakan pengertian profile matching menurut ?", "a": "A.Muamanah 2010", "b": "B. Sumrini 2006", "c": "C. Kusrini 2007", "d": "", "e": "", "benar": "C"}, {"soal": "Apa yang dimaksud dengan GAP?", "a": "A.Hasil perbedaan kompetensi antara profil alternatif dan profil target", "b": "B.Hasil perbedaan antara profil alternatif dengan profil pencapaian", "c": "C.Hasil perbedaan antara jumlah total profil alternatif", "d": "D.Hasil penjumlahan profil target dengan profil alternatif", "e": "", "benar": "A"}, {"soal": "Rumus perhitungan GAP yang benar yaitu?", "a": "A.Nilai Profil Alternatif - Nilai Profil Target", "b": "B.Nilai Profil Target - Nilai Profil Alternatif", "c": "C.Nilai Pencapaian + Nilai Profil Alternatif", "d": "D.Nilai Profil Target + Nilai Profil Alternatif", "e": "", "benar": "A"}, {"soal": "Salah satu metode pengambilan keputusan  untuk menyelesaikan masalah Multi Attribute Decision Making (MADM) kecuali", "a": "A.Metode Profile Matching", "b": "B.Metode Weigted Product", "c": "C.Metode AHP", "d": "D.Metode Regresi Linier", "e": "", "benar": "D"}, {"soal": "Berikut merupakan fitur umum yang digunakan dalam  Multiple Criteria Desicion Making, kecuali ?", "a": "A.Alternative", "b": "B.Atribut", "c": "C.Bobot Keputusan", "d": "D.Bobot Penilaian", "e": "", "benar": "D"}, {"soal": "Pada metode AHP, menurut saaty hasil penilaian yang dapat diterima adalah yang mempunyai ratio konsistensi lebih kecil atau sama dengan", "a": "A.15%", "b": "B.10%", "c": "C.20%", "d": "D.5%", "e": "", "benar": "B"}, {"soal": "Dibawah ini yang merupakan kelebihan metode SAW yaitu", "a": "A.Struktur yang berhierarki merupakan konsekuensi dari kriteria yang dipilih sampai pada subkriteria paling dalam", "b": "B.Dapat menemukan nilai bobot untuk masing-masing alternatif", "c": "C.Tidak terdapat mekanisme normalisasi matrik keputusan (X)", "d": "D. Memecahkan masalah melewati pendekatan secara deduktif yang cukup kompleks", "e": "", "benar": "B"}, {"soal": "Metode yang sering dikenal dengan sebutan  metode  penjumlahan terbobot yaitu", "a": "A.Metode Weigted Product", "b": "B.Metode AHP", "c": "C.Metode Simple Additive Weighthing (SAW)", "d": "D.Metode Profile matching ", "e": "", "benar": "C"}, {"soal": "Proses MADM dilakukan dalam 3 tahap kecuali", "a": "A.Sintesis", "b": "B.Penyusunan komponen-komponen situasi", "c": "C.Pengumpulan Data", "d": "D.Analisis", "e": "", "benar": "C"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif, namun juga memiliki jarak  terpanjang dari solusi ideal negatif merupakan metode Metode Weigted Product", "a": "A.Metode AHP", "b": "B.Metode Simple Additive Weighthing (SAW)", "c": "C.Metode Profile matching ", "d": "D.Metode TOPSIS", "e": "", "benar": "D"}, {"soal": "Perhitungan nilai total mempertimbangkan tiap-tiap aspek yang diperkirakan berpengaruh pada kinerja tiap-tiap profil melalui nilai presentase dari....", "a": "A. Primary factor dan Secondary factor", "b": "B. Internal factor dan External factor", "c": "C. Core factor dan Secondary factor", "d": "D. Core factor dan Primary factor", "e": "E. Core factor dan External factor", "benar": "C"}, {"soal": "Hasil perbedaan kompetensi antara profil alternatif dan profil target adalah.....", "a": "A. Pembobotan", "b": "B. Gap", "c": "C. Tingkatan", "d": "D. Core Factor", "e": "E. Secondary Factor", "benar": "B"}, {"soal": "Ada beberapa fitur umum yang akan digunakan dalam Multiple Criteria Decision Making, kecuali.....", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Konflik antar kriteria", "d": "D. Bobot keputusan", "e": "E. Gap", "benar": "E"}, {"soal": "Berikut ini prinsip pokok AHP yang benar adalah.....", "a": "A. Menyusun hirarki, Menentukan prioritas, Menghitung Consistency Ratio", "b": "B. Menyusun hirarki, Menentukan prioritas, Menghitung nilai preferensi", "c": "C. Menyusun hirarki, Menentukan bobot, Menghitung Consistency Ratio", "d": "D. Menyusun kriteria, Menentukan prioritas, Menghitung Consistency Ratio", "e": "E. enyusun kriteria, Menentukan bobot, Menghitung nilai preferensi", "benar": "A"}, {"soal": "Berikut ini adalah kelebihan dari TOPSIS, kecuali....", "a": "A. Konsepnya sederhana", "b": "B. Mudah diimplementasikan", "c": "C. Komputasinya efisien", "d": "D. Mudah dipahami", "e": "E. Bentuk matematis yang kompleks", "benar": "E"}, {"soal": "Berapa proses yang dilakukan pada MADM?", "a": "A. 4", "b": "B. 5", "c": "C. 2", "d": "D. 3", "e": "E. Tidak ada", "benar": "D"}, {"soal": "Berikut ini adalah salah satu proses MADM yang benar adalah....", "a": "A. Pembobotan", "b": "B. Penyesuaian", "c": "C. Sintesis", "d": "D. Matriks keputusan", "e": "E. Kriteria", "benar": "C"}, {"soal": "Menentukan nilai preferensi untuk setiap alternatif merupakan salah satu prosedur TOPSIS. Pernyataan tersebut adalah.....", "a": "A. Benar", "b": "B. Salah", "c": "", "d": "", "e": "", "benar": "A"}, {"soal": "Berikut ini yang tidak termasuk dalam langkah-langkah metode AHP adalah.....", "a": "A. Menghitung CR", "b": "B. Mengidentifikasi Masalah", "c": "C. Membuat matriks perbandingan berpasangan", "d": "D. Melakukan Perbandingan Berpasangan", "e": "E. Menghitung Normalisasi Bobot", "benar": "E"}, {"soal": "TOPSIS dikembangkan oleh.....", "a": "A. Hwang dan Yoon", "b": "B. Siahaan dan Tharo", "c": "C. Hamka dan Harjono", "d": "D. Eliyen dan Efendi", "e": "E. Thomas dan Saaty", "benar": "A"}, {"soal": "mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter adalah pengertian dari metode ...", "a": "a. Weight Product", "b": "b. SAW", "c": "c. Profile Matching", "d": "d. AHP", "e": "", "benar": "C"}, {"soal": "Rumus Perhitungan GAP pada tahapan awal menggunakan metode Profile Matching ...", "a": "a. Gap = Nilai Profile Alternatif - Nilai Profil Target", "b": "b. Gap = Nilai Profil Target - Nilai Profile Alternatif", "c": "c. Gap = Nilai Profile Acuan - Nilai Profil Target", "d": "d. Gap = Nilai Profile Target - Nilai Profil Acuan", "e": "", "benar": "A"}, {"soal": "Salah satu pengambilan keputusan untuk menyelesaikan masalah Multi Attribute Decision Making adalah metode ....", "a": "a. Weight Product", "b": "b. SAW", "c": "c. Profile Matching", "d": "d. AHP", "e": "", "benar": "A"}, {"soal": "Langkah kedua pada tahapan weight product yaitu ....", "a": "a. penentuan kriteria sebagai dasar penentuan keputusan", "b": "b. penentuan peringkat kecocokan untuk kriteria", "c": "c. normalisasi bobot", "d": "d. perhitungan nilai preferensi", "e": "", "benar": "B"}, {"soal": "Yang bukan kelebihan dari metode SAW ...", "a": "a. Dapat menentukan nilai bobot masing-masing alternatif", "b": "b. Penilaian lebih tepat", "c": "c. Memiliki mekanisme normalisasi matriks keputusan", "d": "d. Memiliki normalisasi matriks alternatif", "e": "", "benar": "D"}, {"soal": "Bobot preferensi pada metode SAW ditentukan oleh ...", "a": "a. Pakar", "b": "b. Individu yang menghitung", "c": "c. Studi kasus", "d": "d. rumus", "e": "", "benar": "A"}, {"soal": "Yang bukan prinsip pokok AHP ...", "a": "a. susun hirarki", "b": "b. menentukan prioritas", "c": "c. menghitung consistency ratio", "d": "d. menghitung eigenvalue", "e": "", "benar": "D"}, {"soal": "langkah terakhir perhitungan dengan metode AHP ...", "a": "a. lakukan perbandingan berpasangan", "b": "b. membuat matriks perbandingan", "c": "c. menghitung vektor eigen", "d": "d. menghitung CR", "e": "", "benar": "D"}, {"soal": "Setelah tahapan penentuan jarak antara nilai tiap alternatid dengan matriks solusi ideal positif dan negatif adalah ....", "a": "a. membuat matriks keputusan ternormalisasi", "b": "b. menentukan nilai preferensi tiap alternatif", "c": "c. membuat matriks keputusan ternormalisasi terbobot", "d": "d. melakukan perankingan", "e": "", "benar": "B"}, {"soal": "Metode pengambilan keputusan yang didasarkan pada prinsip dimana alternatif terpilih tidak hanya memiliki jarak terpendek dari solusi ideal positif namun juga memiliki jarak terpanjang dari solusi ideal negatif adalah ...", "a": "a. Weight Product", "b": "b. SAW", "c": "c. TOPSIS", "d": "d. AHP", "e": "", "benar": "C"}, {"soal": "“Profile matching adalah sebuah mekanisme pengambilan keputusan dengan asumsi terdapat variabel prediktor ideal yang harus dimiliki oleh alternatif” merupakan pernyataan menurut…", "a": "A. Kusrini", "b": "B. Siahaan dan Taro", "c": "C. Mufid", "d": "D. R.A Kartini", "e": "", "benar": "A"}, {"soal": "Berikut ini yang merupakan rumus perhitungan gap adalah…", "a": "a. Nilai target – nilai profil", "b": "b. Nilai tengah – nilai median", "c": "c. Nilai profil alternatif – nilai profil target", "d": "d. Nilai max – nilai rata – rata", "e": "", "benar": "B"}, {"soal": "“Multi Attribute Decision Making adalah satu metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu” merupakan pernyataan menurut…", "a": "a. Kursini", "b": "b. Kusumadewi", "c": "c. Kurniawan", "d": "d. Thomas", "e": "", "benar": "B"}, {"soal": "1) alternative\\n2) atribut\\n3) konflik antar kriteria\\n4) bobot keputusan\\n5) matriks keputusan\\nUrutan diatas merupakan sebuah fitur umum dari…", "a": "a. SAW", "b": "b. Multiple Criteria Decision Thinking", "c": "c. Multiple Criteria Decision Making", "d": "d. Multiple Attribute Decision Making (MADM)", "e": "", "benar": "C"}, {"soal": "Rumus diatas merupakan persamaan untuk menentukan…", "a": "a. Normalisasi keuangan", "b": "b. Menghitung Alternatif vektor W", "c": "c. Normalisasi bobot", "d": "d. Menentukan Kriteria", "e": "", "benar": "C"}, {"soal": "“Metode pengambilan keputusan untuk menetapkan alternatif terbaik dari sejumlah alternatif berdasarkan beberapa kriteria tertentu” merupakan pengertian dari...", "a": "A. Multi Attribute Decision Making ", "b": "B. Multiple Criteria Desicion Making", "c": "C. Simple Additive Weighthing", "d": "D. Analytical Hierarchy Process", "e": "", "benar": "A"}, {"soal": "Di bawah in yang bukan merupakan fitur umum yang digunakan dalam Multiple Criteria Desicion Making adalah...", "a": "A. Alternative", "b": "B. Konflik antar kriteria", "c": "C. Matriks keputusan", "d": "D. Keuntungan", "e": "", "benar": "D"}, {"soal": "Metode SAW mengenal adanya 2 (dua) atribut yaitu...", "a": "A. Benefit dan Alternative", "b": "B. Benefit dan Cost", "c": "C. Benefit dan Conflict", "d": "D. Cost dan Alternative", "e": "", "benar": "B"}, {"soal": "Metode Analytical Hierarchy Process dikembangkan oleh...", "a": "A. Prof. Lofti A. Zadeh", "b": "B. Fishburn", "c": "C. Thomas L. Saaty", "d": "D. Yoon dan Hwang", "e": "", "benar": "C"}, {"soal": "Yang bukan merupakan prinsip Analytical Hierarchy Process adalah...", "a": "A. Dekomposisi", "b": "B. Saling ketergantungan", "c": "C. Penilaian Komparasi", "d": "D. Penentuan Prioritas", "e": "", "benar": "B"}, {"soal": "Yang bukan merupakan kelebihan metode Analytical Hierarchy Process adalah...", "a": "A. Saling ketergantungan", "b": "B. Sistesis", "c": "C. Tanpa Pengujian", "d": "D. Trade Off", "e": "", "benar": "C"}, {"soal": "Salah satu kelebihan Analytical Hierarchy Process adalah “Mempertimbangkan prioritas relatif faktor-faktor pada sistem sehingga mampu memilih alternatif terbaik berdasarkan tujuan” atau biasa disebut...", "a": "A. Trade Off", "b": "B. Konsistensi", "c": "C. Sistesis", "d": "D. Konsensus", "e": "", "benar": "A"}, {"soal": "Metode Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS) adalah metode yang dibuat oleh...", "a": "A. Prof. Lofti A. Zadeh", "b": "B. Fishburn", "c": "C. Thomas L. Saaty", "d": "D. Yoon dan Hwang", "e": "", "benar": "D"}, {"soal": "Menentukan matriks solusi ideal positif dan solusi ideal negatif adalah tahapan dalam metode Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS). Tahapan tersebut dilakukan setelah melakukan...", "a": "A. Menghitung solusi ideal positif", "b": "B. Menghitung Pemisahan", "c": "C. Normalisasi bobot", "d": "D. Rank Alternatif", "e": "", "benar": "C"}, {"soal": "Himpunan Fuzzy mengenal adanya 2 (dua) atribut yaitu...", "a": "A. Linguistik dan Linear", "b": "B. Linguistik dan Selang", "c": "C. Linguistik dan Numeris", "d": "D. Linear dan Numeris", "e": "", "benar": "C"}, {"soal": "Di bawah ini manakah yang bukan merupakan komponen-komponen dalam SPK?", "a": "A. Communication", "b": "B. Data Management", "c": "C. Knowledge Management", "d": "D. Model Management", "e": "E. Communication Management", "benar": "E"}, {"soal": "Subsistem optional yang dapat mendukung subsistem lain atau bertindak sebagai komponen yang berdiri sendiri, merupakan penjabaran dari salah satu komponen dari SPK yaitu?", "a": "A. Communication", "b": "B. Data Management", "c": "C. Knowledge Management", "d": "D. Model Management", "e": "E. Communication Management", "benar": "C"}, {"soal": "Umur, temperatur, tanggungan, pendapatan, pengeluaran, dsb merupakan contoh dari istilah dalam sistem fuzzy yaitu?", "a": "A. Semesta Pembicaraan", "b": "B. Himpunan Fuzzy", "c": "C. Variabel Fuzzy", "d": "D. Domain Fuzzy", "e": "E. Inferensi", "benar": "C"}, {"soal": "Di bawah ini merupakan metode dalam untuk menyelesaikan masalah MADM, kecuali..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "D"}, {"soal": "Dekomposisi (Decomposition), Penilaian Komparasi (Comparative Judgment), dan Penentuan Prioritas (Synthesis of Priority), merupakan prinsip dasar dari..", "a": "A. Technique for Order Preference by Similarity to Ideal Solution(TOPSIS) ", "b": "B. Analytical Hierarchy Process (AHP)", "c": "C. Simple Additive Weighting (SAW)", "d": "D. Analytical Weighted Solution (AWS)", "e": "E. Profile Matching", "benar": "B"}, {"soal": "SPK Ditujukan untuk membantu keputusan-keputusankeputusan-keputusan. .. ", "a": "A.Terstruktur", "b": "B.Acak", "c": "C.Kurang Terstruktur", "d": "D.Membingungkan", "e": "E.Sulit", "benar": "C"}, {"soal": "Konsep mengenai DSS pertama kali dikemukakan awal tahun... ", "a": "A.1960-an", "b": "B.1970-an", "c": "C.1980-an", "d": "D.1990-an", "e": "E.1995-an", "benar": "A"}, {"soal": "Model simulasi benar-benar menunjukkan pola tingkah laku sistem nyata, adalah validitas model pada tingkatan", "a": "A. Absolutely Valid", "b": "B. Validasi", "c": "C. Replicaticely Valid", "d": "D. Structurally Valid", "e": "E. Predictively Valid", "benar": "D"}, {"soal": "Sebelum disusun rancangan sistem penunjang keputusan, harus mengetahui kriteria penyusunan rancangannya yang baik / berkualitas, antara-lain :", "a": "A. Performansi, informatif, ekonomis, kontrol meningkat, efisiensi, dan servis meningkat;", "b": "B. Efektif, tepat-waktu, dan akurat;", "c": "C. Mengurangi ketidak-pastian dan bersifat kejutan;", "d": "D. Fleksibel, mudah digunakan, responsif, dan komunikatif;", "e": "E. Throughput dan response-time.", "benar": "A"}, {"soal": "Menelaah kembali fakta-fakta historis, merupakan aktivitas dari analisa sistem :", "a": "A. Mempelajari Database", "b": "B. Mempelajari Sistem yang ada", "c": "C. Mempelajari Sistem Usulan", "d": "D. Mempelajari Sistem Berjalan", "e": "E. Merumuskan Spesifikasi Sistem", "benar": "B"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter, merupakan pengertian dari...", "a": "a. Profile Matching", "b": "b. Perhitungan gab ", "c": "c. Pembobotan ", "d": "d. Perhitungan nilai core factor (cf)", "e": "", "benar": "A"}, {"soal": "Berikut ini merupakan fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making, kecuali...", "a": "a. Alternative", "b": "b. Atribut", "c": "c. Bobot keputusan", "d": "d. Entitas ", "e": "", "benar": "D"}, {"soal": "Berikut ini merupakan kelebihan metode SAW, kecuali...", "a": "a. Dapat menemukan nilai bobot untuk masing-masing alternatif", "b": "b. Penilaian akan lebih tepat, karena berdasarkan pada nilai kriteria dan bobot preferensi  yang telah ditentukan", "c": "c. Terdapat mekanisme normalisasi matrik keputusan (X), yaitu proses matrik keputusan (X) ke dalam skala yang dapat diperbandingkan dengan semua rating alternatif yang ada  ", "d": "d. Perhitungan dilakukan dengan menggunakan bilangan crisp maupun fuzzy ", "e": "", "benar": "D"}, {"soal": "Salah satu teknik MCDM (Multi-Criteria Decision Making) yang sangat sederhana dan mudah diimplementasikan, digunakan ketika pengambil keputusan memilih metode pengambilan keputusan dengan pendekatan pembobotan yang sederhana, merupakan pengertian dari...", "a": "a. TOPSIS", "b": "b. TOSIS", "c": "c. TOPSOS", "d": "d. Semua salah", "e": "", "benar": "A"}, {"soal": "Berikut ini adalah proses MADM, kecuali...", "a": "a. Penyusunan komponen-komponen situasi", "b": "b. Analisis", "c": "c. Sintesis", "d": "d. Profile Matching", "e": "", "benar": "D"}, {"soal": "TOPSIS dikembangkan oleh...", "a": "a. Kusumadewi", "b": "b. Hwang dan Yoon", "c": "c. Park dan Choi", "d": "d. Hwang dan Kim", "e": "", "benar": "B"}, {"soal": "Berdasarkan tujuannya, MCDM dibagi menjadi...", "a": "a. MADM dan MODM", "b": "b. MDDM", "c": "c. MAADM", "d": "d. Semua jawaban salah ", "e": "", "benar": "A"}, {"soal": "Berikut ini merupakan kelemahan dari metode SAW, kecuali...", "a": "a. Digunakan pada pembobotan lokal", "b": "b. Perhitugan dilakukan dengan bilangan crips maupun fuzzy", "c": "c. Semua jawaban salah ", "d": "d. Opsi a dan b benar", "e": "", "benar": "D"}, {"soal": "Berikut ini yang bukan bagian dari prosedur TOPSIS adalah...", "a": "a. Membuat matriks keputusan yang ternormalisasi", "b": "b. Membuat matriks keputusan yang ternormalisasi terbobot", "c": "c. Menentukan matriks solusi ideal positif dan matriks solusi ideal negative", "d": "d. Menentukan rating kecocokan setiap alternatif pada setiap kriteria", "e": "", "benar": "D"}, {"soal": "Metode Weighted Prduct (WP) Merupakan metode pengambilan keputusan dengan cara  perkalian untuk menghubungkan rating atribut, dimana rating setiap atribut harus  dipangkatkan dulu dengan bobot atribut yang bersangkutan, merupakaan pengertian Weighted Prduct (WP) menurut...", "a": "a. Kusumadewi 2006", "b": "b. Kahraman, 2008", "c": "c. Frieyadie 2016", "d": "d. Eliyen & Efendi 2019", "e": "", "benar": "A"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan terdapat variabel prediktor merupakan pengertian dari...", "a": "a. Profile Matching", "b": "b. Metode WP", "c": "c. Multi Attribute Decision Making", "d": "d. Multiple Criteria Decision Making", "e": "", "benar": "A"}, {"soal": "Berikut tahapan-tahapan dalam penentuan keputusan menggunakan Profile Matching, kecuali...", "a": "a. Perhitungan Gap", "b": "b. Pembobotan", "c": "c. Identifikasi dan perhitungan CF dan SF", "d": "d. Perhitungan nilai rata-rata", "e": "", "benar": "D"}, {"soal": "Ada beberapa fitur umum yang digunakan dalam Multiple Criteria Decision Making, kecuali...", "a": "a. alternative", "b": "b. atribut", "c": "c. ranking", "d": "d. bobot keputusan", "e": "", "benar": "C"}, {"soal": "Metode pengambilan keputusan dengan cara perkalian untuk menghubungkan rating atribut disebut dengan...", "a": "a. Metode SAW", "b": "b. Metode WP", "c": "c. Multi Attribute Decision Making", "d": "d. Multiple Criteria Decision Making", "e": "", "benar": "B"}, {"soal": "Metode pengambilan keputusan yang sering dikernal dengan istilah penjumlahan terbobot disebut dengan...", "a": "a. Metode SAW", "b": "b. Metode WP", "c": "c. Multi Attribute Decision Making", "d": "d. Multiple Criteria Decision Making", "e": "", "benar": "A"}, {"soal": "Dibawah ini merupakan kelebihan Metode SAW, kecuali...", "a": "a. Menemukan nilai bobot untuk masing-masing alternatif", "b": "b. Penilaian akan lebih tepat", "c": "c. Terdapat mekanisme normalisasi matrik keputusan", "d": "d. Terdapat proses perangkingan untuk terpilih nilai terkecil", "e": "", "benar": "D"}, {"soal": "Berikut prinsip pokok Metode AHP, kecuali...", "a": "a. Menyusun hirarki", "b": "b. Menentukan prioritas", "c": "c. Menghitung penjumlahan terbobot", "d": "d. Menghitung Consistency Ratio (CR)", "e": "", "benar": "C"}, {"soal": "AHP merupakan metode pengambilan keputusan yang melibatkan...", "a": "a. Kriteria dan alternatif", "b": "b. Nilai bobot dan alternatif", "c": "c. Atribut dan bobot keputusan", "d": "d. Atribut dan rangking", "e": "", "benar": "A"}, {"soal": "Salah satu metode pengambilan keputusan yang menerapkan teknik MCDM (Multi-Criteria Decision Making) adalah...", "a": "a. Metode SAW", "b": "b. Metode WP", "c": "c. Metode AHP", "d": "d. Metode TOPSIS", "e": "", "benar": "D"}, {"soal": "Berikut kelebihan prosedur TOPSIS, kecuali...", "a": "a. Konsep sederhana namun sulit dipahami", "b": "b. Komputasinya efisien", "c": "c. Mengukur kinerja relatif", "d": "d. Alternatif keputusan dalam bentuk matematis yang sederhana", "e": "", "benar": "A"}, {"soal": "Berdasarkan tujuannya, Multiple Criteria Decision Making (MCDM) dibagi menjadi dua, yaitu… ", "a": "A. MADM dan MODM", "b": "B. MADM dan MBDM", "c": "C. MODM dan MPDM", "d": "D. MADM dan MIDM", "e": "E. MODM dan MIDM", "benar": "A"}, {"soal": "Solusi ideal positif 𝐴+ dan solusi ideal negatif 𝐴− dapat ditentukan setelah diketahui nilai… ", "a": "A. rating pengguna", "b": "B. rating bobot ternormalisasi", "c": "C. rating berbobot", "d": "D. rating perusahaan", "e": "E. rating kecocokan", "benar": "B"}, {"soal": "Jumlah tingkat dalam suatu hirarki adalah… ", "a": "A. 1", "b": "B. 2", "c": "C. 3", "d": "D. 4", "e": "E. tak terbatas", "benar": "E"}, {"soal": "Metode Simple Additive Weighting (SAW) sering juga dikenal dengan istilah metode… ", "a": "A. penjumlahan terbobot", "b": "B. pengurangan terbobot", "c": "C. perkalian terbobot", "d": "D. pembagian terbobot", "e": "E. perpangkatan terbobot", "benar": "A"}, {"soal": "Berikut ini yang bukan merupakan fitur umum yang akan digunakan dalam Multiple Criteria Desicion Making adalah… ", "a": "A. Alternative", "b": "B. Atribut", "c": "C. Rating", "d": "D. Bobot Keputusan", "e": "E. Matriks Keputusan", "benar": "C"}, {"soal": "Mekanisme pengambilan keputusan untuk mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dipenuhi oleh parameter disebut dengan…", "a": "A. Metode WP", "b": "B. Metode SAW", "c": "C. Metode AHP", "d": "D. Profile Matching", "e": "E. Metode TOPSIS", "benar": "D"}]
